{
  "id": "1536924",
  "type": "geoCategory",
  "title": "The 12 best seafood buffet restaurants in Ho Chi Minh City",
  "sourceDomain": null,
  "linkUrl": null,
  "headerImageKey": "zCzgFGHMN9nEzYN5j6wvgXvSqtJnfX6c",
  "geo": {
    "id": 16,
    "name": "Ho Chi Minh City"
  },
  "placeMetadata": [
    {
      "id": 1083085,
      "name": "The Log Restaurant",
      "placePageType": "visible",
      "placeId": "ChIJf1qTJ7UodTERbHYktGu2ras",
      "sources": [
        {
          "id": "178146",
          "type": "webPlacesList",
          "url": "https://local-insider.com/10-ideal-spots-for-a-romantic-dinner-in-ho-chi-minh-city/",
          "sourceSite": "Web",
          "snippet": "The LOG Restaurant have cozy, peaceful look, suitable for couples to enjoy dinner. Inspired by the wooden house in fairy tales, The LOG Restaurant offers diners the opportunity to experience a unique, sophisticated and modern space with both indoor and outdoor areas. Coming to The LOG, you will surely be impressed with the space that exudes a cozy, peaceful look, completely separated from the bustling and noisy scene of the city.",
          "siteName": "local-insider.com",
          "shortName": "10 ideal spots for a romantic dinner in Ho Chi Minh city",
          "indexInSource": 0,
          "iconSiteId": 21502,
          "showIcon": false,
          "showInternalLink": false,
          "showExternalLink": true,
          "showSiteNameOnWeb": true
        },
        {
          "id": "30885",
          "type": "webPlacesList",
          "url": "https://stylemotorbikes.com/top-10-best-seafood-buffet-in-ho-chi-minh/",
          "sourceSite": "Web",
          "snippet": "With Saigon seafood buffet, you can choose The LOG Restaurant. The restaurant has a large and airy space with lots of fresh seafood dishes: seafood buffet, lobster, crab, fish … and will give you a great meal. This is the right place for your family to enjoy seafood dishes.",
          "siteName": "Style Motorbikes – The best place to get a motorbike",
          "shortName": "Top 10 best seafood buffet in Ho Chi Minh",
          "indexInSource": 5,
          "iconSiteId": 685,
          "showIcon": false,
          "showInternalLink": false,
          "showExternalLink": true,
          "showSiteNameOnWeb": true
        },
        {
          "id": "1721247",
          "type": "webPlacesList",
          "url": "https://travelhome.vn/seafood-buffet-ho-chi-minh/",
          "sourceSite": "Web",
          "snippet": null,
          "siteName": "travelhome.vn",
          "shortName": "The 5 Hotels With Best Buffet In Hcmc, Best Seafood Buffet In Saigon For Lobster",
          "indexInSource": 5,
          "iconSiteId": 5389,
          "showIcon": false,
          "showInternalLink": false,
          "showExternalLink": true,
          "showSiteNameOnWeb": true
        }
      ],
      "description": null,
      "generatedDescription": "The Log Restaurant in Saigon is a popular choice for food enthusiasts seeking a unique dining experience. Located on the rooftop of GEM Center, it offers an open-air space designed to resemble a treehouse, creating a serene atmosphere surrounded by greenery. The restaurant's modern fusion cuisine is crafted with passion and creativity, presented as culinary works of art. Inspired by fairy tale wooden houses, the interior exudes coziness and tranquility with warm lighting and the scent of Meranti wood.",
      "categories": ["Restaurant"],
      "hasDetails": true,
      "minMinutesSpent": 120,
      "maxMinutesSpent": 120,
      "address": "Rooftop, Gem Center, 8 Đ. Nguyễn Bỉnh Khiêm, Đa Kao, Quận 1, Hồ Chí Minh 70000, Vietnam",
      "rating": 4.2,
      "numRatings": 836,
      "tripadvisorRating": 3.5,
      "tripadvisorNumRatings": 145,
      "website": "https://thelog.com.vn/",
      "internationalPhoneNumber": "+84 975 002 288",
      "priceLevel": 3,
      "imageKeys": [
        "drFGMNkGREhaKDffQIT8i3sQabOzDZ9b",
        "HNyO7PU40JLzRYnNINwUYNaQwx7ZGfIW",
        "nqK4H8xqm6HwjaR17ccvkPuUWfm3UFKx",
        "eaZqKxG2Kn19L94WAMofvEz8iSl0tqgh",
        "xSjdXoyCH38GaXmKuY8P8fLXW0tla03W"
      ],
      "images": [
        {
          "key": "drFGMNkGREhaKDffQIT8i3sQabOzDZ9b",
          "width": 1440,
          "height": 1080
        },
        {
          "key": "HNyO7PU40JLzRYnNINwUYNaQwx7ZGfIW",
          "width": 1920,
          "height": 1080
        },
        {
          "key": "nqK4H8xqm6HwjaR17ccvkPuUWfm3UFKx",
          "width": 1620,
          "height": 1080
        },
        {
          "key": "eaZqKxG2Kn19L94WAMofvEz8iSl0tqgh",
          "width": 1620,
          "height": 1080
        },
        {
          "key": "xSjdXoyCH38GaXmKuY8P8fLXW0tla03W",
          "width": 810,
          "height": 1080
        }
      ],
      "reviews": [
        {
          "reviewId": "ChZDSUhNMG9nS0VJQ0FnSURuMHZqU1ZREAE",
          "time": "2024-10-04T17:44:41.000Z",
          "reviewerName": "Mina Kang",
          "rating": 5,
          "rank": 1,
          "reviewText": "I came here for dinner with my parents to celebrate their wedding anniversary, and we greatly enjoyed our time here! The restaurant opens at 6PM, and we arrived a little after 6PM, so it was very empty, but around 7PM, it was pretty busy! We visited on a Monday for the Mega Monday deal ☺️\nThe food was great; We wanted to try many dishes, and my mother greatly enjoyed the lobster in truffle cream sauce. We went to order the lobster, but we do not speak Vietnamese, and the chef does not seem to speak English. However, a server in black suit quickly rushed to us and helped us order in fluent English. We greatly appreciated her help! This is not our first time here, and all the servers here are very professional and helpful 🌟\nI highly recommend getting the grilled lobster in spicy cheese or grilled scallop in spicy cheese 🌟🌟\nThe dessert section was also great! I liked the peanut butter chocolate mousse ☺️\nThe interior design is also quite beautiful 🌟"
        },
        {
          "reviewId": "ChZDSUhNMG9nS0VJQ0FnSURicXJDRVpBEAE",
          "time": "2024-08-04T05:49:13.000Z",
          "reviewerName": "Kamonwan Srikittichai",
          "rating": 5,
          "rank": 2,
          "reviewText": "Since I visit for hosting a private business dinner for group of 20 persons++ of Thai entrepreneurs so I reserved a room with provided projectors.\n\nThe staffs are more than happy to help and assisting and supports during the dine. The food are really nice which matched our requirements in having a special meal before getting back to Thailand.\n\nAlso, the decorations were really nice both the venue and food styling.\n\nWill visit again for my private dinner."
        },
        {
          "reviewId": "ChdDSUhNMG9nS0VJQ0FnSUNPdnRqaTFnRRAB",
          "time": "2022-06-11T06:09:45.000Z",
          "reviewerName": "Truong Duy Nguyen",
          "rating": 4,
          "rank": 3,
          "reviewText": "Good vibe, good decoration, however the quality of food is not consistent. I have visited here two times and the second time the quality and freshness of food are better.\n\nTheir lobsters, seafood and sashimi are not always fresh. I really enjoyed salmon on my recently visit. Beef steak is very good.\n\nTheir desserts are good too. Not so sweet.\n\nOverall, it is worth to try once for a while."
        },
        {
          "reviewId": "ChdDSUhNMG9nS0VJQ0FnTUR3cHVfenlBRRAB",
          "time": "2025-03-25T16:06:36.000Z",
          "reviewerName": "Tuan Le",
          "rating": 5,
          "rank": 3,
          "reviewText": "Outstanding Dining at The Log\n\nElegant ambiance, excellent service, and outstanding seafood. A must-visit for fine dining lovers!"
        },
        {
          "reviewId": "ChdDSUhNMG9nS0VJQ0FnSURaNkpfU3BRRRAB",
          "time": "2023-09-24T01:30:36.000Z",
          "reviewerName": "Philipp Staymann",
          "rating": 5,
          "rank": 4,
          "reviewText": "Best buffet I ever had. Plenty of fresh seafood and meat to choose from. I personally ate a lot of lobster and clams. You can have unlimited wine for a few bucks while enjoying the beautiful interior. The staff is friendly and very quick."
        },
        {
          "reviewId": "ChdDSUhNMG9nS0VOMnV3ZE9WdktYZWhRRRAB",
          "time": "2025-05-16T14:07:05.000Z",
          "reviewerName": "Alex Ngo",
          "rating": 1,
          "rank": 4,
          "reviewText": "Beside the good interior and decor, the place is totally not worth its reputation. The service staff is not well trained, with somewhat I-don't-care attitude. The food is okay for its price but it definitely just an oversell for someone who has not had western food. Over, I do not recommend this place. AT ALL."
        },
        {
          "reviewId": "ChdDSUhNMG9nS0VJQ0FnSUNlbTZyYnBRRRAB",
          "time": "2022-09-24T13:53:33.000Z",
          "reviewerName": "Dzulkifli Abd Rani",
          "rating": 4,
          "rank": 5,
          "reviewText": "Fresh seafood with variety of selections. However, the taste of all food was a bit too sweet. A bit dissapointed with the taste ( not sure if it's to suit the local taste since we had a better taste of Vietnamese dishes throughout our trip).\n\nNot recomended for those who don't like sweet taste in food. ( the fish were sweet, sauces were also sweet, and even mashed potatoes were sweet)\n\nI gave 4 stars because of freshness of food, variety, service and ambience."
        },
        {
          "reviewId": "ChZDSUhNMG9nS0VJQ0FnSUNtcE1QdVZREAE",
          "time": "2021-12-19T01:52:43.000Z",
          "reviewerName": "Top Saigon 6",
          "rating": 5,
          "rank": 6,
          "reviewText": "The place is supper to be honest. I went here during weekend - christmas time and the decorations are simple but gorgeous. Foods is definitely delicious and of course the price is at normal high standard. We dined in for a group of 10 and the total bill is just 11mil (with lobster and imported wine). Must try place for sure, dude!"
        }
      ],
      "geo": null,
      "permanentlyClosed": false,
      "businessStatus": "OPERATIONAL",
      "ratingDistribution": {
        "Google": {
          "1": 74,
          "2": 27,
          "3": 67,
          "4": 178,
          "5": 490
        }
      },
      "utcOffset": 420,
      "openingPeriods": [
        {
          "open": {
            "day": 0,
            "time": "1800"
          },
          "close": {
            "day": 0,
            "time": "2300"
          }
        },
        {
          "open": {
            "day": 1,
            "time": "1800"
          },
          "close": {
            "day": 1,
            "time": "2300"
          }
        },
        {
          "open": {
            "day": 2,
            "time": "1800"
          },
          "close": {
            "day": 2,
            "time": "2300"
          }
        },
        {
          "open": {
            "day": 3,
            "time": "1800"
          },
          "close": {
            "day": 3,
            "time": "2300"
          }
        },
        {
          "open": {
            "day": 4,
            "time": "1800"
          },
          "close": {
            "day": 4,
            "time": "2300"
          }
        },
        {
          "open": {
            "day": 5,
            "time": "1800"
          },
          "close": {
            "day": 5,
            "time": "2300"
          }
        },
        {
          "open": {
            "day": 6,
            "time": "1800"
          },
          "close": {
            "day": 6,
            "time": "2300"
          }
        }
      ]
    },
    {
      "id": 1083088,
      "name": "Mezz",
      "placePageType": "visible",
      "placeId": "ChIJ_cQd70kvdTERvsoysmk4bs0",
      "sources": [
        {
          "id": "30885",
          "type": "webPlacesList",
          "url": "https://stylemotorbikes.com/top-10-best-seafood-buffet-in-ho-chi-minh/",
          "sourceSite": "Web",
          "snippet": "The restaurant is known as the famous Saigon seafood buffet that diners should try once. This restaurant is famous for fresh lobster dish, sweet meat and not friable offline. Coming to this restaurant, you must try other dishes: crabs, oysters, snails, shrimps,…",
          "siteName": "Style Motorbikes – The best place to get a motorbike",
          "shortName": "Top 10 best seafood buffet in Ho Chi Minh",
          "indexInSource": 4,
          "iconSiteId": 685,
          "showIcon": false,
          "showInternalLink": false,
          "showExternalLink": true,
          "showSiteNameOnWeb": true
        },
        {
          "id": "1721247",
          "type": "webPlacesList",
          "url": "https://travelhome.vn/seafood-buffet-ho-chi-minh/",
          "sourceSite": "Web",
          "snippet": null,
          "siteName": "travelhome.vn",
          "shortName": "The 5 Hotels With Best Buffet In Hcmc, Best Seafood Buffet In Saigon For Lobster",
          "indexInSource": 4,
          "iconSiteId": 5389,
          "showIcon": false,
          "showInternalLink": false,
          "showExternalLink": true,
          "showSiteNameOnWeb": true
        }
      ],
      "description": null,
      "generatedDescription": "Nestled in the heart of Ho Chi Minh City, Mezz restaurant offers a delightful fusion of modern French design and traditional Vietnamese architecture. With its striking black and yellow color scheme, this dining haven features an airy atmosphere thanks to numerous windows that invite natural light. Guests can enjoy a sophisticated ambiance highlighted by wood-paneled ceilings, vintage ceramic tiles reminiscent of classic Vietnamese homes, and charming retro wine cabinets.",
      "categories": ["Restaurant"],
      "hasDetails": true,
      "minMinutesSpent": null,
      "maxMinutesSpent": null,
      "address": "17 Đ. Lê Duẩn, Bến Nghé, Quận 1, Hồ Chí Minh 700000, Vietnam",
      "rating": 4.4,
      "numRatings": 58,
      "tripadvisorRating": null,
      "tripadvisorNumRatings": null,
      "website": "https://www.sofitel.com/gb/hotel-2077-sofitel-saigon-plaza/index.shtml?utm_source=google+Maps&utm_medium=seo+maps&utm_campaign=seo+maps",
      "internationalPhoneNumber": "+84 28 3824 1555",
      "priceLevel": null,
      "imageKeys": [
        "rk3LnV10fSgXsoURQ88F8TAN6GZJ4yPz",
        "rz0FcJZ2AVs5zrgZmE8LKVGyYMsQ336W",
        "NRquxc7QSOQuCkLwxprUGTt2PTe01HHe"
      ],
      "images": [
        {
          "key": "rk3LnV10fSgXsoURQ88F8TAN6GZJ4yPz",
          "width": 1918,
          "height": 1080
        },
        {
          "key": "rz0FcJZ2AVs5zrgZmE8LKVGyYMsQ336W",
          "width": 1079,
          "height": 720
        },
        {
          "key": "NRquxc7QSOQuCkLwxprUGTt2PTe01HHe",
          "width": 1440,
          "height": 1080
        }
      ],
      "reviews": [
        {
          "reviewId": "ChZDSUhNMG9nS0VJQ0FnSURPaUx5eUtnEAE",
          "time": "2023-03-18T13:29:31.000Z",
          "reviewerName": "Neil Huang",
          "rating": 5,
          "rank": 2,
          "reviewText": "the breakfast is nice.\nthe servers are quite attentive.\n\n2023/03/19 had the seafood buffet for dinner.\nservice team was nice.\nhowever, the seafood could be better. from what I remember, many hotel has the same function. but Mezz has a higher fee. If that is the case, I would hope the seafood variety and freshness is almost like live catch standard.  Also, although it is seafood buffet, but the roast beef was slightly too dry."
        },
        {
          "reviewId": "ChZDSUhNMG9nS0VJQ0FnSUNmMHZIMUxnEAE",
          "time": "2024-12-27T16:00:03.000Z",
          "reviewerName": "Nguyen Ph.",
          "rating": 4,
          "rank": 1,
          "reviewText": "Lunch buffet: East Asian & Western cuisine - Nothing too memorable except for the Cantonese dishes\n\nFor a buffet ticket you get a free flow of tea and coffee juice bar is quite limited too.\n\nThe Mezz's \"Interactive Lunch Buffet\" from 12:00 – 14:30, Monday – Friday, serves popular cuisine (Japanese, Cantonese, Vietnamese, Western (idk salad bar, with very limited cheese and Charcuterie meat options, a pasta bar, pizza, and lots of dessert)\n\nI love how it gets packed during a normal Thursday lunch, but the food gets refilled very quickly. I enjoyed their salad bar with a good variety of dressings, and high-quality cheese, but nothing beat their Cantonese menu with all the popular dishes you can find. The Cantonese line was the first to run out when I was there so the people agreed with me. Other line of food was ok, not too wow or fab.\n\nThe server and the overall atmosphere were nice to me, but for a 5-star hotel, the space feels lil bit tight, tables were pretty close to each other.\n\nI think for the same price and luxurious experience, but better quality food, you can find other places in the same area."
        },
        {
          "reviewId": "ChZDSUhNMG9nS0VJQ0FnSUNPMHJDck5nEAE",
          "time": "2022-06-06T01:18:05.000Z",
          "reviewerName": "Aaron Soroka",
          "rating": 5,
          "rank": 3,
          "reviewText": "Mezz is the main restaurant inside the Sofitel Saigon Plaza and where the breakfast is served and more. This place has a great ambience, vibe and fitout that doesn't feel like a regular hotel venue. It feels a cross between the local market, food hall and buffet stand with a beautiful relaxed space. The staff here are super friendly, helpful and attentive. The food on offer is fresh and has a large variety and diversity to local food and western. Definitely recommend a visit, you won't leave hungry or disappointed"
        },
        {
          "reviewId": "ChZDSUhNMG9nS0VJQ0FnTUR3LXZ2eFBnEAE",
          "time": "2025-03-25T13:29:29.000Z",
          "reviewerName": "H Commhc",
          "rating": 3,
          "rank": 3,
          "reviewText": "Restaurant is cramped, dark.  Flavor was odd, fish overcooked, appetizer strange taste, desert strange, service was ok but the two waitress both had very poor English skills; worse English than any other restaurant out of 11 days in Vietnam and this is a western Hotel location in central Ho Chi Minh district 1"
        },
        {
          "reviewId": "ChdDSUhNMG9nS0VJQ0FnSURNcXFxcXdnRRAB",
          "time": "2019-12-26T04:02:50.000Z",
          "reviewerName": "Matt Laird",
          "rating": 2,
          "rank": 4,
          "reviewText": "Food variety was good. Flavors were ok. Some of the dishes were not well cooked. Turkey was dry. Clams were not fresh. Rice was off. Food servers were not well trained. They had trouble Cutting and serving the meats properly. My biggest was the noise level. The staff had decorated all the tables with blow whistles and clackers to celebrate Christmas. We were sat next to a family of 3 small children. The children kept running around the tables yelling and blowing the whistles and clackers. It felt like a kid’s birthday party at Chuck E Cheese not a 5 star buffet. It totally ruined the meal for me."
        },
        {
          "reviewId": "ChdDSUhNMG9nS0VJQ0FnSUNzME5LUXJBRRAB",
          "time": "2020-01-19T06:46:12.000Z",
          "reviewerName": "tai nguyen",
          "rating": 5,
          "rank": 5,
          "reviewText": "Delicious foods. I love sushi bar here. Fresh fish. Grilled pork - beef - lambs not so good."
        },
        {
          "reviewId": "ChdDSUhNMG9nS0VJQ0FnSURwN3RYdjRRRRAB",
          "time": "2023-08-22T12:25:28.000Z",
          "reviewerName": "Thy Ty",
          "rating": 5,
          "rank": 6,
          "reviewText": "Pastry is very nice, Dimsum not good so hard, not yummy as other places\nStaff is friendly"
        },
        {
          "reviewId": "ChZDSUhNMG9nS0VOdkFzZTZ1dU9lckZ3EAE",
          "time": "2025-05-14T00:44:09.000Z",
          "reviewerName": "ANGELA SIM",
          "rating": 5,
          "rank": 7,
          "reviewText": "The service was top notch especially from That Man Lan. Appreciate her pro-active service and friendliness."
        }
      ],
      "geo": null,
      "permanentlyClosed": false,
      "businessStatus": "OPERATIONAL",
      "ratingDistribution": {
        "Google": {
          "1": 1,
          "2": 4,
          "3": 5,
          "4": 8,
          "5": 37
        }
      },
      "utcOffset": 420,
      "openingPeriods": [
        {
          "open": {
            "day": 0,
            "time": "0600"
          },
          "close": {
            "day": 0,
            "time": "1100"
          }
        },
        {
          "open": {
            "day": 1,
            "time": "0600"
          },
          "close": {
            "day": 1,
            "time": "1030"
          }
        },
        {
          "open": {
            "day": 1,
            "time": "1200"
          },
          "close": {
            "day": 1,
            "time": "1430"
          }
        },
        {
          "open": {
            "day": 2,
            "time": "0600"
          },
          "close": {
            "day": 2,
            "time": "1030"
          }
        },
        {
          "open": {
            "day": 2,
            "time": "1200"
          },
          "close": {
            "day": 2,
            "time": "1430"
          }
        },
        {
          "open": {
            "day": 3,
            "time": "0600"
          },
          "close": {
            "day": 3,
            "time": "1030"
          }
        },
        {
          "open": {
            "day": 3,
            "time": "1200"
          },
          "close": {
            "day": 3,
            "time": "1430"
          }
        },
        {
          "open": {
            "day": 4,
            "time": "0600"
          },
          "close": {
            "day": 4,
            "time": "1030"
          }
        },
        {
          "open": {
            "day": 4,
            "time": "1200"
          },
          "close": {
            "day": 4,
            "time": "1430"
          }
        },
        {
          "open": {
            "day": 5,
            "time": "0600"
          },
          "close": {
            "day": 5,
            "time": "1030"
          }
        },
        {
          "open": {
            "day": 5,
            "time": "1200"
          },
          "close": {
            "day": 5,
            "time": "1430"
          }
        },
        {
          "open": {
            "day": 6,
            "time": "0600"
          },
          "close": {
            "day": 6,
            "time": "1100"
          }
        }
      ]
    },
    {
      "id": 1083096,
      "name": "Pachi Pachi Nướng Lẩu Nhật Bản",
      "placePageType": "visible",
      "placeId": "ChIJA4NJAjUvdTERTfGNCjVCVSI",
      "sources": [
        {
          "id": "30885",
          "type": "webPlacesList",
          "url": "https://stylemotorbikes.com/top-10-best-seafood-buffet-in-ho-chi-minh/",
          "sourceSite": "Web",
          "snippet": "If you want to enjoy grilled buffer dishes, you can come to Pachi Pachi restaurant. This is a famous seafood buffet from Saigon that has been known to tourists from near and far. With delicious marinade sauce, seafood dishes are much loved.",
          "siteName": "Style Motorbikes – The best place to get a motorbike",
          "shortName": "Top 10 best seafood buffet in Ho Chi Minh",
          "indexInSource": 2,
          "iconSiteId": 685,
          "showIcon": false,
          "showInternalLink": false,
          "showExternalLink": true,
          "showSiteNameOnWeb": true
        },
        {
          "id": "1721247",
          "type": "webPlacesList",
          "url": "https://travelhome.vn/seafood-buffet-ho-chi-minh/",
          "sourceSite": "Web",
          "snippet": null,
          "siteName": "travelhome.vn",
          "shortName": "The 5 Hotels With Best Buffet In Hcmc, Best Seafood Buffet In Saigon For Lobster",
          "indexInSource": 2,
          "iconSiteId": 5389,
          "showIcon": false,
          "showInternalLink": false,
          "showExternalLink": true,
          "showSiteNameOnWeb": true
        }
      ],
      "description": null,
      "generatedDescription": "Pachi Pachi Lẩu Nướng Nhật Bản is a restaurant that prides itself on its dedication to creating visually appealing and high-quality dishes. The establishment carefully sources its ingredients and prepares them with precision, offering both a la carte and buffet options for patrons to savor. In addition to grilled meats and seafood, the menu includes traditional Japanese fare such as rice, soup, noodles, set lunches, and fried chicken.",
      "categories": ["Japanese restaurant"],
      "hasDetails": true,
      "minMinutesSpent": null,
      "maxMinutesSpent": null,
      "address": "52 Đ. Mạc Đĩnh Chi, Đa Kao, Quận 1, Hồ Chí Minh, Vietnam",
      "rating": 4.1,
      "numRatings": 752,
      "tripadvisorRating": 4.5,
      "tripadvisorNumRatings": 26,
      "website": null,
      "internationalPhoneNumber": "+84 28 6295 9294",
      "priceLevel": 2,
      "imageKeys": [
        "SmqPy6s8mzEq22Z46IQk5NkmXIO0nXe8",
        "88XFeZdigDzTv64wnPxSzks4I7mQD6tD",
        "9sWjcyO96Wi2kCZayCx8uiAIEKc35NA0"
      ],
      "images": [
        {
          "key": "SmqPy6s8mzEq22Z46IQk5NkmXIO0nXe8",
          "width": 1280,
          "height": 984
        },
        {
          "key": "88XFeZdigDzTv64wnPxSzks4I7mQD6tD",
          "width": 710,
          "height": 399
        },
        {
          "key": "9sWjcyO96Wi2kCZayCx8uiAIEKc35NA0",
          "width": 710,
          "height": 473
        }
      ],
      "reviews": [
        {
          "reviewId": "ChZDSUhNMG9nS0VJQ0FnSURRaGJmS0F3EAE",
          "time": "2018-07-04T04:58:28.000Z",
          "reviewerName": "Hai Tran",
          "rating": 5,
          "rank": 1,
          "reviewText": "A lot of kinds of food. All of them seem to be good quality.The flavor is okay.\nThis place is \"all you can eat\" restaurant with reasonable price.\nThey have BBQ and hotpot also. But I often feel so full before I can order hotpot.\nWhen it is crowded, you have to wait a few minute to get order. Sometimes, the staff is a bit slow.\nOverall, everything is good here is you want to have a full stomach before come back home."
        },
        {
          "reviewId": "ChdDSUhNMG9nS0VJQ0FnSURtbTlfbnhRRRAB",
          "time": "2022-02-10T06:20:20.000Z",
          "reviewerName": "An Nguyen",
          "rating": 2,
          "rank": 2,
          "reviewText": "This is the first time I've ever experienced the bad feeling when I was having a BUFFET dinner. I went there and waited for 5 minutes just for having menu. Since my friends come a bit late I ordered Pepsi to drink and some dishes first. However I had been waiting for 15 mins just for a can of Pepsi. After few times friendly remind about food they brought me 3 dishes of beef and then again another waiting. I know that's they are a bit busy because lots of people come to eat as year end parties but I wait for so long and my grill mat isn't good enough so my food is stuck with some coal dust. Therefore I had to repeat myself several times to get it changed. When I come to a BUFFET restaurant I expect that food is served quickly and plentifuly because I pay a lot to eat freely and comfortably. I would never come back to this place."
        },
        {
          "reviewId": "ChdDSUhNMG9nS0VJQ0FnSUNROElPR2xRRRAB",
          "time": "2017-08-06T07:02:22.000Z",
          "reviewerName": "Khải Đơn",
          "rating": 4,
          "rank": 3,
          "reviewText": "i had set lunch here several times. Food are nice. but the Udon noodle is not impressive much. The space is convenient but noisy. it is a place mainly for BBQ at night. the light is warm and dim, good for lunch, nice for group casual dinner, but not suggest this place for private dinner."
        },
        {
          "reviewId": "ChdDSUhNMG9nS0VJQ0FnSUNoNzVhNjJRRRAB",
          "time": "2023-02-25T15:22:28.000Z",
          "reviewerName": "Ares Xu",
          "rating": 3,
          "rank": 4,
          "reviewText": "Lunch set is value for money, but the taste of fried pork is really below average"
        },
        {
          "reviewId": "ChdDSUhNMG9nS0VJQ0FnSURDNXRXSmh3RRAB",
          "time": "2020-09-26T14:23:15.000Z",
          "reviewerName": "Saladin Golden",
          "rating": 4,
          "rank": 5,
          "reviewText": "Good service, fresh meat. There is a limit of 5 oysters per buffet customer."
        },
        {
          "reviewId": "ChdDSUhNMG9nS0VJQ0FnTUNReUlMd3RRRRAB",
          "time": "2025-03-01T13:00:57.000Z",
          "reviewerName": "Mario Jäckle",
          "rating": 5,
          "rank": 5,
          "reviewText": "Very nice and caring Service and the food was quite delicious. Prices are very fair and reasonable."
        },
        {
          "reviewId": "ChZDSUhNMG9nS0VJQ0FnSUMwZ1B5ZmFREAE",
          "time": "2019-09-10T07:34:34.000Z",
          "reviewerName": "Teddy lee",
          "rating": 4,
          "rank": 6,
          "reviewText": "The price is cheap, the taste is good and the atmosphere is good.\nIt's good to go with your lover."
        },
        {
          "reviewId": "ChZDSUhNMG9nS0VJQ0FnSUNBaThlLVRnEAE",
          "time": "2017-12-06T12:25:41.000Z",
          "reviewerName": "will huang",
          "rating": 5,
          "rank": 8,
          "reviewText": "A fusion of Korean and Japanese food... Lots of choices... And good price... Highly recommend :)"
        }
      ],
      "geo": null,
      "permanentlyClosed": false,
      "businessStatus": "OPERATIONAL",
      "ratingDistribution": {
        "Google": {
          "1": 59,
          "2": 20,
          "3": 72,
          "4": 206,
          "5": 393
        }
      },
      "utcOffset": 420,
      "openingPeriods": [
        {
          "open": {
            "day": 0,
            "time": "1030"
          },
          "close": {
            "day": 0,
            "time": "1500"
          }
        },
        {
          "open": {
            "day": 0,
            "time": "1700"
          },
          "close": {
            "day": 0,
            "time": "2200"
          }
        },
        {
          "open": {
            "day": 1,
            "time": "1030"
          },
          "close": {
            "day": 1,
            "time": "1500"
          }
        },
        {
          "open": {
            "day": 1,
            "time": "1700"
          },
          "close": {
            "day": 1,
            "time": "2200"
          }
        },
        {
          "open": {
            "day": 2,
            "time": "1030"
          },
          "close": {
            "day": 2,
            "time": "1500"
          }
        },
        {
          "open": {
            "day": 2,
            "time": "1700"
          },
          "close": {
            "day": 2,
            "time": "2200"
          }
        },
        {
          "open": {
            "day": 3,
            "time": "1030"
          },
          "close": {
            "day": 3,
            "time": "1500"
          }
        },
        {
          "open": {
            "day": 3,
            "time": "1700"
          },
          "close": {
            "day": 3,
            "time": "2200"
          }
        },
        {
          "open": {
            "day": 4,
            "time": "1030"
          },
          "close": {
            "day": 4,
            "time": "1500"
          }
        },
        {
          "open": {
            "day": 4,
            "time": "1700"
          },
          "close": {
            "day": 4,
            "time": "2200"
          }
        },
        {
          "open": {
            "day": 5,
            "time": "1030"
          },
          "close": {
            "day": 5,
            "time": "1500"
          }
        },
        {
          "open": {
            "day": 5,
            "time": "1700"
          },
          "close": {
            "day": 5,
            "time": "2200"
          }
        },
        {
          "open": {
            "day": 6,
            "time": "1030"
          },
          "close": {
            "day": 6,
            "time": "1500"
          }
        },
        {
          "open": {
            "day": 6,
            "time": "1700"
          },
          "close": {
            "day": 6,
            "time": "2200"
          }
        }
      ]
    },
    {
      "id": 1083104,
      "name": "Gió Nội Restaurant Level 9",
      "placePageType": "visible",
      "placeId": "ChIJH2Cnjj0vdTERhy1lbvIQdoM",
      "sources": [
        {
          "id": "30885",
          "type": "webPlacesList",
          "url": "https://stylemotorbikes.com/top-10-best-seafood-buffet-in-ho-chi-minh/",
          "sourceSite": "Web",
          "snippet": "Located on the 9th floor of Liberty Sai Gon Parkview Hotel, this restaurant is a famous seafood buffet in Saigon near and far. Go to the restaurant to enjoy the taste of fresh seafood dishes, you can also enjoy the scenery of the city from above. The restaurant is famous for a crab dish that is made to fit every customer.",
          "siteName": "Style Motorbikes – The best place to get a motorbike",
          "shortName": "Top 10 best seafood buffet in Ho Chi Minh",
          "indexInSource": 0,
          "iconSiteId": 685,
          "showIcon": false,
          "showInternalLink": false,
          "showExternalLink": true,
          "showSiteNameOnWeb": true
        },
        {
          "id": "1721247",
          "type": "webPlacesList",
          "url": "https://travelhome.vn/seafood-buffet-ho-chi-minh/",
          "sourceSite": "Web",
          "snippet": null,
          "siteName": "travelhome.vn",
          "shortName": "The 5 Hotels With Best Buffet In Hcmc, Best Seafood Buffet In Saigon For Lobster",
          "indexInSource": 0,
          "iconSiteId": 5389,
          "showIcon": false,
          "showInternalLink": false,
          "showExternalLink": true,
          "showSiteNameOnWeb": true
        }
      ],
      "description": null,
      "generatedDescription": "Level 9 Restaurant is located on the ninth floor of Liberty Saigon Parkview Hotel in downtown Saigon. The restaurant provides an advantage of the panoramic city view and serves a variety of seafood dishes that are popular among patrons. The crab dish is notably unique and often ordered by diners. Buffet price is reasonable, and the food is delicious.",
      "categories": ["Restaurant"],
      "hasDetails": true,
      "minMinutesSpent": null,
      "maxMinutesSpent": null,
      "address": "265 Đ. Phạm Ngũ Lão, Phường Phạm Ngũ Lão, Quận 1, Hồ Chí Minh, Vietnam",
      "rating": 4,
      "numRatings": 89,
      "tripadvisorRating": null,
      "tripadvisorNumRatings": null,
      "website": null,
      "internationalPhoneNumber": "+84 28 3836 5172",
      "priceLevel": 2,
      "imageKeys": [
        "ySQ0XsmV4nDUlBp2gxr1Iz3T6zDPMFGM",
        "ruwverX5dHSn6lZBpP34YzY3NQacamrY",
        "7r4xeTfgCPBSrrgVpP0Uu9VOUNmzYVQC",
        "UXf9tWtXVlZUyF3qXSZzIIw5SqvTuSz7"
      ],
      "images": [
        {
          "key": "ySQ0XsmV4nDUlBp2gxr1Iz3T6zDPMFGM",
          "width": 1440,
          "height": 1080
        },
        {
          "key": "ruwverX5dHSn6lZBpP34YzY3NQacamrY",
          "width": 810,
          "height": 1080
        },
        {
          "key": "7r4xeTfgCPBSrrgVpP0Uu9VOUNmzYVQC",
          "width": 710,
          "height": 502
        },
        {
          "key": "UXf9tWtXVlZUyF3qXSZzIIw5SqvTuSz7",
          "width": 710,
          "height": 502
        }
      ],
      "reviews": [
        {
          "reviewId": "ChZDSUhNMG9nS0VJQ0FnSUNZX2EySkF3EAE",
          "time": "2019-04-17T17:04:06.000Z",
          "reviewerName": "Comp Care",
          "rating": 5,
          "rank": 3,
          "reviewText": "Loved it"
        },
        {
          "reviewId": "ChZDSUhNMG9nS0VJQ0FnSUQ0eGNXV2NREAE",
          "time": "2019-06-14T12:18:44.000Z",
          "reviewerName": "Handi Suyadi",
          "rating": 4,
          "rank": 1,
          "reviewText": "The Local Food Should be Tried\n\nNha Hang Level 9 seem routinely offer buffet at lunch with reasonable price. Wide array of menu was available. Large number of sections were local food. Most of them seem appetizing to be tried and the good thing was had great taste. In my opinion, during eating at there much better take local food rather than main buffet which most of menu offered seem quite playing safe.\n\nFor unknown reason, the floor at outside was rather sticky. Area near beverage left sticky without get cleaned."
        },
        {
          "reviewId": "ChdDSUhNMG9nS0VJQ0FnSURBX3FiYy13RRAB",
          "time": "2016-11-22T12:55:06.000Z",
          "reviewerName": "mui kien Chin",
          "rating": 4,
          "rank": 2,
          "reviewText": "Buffet price reasonable and food is variety."
        },
        {
          "reviewId": "ChZDSUhNMG9nS0VJQ0FnSUM0bnYtbU5BEAE",
          "time": "2019-06-07T00:44:53.000Z",
          "reviewerName": "Shadyraven 1 (Nha Raven)",
          "rating": 4,
          "rank": 4,
          "reviewText": "Got a clear view of Prey Norkor(Saigon/ Ho Chi Minh City)."
        },
        {
          "reviewId": "ChdDSUhNMG9nS0VJQ0FnSURZMDRfc21RRRAB",
          "time": "2019-05-21T23:30:37.000Z",
          "reviewerName": "Darrel Gilbert",
          "rating": 5,
          "rank": 5,
          "reviewText": "Good location friendly staff good buffet"
        },
        {
          "reviewId": "ChdDSUhNMG9nS0VJQ0FnSUMwLTVMS3p3RRAB",
          "time": "2019-10-12T07:31:21.000Z",
          "reviewerName": "Tuan Pham Minh",
          "rating": 4,
          "rank": 6,
          "reviewText": "Average, about 230k for adult and half for children"
        },
        {
          "reviewId": "ChdDSUhNMG9nS0VJQ0FnSURzbE8yTnpnRRAB",
          "time": "2020-02-24T15:51:33.000Z",
          "reviewerName": "VNH Singapore",
          "rating": 3,
          "rank": 7,
          "reviewText": "Just ok"
        },
        {
          "reviewId": "ChdDSUhNMG9nS0VJQ0FnSURrdjVyUnhBRRAB",
          "time": "2019-07-13T06:52:13.000Z",
          "reviewerName": "Van Nguyen",
          "rating": 4,
          "rank": 8,
          "reviewText": "Should have more dishes."
        }
      ],
      "geo": null,
      "permanentlyClosed": false,
      "businessStatus": "OPERATIONAL",
      "ratingDistribution": {
        "Google": {
          "1": 4,
          "2": 3,
          "3": 17,
          "4": 32,
          "5": 33
        }
      },
      "utcOffset": 420,
      "openingPeriods": [
        {
          "open": {
            "day": 0,
            "time": "0630"
          },
          "close": {
            "day": 0,
            "time": "2130"
          }
        },
        {
          "open": {
            "day": 1,
            "time": "0630"
          },
          "close": {
            "day": 1,
            "time": "2130"
          }
        },
        {
          "open": {
            "day": 2,
            "time": "0630"
          },
          "close": {
            "day": 2,
            "time": "2130"
          }
        },
        {
          "open": {
            "day": 3,
            "time": "0630"
          },
          "close": {
            "day": 3,
            "time": "2130"
          }
        },
        {
          "open": {
            "day": 4,
            "time": "0630"
          },
          "close": {
            "day": 4,
            "time": "2130"
          }
        },
        {
          "open": {
            "day": 5,
            "time": "0630"
          },
          "close": {
            "day": 5,
            "time": "2130"
          }
        },
        {
          "open": {
            "day": 6,
            "time": "0630"
          },
          "close": {
            "day": 6,
            "time": "2130"
          }
        }
      ]
    },
    {
      "id": 12969616,
      "name": "À Lôi BBQ - Buffet Nướng Sân Vườn Tân Phú",
      "placePageType": "visible",
      "placeId": "ChIJtY7mfgAvdTERyVYAQcVveP8",
      "sources": [
        {
          "id": "30885",
          "type": "webPlacesList",
          "url": "https://stylemotorbikes.com/top-10-best-seafood-buffet-in-ho-chi-minh/",
          "sourceSite": "Web",
          "snippet": "One of the Top 10 best seafood buffets in Ho Chi Minh is the Thai BBQ buffet restaurant. You will enjoy grilled buffet – hotpot with a variety of seafood: shrimp, fish, squid, sashimi,… when coming to this restaurant. If you choose the Thai BBQ buffet, besides seafood there are other grilled dishes and hot pots so you can change the flavour for yourself.",
          "siteName": "Style Motorbikes – The best place to get a motorbike",
          "shortName": "Top 10 best seafood buffet in Ho Chi Minh",
          "indexInSource": 1,
          "iconSiteId": 685,
          "showIcon": false,
          "showInternalLink": false,
          "showExternalLink": true,
          "showSiteNameOnWeb": true
        },
        {
          "id": "1721247",
          "type": "webPlacesList",
          "url": "https://travelhome.vn/seafood-buffet-ho-chi-minh/",
          "sourceSite": "Web",
          "snippet": null,
          "siteName": "travelhome.vn",
          "shortName": "The 5 Hotels With Best Buffet In Hcmc, Best Seafood Buffet In Saigon For Lobster",
          "indexInSource": 1,
          "iconSiteId": 5389,
          "showIcon": false,
          "showInternalLink": false,
          "showExternalLink": true,
          "showSiteNameOnWeb": true
        }
      ],
      "description": null,
      "generatedDescription": null,
      "categories": ["Restaurant"],
      "hasDetails": true,
      "minMinutesSpent": 180,
      "maxMinutesSpent": 180,
      "address": "787 Đ. Lũy Bán Bích, Phú Thọ Hoà, Tân Phú, Hồ Chí Minh, Vietnam",
      "rating": 4.6,
      "numRatings": 1003,
      "tripadvisorRating": null,
      "tripadvisorNumRatings": null,
      "website": null,
      "internationalPhoneNumber": "+84 779 049 490",
      "priceLevel": null,
      "imageKeys": [
        "BMcnSJy19HtDSrYicoXfTwAfn5RBpL3g",
        "WmKcAWsGcuufavRKFDZMwVVMjCad6za8",
        "9NmiHv6n86N8l0FFBaEGTbIAzSLejrLU"
      ],
      "images": [
        {
          "key": "BMcnSJy19HtDSrYicoXfTwAfn5RBpL3g",
          "width": 1440,
          "height": 1080
        },
        {
          "key": "WmKcAWsGcuufavRKFDZMwVVMjCad6za8",
          "width": 1080,
          "height": 1080
        },
        {
          "key": "9NmiHv6n86N8l0FFBaEGTbIAzSLejrLU",
          "width": 810,
          "height": 1080
        }
      ],
      "reviews": [],
      "geo": null,
      "permanentlyClosed": false,
      "businessStatus": "OPERATIONAL",
      "ratingDistribution": {
        "Google": {
          "1": 77,
          "2": 19,
          "3": 27,
          "4": 28,
          "5": 861
        }
      },
      "utcOffset": 420,
      "openingPeriods": [
        {
          "open": {
            "day": 0,
            "time": "1600"
          },
          "close": {
            "day": 0,
            "time": "2200"
          }
        },
        {
          "open": {
            "day": 1,
            "time": "1600"
          },
          "close": {
            "day": 1,
            "time": "2200"
          }
        },
        {
          "open": {
            "day": 2,
            "time": "1600"
          },
          "close": {
            "day": 2,
            "time": "2200"
          }
        },
        {
          "open": {
            "day": 3,
            "time": "1600"
          },
          "close": {
            "day": 3,
            "time": "2200"
          }
        },
        {
          "open": {
            "day": 4,
            "time": "1600"
          },
          "close": {
            "day": 4,
            "time": "2200"
          }
        },
        {
          "open": {
            "day": 5,
            "time": "1600"
          },
          "close": {
            "day": 5,
            "time": "2200"
          }
        },
        {
          "open": {
            "day": 6,
            "time": "1600"
          },
          "close": {
            "day": 6,
            "time": "2200"
          }
        }
      ]
    },
    {
      "id": 14886903,
      "name": "Central Restaurant",
      "placePageType": "visible",
      "placeId": "ChIJ6xXIOwAvdTEReYFFG4G3wpI",
      "sources": [
        {
          "id": "1721247",
          "type": "webPlacesList",
          "url": "https://travelhome.vn/seafood-buffet-ho-chi-minh/",
          "sourceSite": "Web",
          "snippet": "The restaurant’s seafood is extremely fresh and when you order it, the staff will quickly bring it up after the kitchen is finished processing. Cool and spacious space for diners to enjoy these dishes. Address: 59 – 61 Pasteur, District 1, HCMCOpening time: 6 pm – 10 pmPrice: 299,000 VND – 700,000 VND",
          "siteName": "travelhome.vn",
          "shortName": "The 5 Hotels With Best Buffet In Hcmc, Best Seafood Buffet In Saigon For Lobster",
          "indexInSource": 3,
          "iconSiteId": 5389,
          "showIcon": false,
          "showInternalLink": false,
          "showExternalLink": true,
          "showSiteNameOnWeb": true
        },
        {
          "id": "30885",
          "type": "webPlacesList",
          "url": "https://stylemotorbikes.com/top-10-best-seafood-buffet-in-ho-chi-minh/",
          "sourceSite": "Web",
          "snippet": "The restaurant’s seafood is extremely fresh and when you order it, the staff will quickly bring it up after the kitchen is finished processing. Cool and spacious space for diners to enjoy these dishes.",
          "siteName": "Style Motorbikes – The best place to get a motorbike",
          "shortName": "Top 10 best seafood buffet in Ho Chi Minh",
          "indexInSource": 3,
          "iconSiteId": 685,
          "showIcon": false,
          "showInternalLink": false,
          "showExternalLink": true,
          "showSiteNameOnWeb": true
        }
      ],
      "description": null,
      "generatedDescription": "Nestled on the third floor of a hotel, Central Restaurant offers an inviting and spacious atmosphere perfect for enjoying a delightful meal. Renowned for its incredibly fresh seafood, diners can expect prompt service as dishes are swiftly delivered once prepared. This upscale venue is ideal for starting your day with a hearty breakfast or indulging in diverse international cuisine throughout lunch and dinner. With its luxurious yet cozy ambiance, Central Restaurant is also an excellent choice for entertaining guests or spending quality time with family and friends.",
      "categories": ["Buffet restaurant"],
      "hasDetails": true,
      "minMinutesSpent": null,
      "maxMinutesSpent": null,
      "address": "within Hotel Liberty Central Saigon Citypoint, Pasteur/59 Ward, Bến Nghé, Quận 1, Hồ Chí Minh, Vietnam",
      "rating": 3.6,
      "numRatings": 10,
      "tripadvisorRating": null,
      "tripadvisorNumRatings": null,
      "website": "https://www.libertycentralsaigoncitypoint.com/en/dining/#home",
      "internationalPhoneNumber": "+84 28 3822 5678",
      "priceLevel": null,
      "imageKeys": [
        "4SnKr0cdpZybOGky73pgqB0S9kg80J93",
        "vlFkmqGrhB6O0EB3FeP6wWJXnRZG1cci",
        "iNsddnVl1OJE6tTVsWli1gTp2wQScnAN"
      ],
      "images": [
        {
          "key": "4SnKr0cdpZybOGky73pgqB0S9kg80J93",
          "width": 1440,
          "height": 1080
        },
        {
          "key": "vlFkmqGrhB6O0EB3FeP6wWJXnRZG1cci",
          "width": 1080,
          "height": 1080
        },
        {
          "key": "iNsddnVl1OJE6tTVsWli1gTp2wQScnAN",
          "width": 1620,
          "height": 1080
        }
      ],
      "reviews": [
        {
          "reviewId": "ChdDSUhNMG9nS0VJQ0FnSUQzOFB5ZWpnRRAB",
          "time": "2024-11-11T13:22:10.000Z",
          "reviewerName": "M Mixue",
          "rating": 5,
          "rank": 1,
          "reviewText": "We had seafood buffet with unlimited lobsters and drinks! Very value for money. Reservation recommended as it was fully booked on fri and weekend dinners."
        },
        {
          "reviewId": "ChdDSUhNMG9nS0VJQ0FnSUR2dmVEVTV3RRAB",
          "time": "2025-03-18T10:00:26.000Z",
          "reviewerName": "K Chi Tran",
          "rating": 1,
          "rank": 2,
          "reviewText": "Buffet the bad ever. seafood not fresh and smells, terrible.   Food is very little. Slow and bad Service, not good. Never comback!"
        },
        {
          "reviewId": "ChZDSUhNMG9nS0VJQ0FnSUNmazctN1J3EAE",
          "time": "2025-01-01T08:59:35.000Z",
          "reviewerName": "Austin Chang",
          "rating": 1,
          "rank": 3,
          "reviewText": "After we ate the dinner last on 12/31, 4 of my friends got sick and vomit 🤮 a lot till next day, and still stomachache because of the oyster was not fresh, that’s very bad.😞"
        },
        {
          "reviewId": "ChZDSUhNMG9nS0VJQ0FnSUNmdXV6Q1R3EAE",
          "time": "2024-12-28T08:07:41.000Z",
          "reviewerName": "Ô Loan Kiệt",
          "rating": 5,
          "rank": 4,
          "reviewText": "In my opinion, the best restaurant in Sapa"
        },
        {
          "reviewId": "ChZDSUhNMG9nS0VPcW9ycldsbmFXMU9BEAE",
          "time": "2025-05-13T16:44:28.000Z",
          "reviewerName": "Dan Nguyen",
          "rating": 4,
          "rank": 5,
          "reviewText": "(Translated by Google) This buffet restaurant is open from Thursday to Sunday from 6pm to 10pm\nPros:\n- Suitable for an evening of entertaining guests, dating or simply meeting family and friends.\n- Luxurious, cozy space, located right in the city center\n- View of the intersection of Le Loi and Pasteur streets - opposite Takashimaya.\n- Menu with many dishes from Asia to Europe:\nSashimi, Steak, Pasta, Salad, Cheese of all kinds, with an open kitchen area ready to serve and many choices of cakes and desserts.\nCons:\n- Parking motorbikes to eat is a bit inconvenient, parking outside\n- Prices are quite high compared to other buffet restaurants in the area.\n- Open kitchen takes a long time to prepare seafood\n\n(Original)\nNhà hàng buffet này mở cửa từ thứ 5 đến CN trong khung giờ 18h-22h\nĐiểm cộng:\n- Phù hợp cho một buổi tối tiếp khách, hẹn họ hoặc đơn giản là họp mặt gia đình, bạn bè.\n- Không gian sang trọng, ấm cúng, vị trí ngay trung tâm Thành phố\n- View ngắm ngã tư đường Lê Lợi, Pasteur - đối diện Takashimaya.\n-Thực đơn nhiều món bao gồm từ Á sang Âu:\nCác loại Sashimi, Steak, Pasta, Salad, Cheese các loại, có khu vực Bếp mở sẵn sàng phục vụ và rất nhiều lựa chọn bánh ngọt, tráng miệng.\nĐiểm trừ:\n- Giữ xe máy để lên ăn hơi bất tiện, gửi bãi ngoài\n- Giá khá cao so với các nhà hàng buffet trong khu vực.\n- Bếp mở chế biến hải sản khá lâu nha"
        },
        {
          "reviewId": "ChZDSUhNMG9nS0VJQ0FnSURQLXFHV1J3EAE",
          "time": "2024-12-01T13:38:37.000Z",
          "reviewerName": "Nguyen Luong Hung",
          "rating": 5,
          "rank": 6,
          "reviewText": "(Translated by Google) Location: 3rd Floor\nOperating hours: Breakfast: 6:00 - 10:00 (Monday - Friday) | 6:00 - 10:30 (Saturday - Sunday)\nLunch: 11:30 - 14:30 (for buffet & a la carte)\nDinner: 18:00 - 22:30 (for buffet & a la carte)\nIn the sophisticated and luxurious space of a high-end restaurant, Central Restaurant is the place to start the day with a delicious breakfast and enjoy a multinational cuisine from attractive local dishes. Central Restaurant's team of experienced chefs will serve you with a diverse a la carte menu and rich buffets, where fresh and selected ingredients will be prepared to bring international cuisine alongside traditional Vietnamese dishes.\nMy family has eaten buffet here 5 times and feels satisfied with the food and service at this place 😍😍🥤🥤🍜🍜\n\n(Original)\nVị trí: Tầng 3\nGiờ hoạt động: Bữa sáng: 6:00 - 10:00 (Thứ 2 - Thứ 6) | 6:00 - 10:30 (Thứ 7 - Chủ Nhật)\nBữa trưa: 11:30 - 14:30 (đối với buffet & gọi món)\nBữa tối: 18:00 - 22:30 (đối với buffet & gọi món)\nTrong không gian tinh tế và sang trọng của một nhà hàng cao cấp, Central Restaurant là nơi bắt đầu ngày mới bằng một bữa sáng thơm ngon và thưởng thức nền ảm thực đa quốc gia từ những món ăn địa phương hấp dẫn. Đội ngũ đầu bếp dày kinh nghiệm của Central Restaurant sẽ phục vụ bạn với thực đơn gọi món đa dạng và những bữa tiệc buffet phong phú, mà các loại nguyên liệu tươi mới và tuyển chọn sẽ được chế biến để mang đến nét ẩm thực quốc tế song song các món Việt Nam truyền thống.\nGia đình tôi đã ăn buffet ở đây 5 lần rồi và cảm thấy hài lòng về thức ăn và dịch vụ ở nơi này 😍😍🥤🥤🍜🍜"
        },
        {
          "reviewId": "ChdDSUhNMG9nS0VJQ0FnSUNfNjRfYXpBRRAB",
          "time": "2025-01-19T04:46:20.000Z",
          "reviewerName": "SaDu",
          "rating": 4,
          "rank": 7,
          "reviewText": "(Translated by Google) - Location: the hotel is quite easy to find, the restaurant is located on the 3rd floor of the hotel.\n- Space: feels a bit small, the outdoor space is not very large, looking at the traffic jam :) and bitexco.\n- The line counter has quite a few dishes, there are also few seafood dishes because when I went to eat at CVL, I saw a lot of dishes, so when I came here, I saw few dishes, so I was a little surprised, there were few sashimi, small drops, the grilled crab and oyster counter was the same, small. drop. Crab cut into quarters for diners. Lobster can be ordered. If I go at 6am, I can only order about 2 times. Free wine and beer, but I don't drink. The tamarind-roasted crab dish I find is the most delicious of all the dishes. Sweets are fine. Haven't tried the ice cream bar yet.\n- Service is good, but it takes a long time to clear plates and refill filtered water.\n\n(Original)\n- Vị trí: khách sạn khá dễ tìm, nhà hàng nằm ở tầng 3 của khách sạn.\n- Không gian: cảm thấy hơi nhỏ tí, không gian ngoài trời cũng không rộng lắm, nhìn dòng người kẹt xe :) và bitexco.\n- Quầy line khá ít món,hải sản cũng ít món vì mình đi ăn CVL thấy nhiều món nên sang đây thấy ít món, nên hơi ngỡ ngàng xíu, sashimi cũng ít, lên nhỏ giọt, quầy cua hàu nướng cũng vậy, lên nhỏ giọt. Cua cắt làm tư cho thực khách luôn. Tôm hùm thì order. Mình đi từ 6g thì order được tầm 2 lượt thôi. Được free rượu vang, bia nhưng mình không uống. Món cua rang me mình thấy ngon nhất trong các món. Đồ ngọt cũng được. Chưa thử quầy kem.\n- service ổn nhưng mà dọn dĩa lâu, fill nước lọc lâu."
        },
        {
          "reviewId": "ChdDSUhNMG9nS0VJQ0FnSUNfeTdEZzVnRRAB",
          "time": "2025-01-19T01:07:04.000Z",
          "reviewerName": "Son Bui",
          "rating": 5,
          "rank": 8,
          "reviewText": "(Translated by Google) Had a very nice dinner. Great service, delicious food, warm hospitality\n\n(Original)\nCó một bữa tối rất đẹp. Dịch vụ tuyệt vời, thức ăn ngon, lòng hiếu khách nồng hậu"
        }
      ],
      "geo": null,
      "permanentlyClosed": false,
      "businessStatus": "OPERATIONAL",
      "ratingDistribution": {
        "Google": {
          "1": 3,
          "2": 0,
          "3": 0,
          "4": 2,
          "5": 5
        }
      },
      "utcOffset": 420,
      "openingPeriods": [
        {
          "open": {
            "day": 0,
            "time": "0600"
          },
          "close": {
            "day": 0,
            "time": "2230"
          }
        },
        {
          "open": {
            "day": 1,
            "time": "0600"
          },
          "close": {
            "day": 1,
            "time": "2230"
          }
        },
        {
          "open": {
            "day": 2,
            "time": "0600"
          },
          "close": {
            "day": 2,
            "time": "2230"
          }
        },
        {
          "open": {
            "day": 3,
            "time": "0600"
          },
          "close": {
            "day": 3,
            "time": "2230"
          }
        },
        {
          "open": {
            "day": 4,
            "time": "0600"
          },
          "close": {
            "day": 4,
            "time": "2230"
          }
        },
        {
          "open": {
            "day": 5,
            "time": "0600"
          },
          "close": {
            "day": 5,
            "time": "2230"
          }
        },
        {
          "open": {
            "day": 6,
            "time": "0600"
          },
          "close": {
            "day": 6,
            "time": "2230"
          }
        }
      ]
    },
    {
      "id": 428802,
      "name": "Hotel Nikko Saigon",
      "placePageType": "visible",
      "placeId": "ChIJF9cbwBsvdTERxQn29H80jjU",
      "sources": [
        {
          "id": "527994",
          "type": "webPlacesList",
          "url": "https://www.subtitlelist.com/en/BEST-All-You-Can-Eat-SEAFOOD-Buffet-in-Saigon-VIETNAM-157647",
          "sourceSite": "Web",
          "snippet": "there's no way this looks like something I get from a buffet like zero never seen it before that's a little nervous today I really am I'm a little speechless I got goose bumps going on hey guys it's Mike Jenna here in Vietnam as you know every country I go to I always try to seek out some of the best local all-you-can-eat buffets and this one this one here at the Hotel Nikko Saigon I think this one's gonna be pretty easy hello is this a buffet okay you're not open yeah right 6 p.m. I'm gonna be the first in line here okay let's go stay here in anticipation Music guys I've been to a lot about face in my day you know I have and those are my favorite and just I'm a little speechless because I'm feeling kind of overwhelmed I gotta just show you because I took a quick walk around this buffet I'm getting chills you can't see right now but I got goose bumps going on my friend Viet here hey Viet how you doing so this is all seafood here appetizer we always stick the fest always Stefan Thanks fresh oyster from French yes cannabase it's finger food finger food matches appetizing Catherine Mercer from New Zealand he with tartar sauce so much variety it's not just simply like gonna get us to get some salad and thrown into a place smoked salmon from Scotland this is like a combination of just different foods around from around the world what is that steamed cake and she's rolling it in she like a fresh spring roll here salad bar cheese kind of we're gonna we're gonna bypass the Sally's a little bit because they're more exciting stuff ahead of us I promise you guys that this is crazy they have paging doctor the Peking duck and it's served like this yes you already with the chef he was hit over on preparation to cook for you and after that just speak up to your table and enjoy you brought to my table this looks like something I will get at a four or five-star restaurant look this there's no way this looks like something I get from a buffet like zero never seen it before you haven't seen the most exciting part yet there's a part in this buffet that I'm so excited about let's keep going let's go inside you have hot pot at a buffet yeah the top part here is over there I mean I've been to all you eat you hop up her face and I been to all-you-can-eat buffets I never seen them together and this is just incredible quality of ingredients you know this is a marriage made in buffet hotpot heaven this is a true station for you this choco drew mystery all the seafood here and the lobster we have more than night the recipe to cook and we serve the lobster at the table i order from the table you guys cook it the way I want and bring the lobster to my table just see thank you so much my friend I'm gonna I'm gonna get my eat on so I'm gonna get started I formulated a plan I'm thinking the first thing I need to do is order some lobsters and hi so what kind of lobsters do you have again grow with cheese that's a Chinese style well I won't go with cheese and then with chilli so that's like Singapore chilli crab almost so how long would that be five minutes I got five minutes to go get my other stuff I can do this thank you so much let's go mussels this spring roll looks like it has Chinese sausage inside I love China inside and I definitely need one with shrimp inside and steam roll for sure okay I think that's all I can fit in this plate let's put this back and get into play Oh my lobsters here wow what great timing huh got my lobster got my plate oh that's barbecue real well let's just dig in cuz lobster waits for no man when you see hot lobster in front of ya you gotta pay us some attention immediately that tastes almost exactly like the chili crap I had in Singapore at chef war well it's a lobster it's sweet a little eggy not very spicy at all Oh ma'am my lobster is so fresh which is like the slops you just swim to my plate and I just want to make sure I get that meat all over that delicious chili eggy sauce this is insane - it makes sense right it tastes good on crab why not officer and I don't even know how to even begin with it I feel like I'm gonna first date right now I'm just so overwhelmed I'm intimidated by this buffet by how many things I want to try on this buffet let's just crack open a claw let's burn it now right now by the way you know what I was kind of wondering like what kind of sauce I should dip this in and yeah is what tastes good with some sauce maybe like a little spicy mayo or something but as is this is already delicious and on this home it just has too sweet briny flavor excuse me what what do you dip this in usually oh thank you thank you it's so nice here I never seen a buffet where the crab is literally alive right before they cook it is a live one of effect this is as fresh as you can ever get thank you so much so you put this over some chili some lime in some salt and pepper dip it in the sauce oh wow that's perfect for crab its citrusy peppery spicy and it doesn't take away from the sweetness of the crab meat itself oh thank you sure what she's lobsters are here I've talked about she's lobsters before because always used to have them at Chinese banquets and I never see them cooked really anywhere else before especially not at about face cuz usually you go to a buffet even if there is lobster it's usually steamed or boiled and maybe sometimes grilled and I'll tell you guys this is my favorite way to eat lobster I can't believe they'd do that here on an all-you-can-eat buffet I can have as much of this as I want I'm starting out with pork sorry crab let's just you for a second look at this guy's straight out of the oven I gotta pick this up I know it's hot but oh you can taste the smoke definitely taste the cheese mix with that beautifully sweet lobster meat Music you ever seen Lobster do that before she goes so good with lobster that's why I lobster mac and cheese work so well no it's good another one going oh yeah oh yeah oh yeah we don't need anything else there's just real apps for me wrapped all in this gooey cheese once you guys tried this way of preparing Lobster trust me you're gonna absolutely love it Music so perfect this is literally the third Lobster I'm finishing right now I'm just gonna tip it a little bit in the sauce for my crab because then it's gonna a little too cheesy for me haha but how much I love romantic comedies I didn't think that was possible but that citrus and chilli on the lobster means that I could probably eat like double the amount of lobster than usual okay I'm gonna hit pause on the seat but just because this is all sitting here I want to try this out first this little cocktail shrimp with a little lime and it looks like sriracha mayo in some dill oh one dwarf mmm spicy mayo I feel like it has a little ketchup in here yeah and there's a little Chandi yes it's a cute little cheese sandwich shaped like a little football there's some some sweet onions we're jamming here we're delicious you know I'd make it better add a little lobster me to here somebody loves lobster sandwich now it's shoes on cheese on lobster you know that's gonna be good I'm behind this baby for what looks like maybe some lettuce a little toaster hmm everything I had so far it's been superb superb I can't wait for this I think that's port near here shrimp beef noodles everything is so fresh all the ingredients still ridiculously fresh and well prepared all right I'm gonna wrap this up then we gonna go for round two at this moment this is the most valuable real estate you need but this this speaking duck dish that needs to get in here right now this is officers about the sauce fish sauce can never be wasted never I don't even care but the breads gonna fill up my stomach I don't it's that good I really hope that if you guys come to this buffet that they have this particular dish this might be one of the best things I've had out any buffet at any time anywhere I would pay money for this at a restaurant like no questions asked I don't know what this is but I mean it's here I'm gonna dip it a little bit again excuse me I'll be right back yeah I had to right away get another plate of this thing you do with some of the fruits this time I just can't get over how ridiculous this dish is unbelievably good I think also that there's bits of peppercorn here to get some of that nice numbing flavor there's just a greater stamp all right plate number four we're going after the main dishes here I can order a bit in these noodle soup okay so here this kinda like a like a Mongolian style barbecue supper with much better ingredients my chance is thank you this is a noodle soup gonna add some scallions a little bit of gel Thai chili pepper corn there's a tiny bit lime and you said a little bit of sriracha like tiny bit and then my stir-fried noodles gonna be done in about five minutes thank you here we go oh I can't wait for this to customize noodles one soup one stir-frying the soups got a couple pieces of corn here oh the beautiful wide rice noodles I have fun before this tastes a lot like the crab noodle soup I had on the middle port and I love how citrusy the Super Soaker ah it takes borderline like a Tom Yum soup and no wonder they call this Vietnamese rule golf these noodles are the same size as udon noodles but of course this is made with rice Music for production I know I'm eating a lot of dishes that fill up a lot of room in my stomach but I got no regrets next up this is my own creation I didn't put a lot of things in here there's some mushrooms some onions and then just beef and a little it looks like egg noodles these noodles are assuring my expectations were really low because I'm thinking because it just looks like boring old egg noodles Wow double Wow first of all you don't cook perfectly chewy perfect degree of doneness in the sauce it seems like some sort of salty sauce worth actually no one piece sort of like that Vietnamese chili sauce I had from before but whatever this is it is highly addictive highly objective I never advocate going from you know that a buffet I certainly don't advocate going for a second helping of noodles out of up bay but I'm gonna down this now I'm going for a second ball wow those noodles now I need to go get this I think when you do this you put it onto your tray it's a massive wants could I get a shabu yeah that'd be great and then do I get this grilled somewhere oh yeah thank you oh come back and get both you got it see you soon and while we wait let's see if there's something I missed pork neck would muster was not here before Oh comforting look at this look at that doesn't that just look pretty pork neck with mustard and this also wasn't here stir-fried seafood a little bit of fried rice this should tide me over until my hot pots ready pork right but it tastes like those pigs that fight against those really angry birds because this is top hey sometime here so with the hotpot what you do is you put whatever you want on your place so I got some beef some random veggies I think one of those is mine yeah thank you today you can get some more sauce here so what they basically did was it just took the ingredients and they boiled it and you just dip it in the sauce first of all your goodies massive prawns Chuck on a hill Oh bet oh yeah I love it when they use wooden charcoal because the smoky flavor is so enhanced and I have some fish sauce and chili oh my gosh some candy actually human just without sauce I got an octopus I'm not sure why - Kendra hmm that's really good whoa that might be burning the shrimp in the shabu-shabu not really what I expected I thought you feel I got like a pot best that's kind expect a little too much here okay this is not a shabu shabu plays hold of me me just cut a little thick and they give you some sauce to go with it Music it's not half bad because the meat is sliced kinda thick it is a little tougher than I like but the quality of meat is good the sauce is nice I mean for a buffet I'll tell you what I've had worse than actual hot pot restaurants all right here guys I gotta see what time it is yep this there's our time I don't know what Fuji cake is all I know is I want something this looks good Oh cappuccino drink looking thing oh yeah I need this this might be the last one they had dessert round always bittersweet oh hopefully a more sweet than bitter this is something I'm happy for green bean soup is something that Chinese love and its really awesome a drink this was hot outside this is a dessert drink we pushed order in here but we never add seafood and I had this bizarre at another restaurant here of Vietnam it tastes pretty good Music this one does as well it's slightly funky bizarre the seaweed flavor is more pronounced here but stuff I love love mumbling subsides mum peanut green bean we call a noodle or Indian Chinese but it's really mombi all right pleasant as day this is ridiculously good it tastes a little bit like Chinese yogurt I'm a much swear a much prettier Music it's so good alright let's get to this cheers to a great buffet guys every single one of these beautifully designed plates that came out of a babe has been spectacular and this is no exception this ha player I think is raspberry jam the cake here in the middle it's firm but it breaks down really easily and when it goes into your mouth and my smack in the middle it's a layer of fruity I think maybe strawberry mousse the whole thing if tarp as sweet this buttery is a great way to wrap up this meal fantastic way to wrap up this meal well if you can't tell I kind of like this buffet and add up all the buffets I've ever been to this one probably had the freshest seafood and this is the only place I've ever seen that and especially the size place of food for you and those dishes not only look amazing they take - even better and I'm pretty sure when I say this that this is the best super buffet I've been to so far in my life and guys there's another reason this place is awesome just walk it around it if you ask me how much this buffet cost I will usually say 80 90 and maybe even a hundred dollars but this place 53 US dollars so yes I highly highly highly highly recommend this place so if you're ever in Saigon where you're ever in Vietnam but you know what if you're in the Southeast Asia region you need to come and eat at this place also I'll just think of this morning check this out I think I've determined that Saigon is one of the best cities in the world to go on a vacation here's watch plane ticket aside if you can find a time when the plane ticket it's not that much hotels Arabi and he's like nice ones in this city goes for like twenty thirty forty dollars so you get a cheap flight you come here and you book a nice hotel you book a nice Airbnb that's what I'm gonna run you thirty forty dollars a night then you only really need to budget like five to ten hours a day for food I mean what is that cheap in the city and is ridiculously good and then like one night you splurge a little bit you come here best vacation ever and guys as always the information for this place is listed in my description box thank y'all so much for watching thank you so much for joining me on this awesome seafood buffet adventure and I'm till we get again I'll see you later",
          "siteName": "subtitlelist.com",
          "shortName": "BEST All You Can Eat SEAFOOD Buffet in Saigon VIETNAM",
          "indexInSource": 0,
          "iconSiteId": 52467,
          "showIcon": false,
          "showInternalLink": false,
          "showExternalLink": true,
          "showSiteNameOnWeb": true
        }
      ],
      "description": "Refined hotel with 2 restaurants, a lobby bar & an outdoor pool, plus a gym & a spa.",
      "generatedDescription": "Hotel Nikko Saigon is a luxurious 5-star hotel offering 388 well-appointed rooms, suites, and apartments. It features two restaurants, a lobby bar, an outdoor pool, a gym, and a spa with treatment rooms. The hotel boasts the second largest ballroom in Ho Chi Minh City and seven meeting rooms. Guests can enjoy the Nikko Club Lounge on the 23rd floor with spectacular city views.",
      "categories": ["Hotel"],
      "hasDetails": true,
      "minMinutesSpent": null,
      "maxMinutesSpent": null,
      "address": "235 Đ. Nguyễn Văn Cừ, Phường Nguyễn Cư Trinh, Quận 1, Hồ Chí Minh 700000, Vietnam",
      "rating": 4.6,
      "numRatings": 7959,
      "tripadvisorRating": null,
      "tripadvisorNumRatings": null,
      "website": "http://www.hotelnikkosaigon.com.vn/",
      "internationalPhoneNumber": "+84 28 3925 7777",
      "priceLevel": null,
      "imageKeys": [
        "zCzgFGHMN9nEzYN5j6wvgXvSqtJnfX6c",
        "5qE1uYDDa6m1WMmXoNRy8Pyhr9Hsq6up",
        "rWMr1AMhYUoeAvirWFYsp1p47uoZEIjr"
      ],
      "images": [
        {
          "key": "zCzgFGHMN9nEzYN5j6wvgXvSqtJnfX6c",
          "width": 1920,
          "height": 1076
        },
        {
          "key": "5qE1uYDDa6m1WMmXoNRy8Pyhr9Hsq6up",
          "width": 1440,
          "height": 1080
        },
        {
          "key": "rWMr1AMhYUoeAvirWFYsp1p47uoZEIjr",
          "width": 1200,
          "height": 767
        }
      ],
      "reviews": [
        {
          "reviewId": "ChdDSUhNMG9nS0VJQ0FnTUNZdUlMMTRRRRAB",
          "time": "2025-05-01T05:04:08.000Z",
          "reviewerName": "alyssa tandoc",
          "rating": 5,
          "rank": 1,
          "reviewText": "I shall continue to come back to this hotel every time I am in Saigon because they provided extra care during our stay and ensured a smooth process!\n\nFrom the first tea to morning breakfast to allowing us to keep our luggage upon our trip’s return, Hotel Nikko is the best place to stay in Saigon.\n\nRaymond was excellent bell man during our stay and deserves all the praise! He ensured all of our numerous luggage was safe. No request was too large. I hope to meet him again during my next visit."
        },
        {
          "reviewId": "ChZDSUhNMG9nS0VJQ0FnTUR3dE5XM1BREAE",
          "time": "2025-03-23T23:58:37.000Z",
          "reviewerName": "Abby Tan",
          "rating": 4,
          "rank": 1,
          "reviewText": "I had wine at the lobby lounge, the waiters are polite and good smile, make me had my second glass of wine, love it😁.\n\nBreakfast, i didn't take photo. But is variety choices. I like it so much😋😋. Oh ya, can have a walk at their garden after breakfast.\n\nMaybe it is quiet old hotel? But the bed is no sink as what i expert. Definitely will want to stay again.\n\nBeside had a shopping mall, able to look for food, however is not much. Take grab to Takashimaya shopping mall, is ok for me."
        },
        {
          "reviewId": "ChdDSUhNMG9nS0VJQ0FnTURJOEt1MWxnRRAB",
          "time": "2025-04-06T13:29:29.000Z",
          "reviewerName": "Judy Seto",
          "rating": 5,
          "rank": 2,
          "reviewText": "Luc, Nam, and Thai gave us great services! They are always very attentive and give us additional napkins! They come to fill our drinks and take away the used plates often. They provide excellent customer services. Thank you so much for your services, all! We had a great experiences here! 😃"
        },
        {
          "reviewId": "ChZDSUhNMG9nS0VJQ0FnTURvaVp2LUFnEAE",
          "time": "2025-04-26T06:11:17.000Z",
          "reviewerName": "Adisa Ejubovic",
          "rating": 5,
          "rank": 2,
          "reviewText": "Very nice stay at Nikko Saigon Hotel. Rooms are spacious and clean. Nice gym and pool area and everything worked out perfectly. Breakfast has had a lot of variety and fresh coconuts were a highlight! We had shuttle service to take us to a different location every day.\n\nVery attentive and great service. The staff was there to help us with everything, even planning and booking our next trip to Nha Trang. Would highly recommend this hotel to anyone."
        },
        {
          "reviewId": "ChZDSUhNMG9nS0VJQ0FnTURJMnF1dVJnEAE",
          "time": "2025-04-09T02:55:41.000Z",
          "reviewerName": "San Do",
          "rating": 5,
          "rank": 3,
          "reviewText": "I recently had the pleasure of staying at Hotel Nikko Saigon in Ho Chi Minh City, and I must say it was an exceptional experience from start to finish. This five-star property truly lives up to its reputation for relaxation and refined Japanese hospitality.\n\nFrom the moment I arrived, I was greeted by the warm and professional staff at the front desk. Tracy, in particular, went above and beyond to ensure my check-in process was smooth and personalized. She took the time to explain all the hotel amenities and even offered recommendations for local attractions. Her attention to detail and genuine smile made me feel instantly welcome.\n\nThe room was absolutely stunning - spacious, modern, and impeccably clean with a minimalist design that created a sense of tranquility. The marble bathroom with its separate soaking tub and walk-in shower was luxurious, and I appreciated thoughtful touches like the electronic Toto toilet system and high-quality toiletries. The 42-inch flat-screen TV, complimentary high-speed Wi-Fi, and comfortable workstation made it perfect for both relaxation and business needs.\n\nOne of the highlights of my stay was dining at La Brasserie. The restaurant staff there deserves special recognition for their exceptional service. They were knowledgeable about every dish, attentive without being intrusive, and always ready with thoughtful recommendations. The international buffet breakfast was simply outstanding - possibly the widest selection I've ever seen at a hotel. Their seafood dinner buffet was equally impressive, featuring unlimited lobsters, crabs, and oysters that were fresh and delicious.\n\nI also had the opportunity to visit the 5 Senses restaurant on the ground floor, which offers modern Japanese cuisine with creative flair. The presentation of each dish was like a work of art, and the flavors were extraordinary. Again, the staff's expertise and friendly demeanor enhanced the dining experience.\n\nThe hotel's facilities are top-notch. The outdoor pool provided a peaceful retreat after a day of exploring the city. The fitness center was well-equipped with modern machines, and the spa services were rejuvenating. I particularly enjoyed spending time in the Nikko Club Lounge on the 23rd floor, which offers spectacular views of the city along with complimentary refreshments throughout the day.\n\nWhile the hotel is located slightly away from the main tourist areas, this actually became an advantage as it provided a peaceful sanctuary away from the hustle and bustle of the city. The complimentary shuttle service to major attractions made it convenient to explore Ho Chi Minh City.\n\nWhat truly sets Hotel Nikko Saigon apart is its staff. From the concierge team who helped arrange tours and transportation, to the housekeeping staff who maintained the room to perfection, to the attentive servers at all dining venues - everyone demonstrated the highest level of professionalism and genuine care for guests.\n\nHotel Nikko Saigon has definitely become my go-to accommodation in Ho Chi Minh City. The combination of luxurious amenities, exceptional dining options, and outstanding service makes it well worth the price. I'm already looking forward to my next visit!"
        },
        {
          "reviewId": "ChdDSUhNMG9nS0VJQ0FnTURJOWVMdzFBRRAB",
          "time": "2025-04-12T00:41:28.000Z",
          "reviewerName": "Siwon Park",
          "rating": 5,
          "rank": 4,
          "reviewText": "Room, facility, and service was great, and would recommend to stay here at Hotel Nikko Saigon.\n\nEspecially Buffet staffs' service stood out. When I was enjoying Seafood buffet at while staying at the hotel, the roast beef was a bit too raw and tough for me. I cut off parts I did not like, and it was cleared by the server named Nguyen Yen Nhi. She looked closely at my plate and reported something to her manager. Then the manager Tran Van Than(Robert) came up to me and asked what I did not like about the food. He apologized for the food condition then offered me to bring some stake to my taste. Ms. Nguyen and Robert constantly looked after my table and were very attentive. Food was amazing, but the thing touched my heart  was staff's service level.\n\nThanks to their service I will strongly recommend my friends and family to stay at the Nikko Saigon, and to try the seafood buffet even if they don't stay at different hotel.\n\nThank you so much for perfecting my stay."
        },
        {
          "reviewId": "ChZDSUhNMG9nS0VJQ0FnTUNZdVpTb1NnEAE",
          "time": "2025-05-05T13:59:47.000Z",
          "reviewerName": "정석현",
          "rating": 5,
          "rank": 5,
          "reviewText": "lucas, dang and steven is very professional!\nI had a truly delightful experience at the hotel buffet, and a particular staff member made it even more special. Their service was outstanding – they were attentive, friendly, and went above and beyond to ensure my satisfaction. I was thoroughly impressed with their professionalism and warm demeanor. It's because of excellent staff like this that my visit was so enjoyable. Highly recommend!"
        },
        {
          "reviewId": "ChZDSUhNMG9nS0VJQ0FnTURvc2FfdklREAE",
          "time": "2025-04-26T02:25:06.000Z",
          "reviewerName": "Christy Le-Ponce",
          "rating": 5,
          "rank": 6,
          "reviewText": "We really love the service at Nikko Saigon. We were upgraded to a 2br suite upon arrival since we were a family of 4. They let us check in at 8am in the morning which  was unexpected but so delighted. The rooms were clean and comfortable. They also allowed late check out at 2pm since our flight departs at 7pm. The service was exceptional! We will definitely stay here again."
        }
      ],
      "geo": null,
      "permanentlyClosed": false,
      "businessStatus": "OPERATIONAL",
      "ratingDistribution": {
        "Google": {
          "1": 167,
          "2": 76,
          "3": 301,
          "4": 1396,
          "5": 6001
        }
      },
      "utcOffset": 420,
      "openingPeriods": null
    },
    {
      "id": 2613724,
      "name": "Delisa - Fresh Salad Bar HCM",
      "placePageType": "visible",
      "placeId": "ChIJ2dd1E4wvdTERRkLrv5Jj1zo",
      "sources": [
        {
          "id": "527994",
          "type": "webPlacesList",
          "url": "https://www.subtitlelist.com/en/BEST-All-You-Can-Eat-SEAFOOD-Buffet-in-Saigon-VIETNAM-157647",
          "sourceSite": "Web",
          "snippet": "I'm gonna be the first in line here okay let's go stay here in anticipation Music guys I've been to a lot about face in my day you know I have and those are my favorite and just I'm a little speechless because I'm feeling kind of overwhelmed I gotta just show you because I took a quick walk around this buffet I'm getting chills you can't see right now but I got goose bumps going on my friend Viet here hey Viet how you doing so this is all seafood here appetizer we always stick the fest always Stefan Thanks fresh oyster from French yes cannabase it's finger food finger food matches appetizing Catherine Mercer from New Zealand he with tartar sauce so much variety it's not just simply like gonna get us to get some salad and thrown into a place smoked salmon from Scotland this is like a combination of just different foods around from around the world what is that steamed cake and she's rolling it in she like a fresh spring roll here salad bar cheese kind of we're gonna we're gonna bypass the Sally's a little bit because they're more exciting stuff ahead of us I promise you guys that this is crazy they have paging doctor the Peking duck and it's served like this yes you already with the chef he was hit over on preparation to cook for you and after that just speak up to your table and enjoy you brought to my table this looks like something I will get at a four or five-star restaurant look this there's no way this looks like something I get from a buffet like zero never seen it before you haven't seen the most exciting part yet there's a part in this buffet that I'm so excited about let's keep going let's go inside you have hot pot at a buffet yeah the top part here is over there I mean I've been to all you eat you hop up her face and I been to all-you-can-eat buffets I never seen them together and this is just incredible quality of ingredients you know this is a marriage made in buffet hotpot heaven this is a true station for you this choco drew mystery all the seafood here and the lobster we have more than night the recipe to cook and we serve the lobster at the table i order from the table you guys cook it the way I want and bring the lobster to my table just see thank you so much my friend I'm gonna I'm gonna get my eat on so I'm gonna get started I formulated a plan I'm thinking the first thing I need to do is order some lobsters and hi so what kind of lobsters do you have again grow with cheese that's a Chinese style well I won't go with cheese and then with chilli so that's like Singapore chilli crab almost so how long would that be five minutes I got five minutes to go get my other stuff I can do this thank you so much let's go mussels this spring roll looks like it has Chinese sausage inside I love China inside and I definitely need one with shrimp inside and steam roll for sure okay I think that's all I can fit in this plate let's put this back and get into play Oh my lobsters here wow what great timing huh got my lobster got my plate oh that's barbecue real well let's just dig in cuz lobster waits for no man when you see hot lobster in front of ya you gotta pay us some attention immediately that tastes almost exactly like the chili crap I had in Singapore at chef war well it's a lobster it's sweet a little eggy not very spicy at all Oh ma'am my lobster is so fresh which is like the slops you just swim to my plate and I just want to make sure I get that meat all over that delicious chili eggy sauce this is insane - it makes sense right it tastes good on crab why not officer and I don't even know how to even begin with it I feel like I'm gonna first date right now I'm just so overwhelmed I'm intimidated by this buffet by how many things I want to try on this buffet let's just crack open a claw let's burn it now right now by the way you know what I was kind of wondering like what kind of sauce I should dip this in and yeah is what tastes good with some sauce maybe like a little spicy mayo or something but as is this is already delicious and on this home it just has too sweet briny flavor excuse me what what do you dip this in usually oh thank you thank you it's so nice here I never seen a buffet where the crab is literally alive right before they cook it is a live one of effect this is as fresh as you can ever get thank you so much so you put this over some chili some lime in some salt and pepper dip it in the sauce oh wow that's perfect for crab its citrusy peppery spicy and it doesn't take away from the sweetness of the crab meat itself oh thank you sure what she's lobsters are here I've talked about she's lobsters before because always used to have them at Chinese banquets and I never see them cooked really anywhere else before especially not at about face cuz usually you go to a buffet even if there is lobster it's usually steamed or boiled and maybe sometimes grilled and I'll tell you guys this is my favorite way to eat lobster I can't believe they'd do that here on an all-you-can-eat buffet I can have as much of this as I want I'm starting out with pork sorry crab let's just you for a second look at this guy's straight out of the oven I gotta pick this up I know it's hot but oh you can taste the smoke definitely taste the cheese mix with that beautifully sweet lobster meat Music you ever seen Lobster do that before she goes so good with lobster that's why I lobster mac and cheese work so well no it's good another one going oh yeah oh yeah oh yeah we don't need anything else there's just real apps for me wrapped all in this gooey cheese once you guys tried this way of preparing Lobster trust me you're gonna absolutely love it Music so perfect this is literally the third Lobster I'm finishing right now I'm just gonna tip it a little bit in the sauce for my crab because then it's gonna a little too cheesy for me haha but how much I love romantic comedies I didn't think that was possible but that citrus and chilli on the lobster means that I could probably eat like double the amount of lobster than usual okay I'm gonna hit pause on the seat but just because this is all sitting here I want to try this out first this little cocktail shrimp with a little lime and it looks like sriracha mayo in some dill oh one dwarf mmm spicy mayo I feel like it has a little ketchup in here yeah and there's a little Chandi yes it's a cute little cheese sandwich shaped like a little football there's some some sweet onions we're jamming here we're delicious you know I'd make it better add a little lobster me to here somebody loves lobster sandwich now it's shoes on cheese on lobster you know that's gonna be good I'm behind this baby for what looks like maybe some lettuce a little toaster hmm everything I had so far it's been superb superb I can't wait for this I think that's port near here shrimp beef noodles everything is so fresh all the ingredients still ridiculously fresh and well prepared all right I'm gonna wrap this up then we gonna go for round two at this moment this is the most valuable real estate you need but this this speaking duck dish that needs to get in here right now this is officers about the sauce fish sauce can never be wasted never I don't even care but the breads gonna fill up my stomach I don't it's that good I really hope that if you guys come to this buffet that they have this particular dish this might be one of the best things I've had out any buffet at any time anywhere I would pay money for this at a restaurant like no questions asked I don't know what this is but I mean it's here I'm gonna dip it a little bit again excuse me I'll be right back yeah I had to right away get another plate of this thing you do with some of the fruits this time I just can't get over how ridiculous this dish is unbelievably good I think also that there's bits of peppercorn here to get some of that nice numbing flavor there's just a greater stamp all right plate number four we're going after the main dishes here I can order a bit in these noodle soup okay so here this kinda like a like a Mongolian style barbecue supper with much better ingredients my chance is thank you this is a noodle soup gonna add some scallions a little bit of gel Thai chili pepper corn there's a tiny bit lime and you said a little bit of sriracha like tiny bit and then my stir-fried noodles gonna be done in about five minutes thank you here we go oh I can't wait for this to customize noodles one soup one stir-frying the soups got a couple pieces of corn here oh the beautiful wide rice noodles I have fun before this tastes a lot like the crab noodle soup I had on the middle port and I love how citrusy the Super Soaker ah it takes borderline like a Tom Yum soup and no wonder they call this Vietnamese rule golf these noodles are the same size as udon noodles but of course this is made with rice Music for production I know I'm eating a lot of dishes that fill up a lot of room in my stomach but I got no regrets next up this is my own creation I didn't put a lot of things in here there's some mushrooms some onions and then just beef and a little it looks like egg noodles these noodles are assuring my expectations were really low because I'm thinking because it just looks like boring old egg noodles Wow double Wow first of all you don't cook perfectly chewy perfect degree of doneness in the sauce it seems like some sort of salty sauce worth actually no one piece sort of like that Vietnamese chili sauce I had from before but whatever this is it is highly addictive highly objective I never advocate going from you know that a buffet I certainly don't advocate going for a second helping of noodles out of up bay but I'm gonna down this now I'm going for a second ball wow those noodles now I need to go get this I think when you do this you put it onto your tray it's a massive wants could I get a shabu yeah that'd be great and then do I get this grilled somewhere oh yeah thank you oh come back and get both you got it see you soon and while we wait let's see if there's something I missed pork neck would muster was not here before Oh comforting look at this look at that doesn't that just look pretty pork neck with mustard and this also wasn't here stir-fried seafood a little bit of fried rice this should tide me over until my hot pots ready pork right but it tastes like those pigs that fight against those really angry birds because this is top hey sometime here so with the hotpot what you do is you put whatever you want on your place so I got some beef some random veggies I think one of those is mine yeah thank you today you can get some more sauce here so what they basically did was it just took the ingredients and they boiled it and you just dip it in the sauce first of all your goodies massive prawns Chuck on a hill Oh bet oh yeah I love it when they use wooden charcoal because the smoky flavor is so enhanced and I have some fish sauce and chili oh my gosh some candy actually human just without sauce I got an octopus I'm not sure why - Kendra hmm that's really good whoa that might be burning the shrimp in the shabu-shabu not really what I expected I thought you feel I got like a pot best that's kind expect a little too much here okay this is not a shabu shabu plays hold of me me just cut a little thick and they give you some sauce to go with it Music it's not half bad because the meat is sliced kinda thick it is a little tougher than I like but the quality of meat is good the sauce is nice I mean for a buffet I'll tell you what I've had worse than actual hot pot restaurants all right here guys I gotta see what time it is yep this there's our time I don't know what Fuji cake is all I know is I want something this looks good Oh cappuccino drink looking thing oh yeah I need this this might be the last one they had dessert round always bittersweet oh hopefully a more sweet than bitter this is something I'm happy for green bean soup is something that Chinese love and its really awesome a drink this was hot outside this is a dessert drink we pushed order in here but we never add seafood and I had this bizarre at another restaurant here of Vietnam it tastes pretty good Music this one does as well it's slightly funky bizarre the seaweed flavor is more pronounced here but stuff I love love mumbling subsides mum peanut green bean we call a noodle or Indian Chinese but it's really mombi all right pleasant as day this is ridiculously good it tastes a little bit like Chinese yogurt I'm a much swear a much prettier Music it's so good alright let's get to this cheers to a great buffet guys every single one of these beautifully designed plates that came out of a babe has been spectacular and this is no exception this ha player I think is raspberry jam the cake here in the middle it's firm but it breaks down really easily and when it goes into your mouth and my smack in the middle it's a layer of fruity I think maybe strawberry mousse the whole thing if tarp as sweet this buttery is a great way to wrap up this meal fantastic way to wrap up this meal well if you can't tell I kind of like this buffet and add up all the buffets I've ever been to this one probably had the freshest seafood and this is the only place I've ever seen that and especially the size place of food for you and those dishes not only look amazing they take - even better and I'm pretty sure when I say this that this is the best super buffet I've been to so far in my life and guys there's another reason this place is awesome just walk it around it if you ask me how much this buffet cost I will usually say 80 90 and maybe even a hundred dollars but this place 53 US dollars so yes I highly highly highly highly recommend this place so if you're ever in Saigon where you're ever in Vietnam but you know what if you're in the Southeast Asia region you need to come and eat at this place also I'll just think of this morning check this out I think I've determined that Saigon is one of the best cities in the world to go on a vacation here's watch plane ticket aside if you can find a time when the plane ticket it's not that much hotels Arabi and he's like nice ones in this city goes for like twenty thirty forty dollars so you get a cheap flight you come here and you book a nice hotel you book a nice Airbnb that's what I'm gonna run you thirty forty dollars a night then you only really need to budget like five to ten hours a day for food I mean what is that cheap in the city and is ridiculously good and then like one night you splurge a little bit you come here best vacation ever and guys as always the information for this place is listed in my description box thank y'all so much for watching thank you so much for joining me on this awesome seafood buffet adventure and I'm till we get again I'll see you later",
          "siteName": "subtitlelist.com",
          "shortName": "BEST All You Can Eat SEAFOOD Buffet in Saigon VIETNAM",
          "indexInSource": 1,
          "iconSiteId": 52467,
          "showIcon": false,
          "showInternalLink": false,
          "showExternalLink": true,
          "showSiteNameOnWeb": true
        }
      ],
      "description": null,
      "generatedDescription": "Delisa - Fresh Salad Bar HCM offers a variety of fresh and delicious salads at reasonable prices. The staff is friendly and helpful, providing detailed explanations of the menu. While the store is small, it's suitable for a quick lunch or dinner. Customers can customize their own salads and choose from options like Caesar salad with tasty sauce or Avocado Shrimp salad with excellent pesto sauce. Additionally, they offer vegan salad options and healthy drinks to complement the meal.",
      "categories": ["Restaurant"],
      "hasDetails": true,
      "minMinutesSpent": null,
      "maxMinutesSpent": null,
      "address": "158/16 Đ. Nguyễn Công Trứ, Phường Nguyễn Thái Bình, Quận 1, Hồ Chí Minh, Vietnam",
      "rating": 4.6,
      "numRatings": 185,
      "tripadvisorRating": 4.5,
      "tripadvisorNumRatings": 3,
      "website": "https://m.facebook.com/realdelisa.hcm/",
      "internationalPhoneNumber": "+84 969 689 214",
      "priceLevel": null,
      "imageKeys": [
        "bWlFux2g4iHtaHoIlTq3yK82ZHbu6i2j",
        "CPIviCL9wBcN3pzL7WCTaFLs40xtbWAx",
        "22MV9NukJ64Bk6G0JM0etob5xsZnnRkB"
      ],
      "images": [
        {
          "key": "bWlFux2g4iHtaHoIlTq3yK82ZHbu6i2j",
          "width": 1919,
          "height": 1080
        },
        {
          "key": "CPIviCL9wBcN3pzL7WCTaFLs40xtbWAx",
          "width": 810,
          "height": 1080
        },
        {
          "key": "22MV9NukJ64Bk6G0JM0etob5xsZnnRkB",
          "width": 810,
          "height": 1080
        }
      ],
      "reviews": [
        {
          "reviewId": "ChdDSUhNMG9nS0VJQ0FnSURuOExUZGx3RRAB",
          "time": "2024-10-02T10:40:16.000Z",
          "reviewerName": "Kesh Kris",
          "rating": 5,
          "rank": 1,
          "reviewText": "I recently visited Delisa Salad Bar, and I must say, I was really impressed! The salads are incredibly fresh and full of flavor. I tried the one with broccoli, apples, raisins, and chicken, and the combination was delicious. The vegetables were crisp, and the fruits added a perfect balance of sweetness.\nThe portion size was generous. If you’re looking for a healthy, tasty meal, Delisa is definitely a must-try! Highly recommended for anyone craving fresh and nutritious food in a cozy setting."
        },
        {
          "reviewId": "ChZDSUhNMG9nS0VJQ0FnTUNnazRHWkR3EAE",
          "time": "2025-02-20T13:14:14.000Z",
          "reviewerName": "Martin Hervy",
          "rating": 5,
          "rank": 2,
          "reviewText": "Caesar salad was delicious. Price was right. Also had a yogurt based fruit smoothie. Very good too. I'll be back"
        },
        {
          "reviewId": "ChZDSUhNMG9nS0VJQ0FnSUREdXJqVUVnEAE",
          "time": "2024-04-08T10:19:04.000Z",
          "reviewerName": "John & Heather Brown Bacon",
          "rating": 5,
          "rank": 3,
          "reviewText": "We ordered delivery from Delisa and it was delicious!\n\nWe ordered avocado toast, Greek salad, and Caesar salad. The delivery came in the cutest eco-friendly packaging. The salads were good portion size. The dressing ( we always order extra) was very good.\n\nWe posted pictures that show the food.\n\nWe will order delivery again soon!\n\nFor more adventures follow us on YouTube @eyecool"
        },
        {
          "reviewId": "ChZDSUhNMG9nS0VJQ0FnSUNydjlxUlB3EAE",
          "time": "2024-07-12T13:43:08.000Z",
          "reviewerName": "Family Dang",
          "rating": 5,
          "rank": 4,
          "reviewText": "There are many types of salad that you hardly can find anywhere else. Salad is fresh. The staff are very friendly. The atmosphere is quite small since they seem to sell more on Grab, not dine in. So the place is actually cozy for me. It is in an old alley mixing the old and new Saigonese culture, very interesting."
        },
        {
          "reviewId": "ChdDSUhNMG9nS0VJQ0FnSUNlZzZlYWxRRRAB",
          "time": "2022-09-22T07:48:19.000Z",
          "reviewerName": "Larissa",
          "rating": 5,
          "rank": 6,
          "reviewText": "First time come, and I’m quite impressed about the service quality here. For me, the servings are quite generous, and beautifully presented.\nOne thing need to improve, small space and slightly noisy in the rush hour (noon).\nHowever, the friendly staffs will help you immediately when you need or ask something.\nOverall, lovely place, will come back and reccomend for my friends."
        },
        {
          "reviewId": "ChdDSUhNMG9nS0VJQ0FnSUR1bTlTT21nRRAB",
          "time": "2022-08-30T17:18:47.000Z",
          "reviewerName": "Nguyen Trang",
          "rating": 5,
          "rank": 7,
          "reviewText": "Salad is so good and fresh with very decent price. I tried many different salad shops and Delisa can balance the quality and price.  The staff are very friendly, they explained quite carefully the menu though I asked a lot (Sorry for too much question). The store is quite small and too simple for chilling but good enough to take a quick lunch or dinner.My favourite is Caesar salad, the sauce is so nice. You can also choose your own ingredients by order Myown salad which I highly appreciate.\nI also recommend the Avocado Shrimp salad since their pesto sauce is best in the town. They charge more and give you one full sauce box if you ask for more sauce. So the sauce is not free but it's fair."
        },
        {
          "reviewId": "ChZDSUhNMG9nS0VJQ0FnSUNldXVTbEF3EAE",
          "time": "2022-09-12T03:03:34.000Z",
          "reviewerName": "Easify Shop",
          "rating": 5,
          "rank": 8,
          "reviewText": "I took away the avocado shrimp salad here for 119k. Love the pesto sauce. Salad and shrimp is fresh. The price is reasonable. When I was there, I saw lots of shippers and I am the only guest. I guess they sell more via delivery app and don't invest too much in dine in. So their space is quite small and simple but looks cozy, comfortable & clean enough. Staff is very friendly."
        },
        {
          "reviewId": "ChZDSUhNMG9nS0VJQ0FnSUMxbm96akt3EAE",
          "time": "2023-12-30T10:40:56.000Z",
          "reviewerName": "Alfred Ong",
          "rating": 5,
          "rank": 8,
          "reviewText": "A little hidden from the main road. Need to walk into a narrower alley and can see many more shops around. Interesting setup.\n\nShop has limited seats.\n\nThe salad is definitely tasty with sizeable portion. Drinks are fine.\nThere's no need to over eat ...\n\nPricing is reasonable, actually good value for money."
        }
      ],
      "geo": null,
      "permanentlyClosed": false,
      "businessStatus": "OPERATIONAL",
      "ratingDistribution": {
        "Google": {
          "1": 5,
          "2": 8,
          "3": 5,
          "4": 18,
          "5": 150
        }
      },
      "utcOffset": 420,
      "openingPeriods": [
        {
          "open": {
            "day": 0,
            "time": "0900"
          },
          "close": {
            "day": 0,
            "time": "2100"
          }
        },
        {
          "open": {
            "day": 1,
            "time": "0900"
          },
          "close": {
            "day": 1,
            "time": "2100"
          }
        },
        {
          "open": {
            "day": 2,
            "time": "0900"
          },
          "close": {
            "day": 2,
            "time": "2100"
          }
        },
        {
          "open": {
            "day": 3,
            "time": "0900"
          },
          "close": {
            "day": 3,
            "time": "2100"
          }
        },
        {
          "open": {
            "day": 4,
            "time": "0900"
          },
          "close": {
            "day": 4,
            "time": "2100"
          }
        },
        {
          "open": {
            "day": 5,
            "time": "0900"
          },
          "close": {
            "day": 5,
            "time": "2100"
          }
        },
        {
          "open": {
            "day": 6,
            "time": "0900"
          },
          "close": {
            "day": 6,
            "time": "2100"
          }
        }
      ]
    },
    {
      "id": 4351047,
      "name": "Red Chilli Seafood Buffet",
      "placePageType": "visible",
      "placeId": "ChIJLU8nGosvdTERKcfeNbaEFnY",
      "sources": [
        {
          "id": "178146",
          "type": "webPlacesList",
          "url": "https://local-insider.com/10-ideal-spots-for-a-romantic-dinner-in-ho-chi-minh-city/",
          "sourceSite": "Web",
          "snippet": "Red Chili Seafood Seafood Buffet Restaurant is the perfect place to have a romantic dinner under the shimmering light. If your special one loves to enjoy seafood parties in a space shimmering with light like a fairy castle, Red Chili Seafood Buffet Restaurant is the perfect choice for a romantic dinner in Ho Chi Minh city. Using elegant and delicate white tones as the main color, the entire space of the restaurant has a luxurious aftertaste of a magnificent castle.",
          "siteName": "local-insider.com",
          "shortName": "10 ideal spots for a romantic dinner in Ho Chi Minh city",
          "indexInSource": 2,
          "iconSiteId": 21502,
          "showIcon": false,
          "showInternalLink": false,
          "showExternalLink": true,
          "showSiteNameOnWeb": true
        }
      ],
      "description": null,
      "generatedDescription": "If you are looking for a stunning restaurant with elegant white tones and delicious seafood dishes, Red Chilli Seafood Buffet should definitely be on your list of places to visit in Ho Chi Minh city. With sumptuous food and an enchanting setting, this restaurant is sure to make your romantic dinner unforgettable.",
      "categories": ["Restaurant"],
      "hasDetails": true,
      "minMinutesSpent": null,
      "maxMinutesSpent": null,
      "address": "2 Phan Văn Chương, Tân Phú, Quận 7, Hồ Chí Minh, Vietnam",
      "rating": 3,
      "numRatings": 2,
      "tripadvisorRating": null,
      "tripadvisorNumRatings": null,
      "website": null,
      "internationalPhoneNumber": null,
      "priceLevel": null,
      "imageKeys": [],
      "images": [],
      "reviews": [
        {
          "reviewId": "ChZDSUhNMG9nS0VJQ0FnSUNOOWRDOFRREAE",
          "time": "2024-01-16T15:14:38.000Z",
          "reviewerName": "Nha Minh",
          "rating": 1,
          "rank": 1,
          "reviewText": "(Translated by Google) Bad!!\n\n(Original)\nTệ!!"
        }
      ],
      "geo": null,
      "permanentlyClosed": true,
      "businessStatus": "CLOSED_PERMANENTLY",
      "ratingDistribution": {
        "Google": {
          "1": 1,
          "2": 0,
          "3": 0,
          "4": 0,
          "5": 1
        }
      },
      "utcOffset": 420,
      "openingPeriods": []
    },
    {
      "id": 4376065,
      "name": "Lobster Bay - Nguyễn Tri Phương",
      "placePageType": "visible",
      "placeId": "ChIJ1VoJFsAvdTERZGFJ_PhTqVA",
      "sources": [
        {
          "id": "527994",
          "type": "webPlacesList",
          "url": "https://www.subtitlelist.com/en/BEST-All-You-Can-Eat-SEAFOOD-Buffet-in-Saigon-VIETNAM-157647",
          "sourceSite": "Web",
          "snippet": "I'm gonna be the first in line here okay let's go stay here in anticipation Music guys I've been to a lot about face in my day you know I have and those are my favorite and just I'm a little speechless because I'm feeling kind of overwhelmed I gotta just show you because I took a quick walk around this buffet I'm getting chills you can't see right now but I got goose bumps going on my friend Viet here hey Viet how you doing so this is all seafood here appetizer we always stick the fest always Stefan Thanks fresh oyster from French yes cannabase it's finger food finger food matches appetizing Catherine Mercer from New Zealand he with tartar sauce so much variety it's not just simply like gonna get us to get some salad and thrown into a place smoked salmon from Scotland this is like a combination of just different foods around from around the world what is that steamed cake and she's rolling it in she like a fresh spring roll here salad bar cheese kind of we're gonna we're gonna bypass the Sally's a little bit because they're more exciting stuff ahead of us I promise you guys that this is crazy they have paging doctor the Peking duck and it's served like this yes you already with the chef he was hit over on preparation to cook for you and after that just speak up to your table and enjoy you brought to my table this looks like something I will get at a four or five-star restaurant look this there's no way this looks like something I get from a buffet like zero never seen it before you haven't seen the most exciting part yet there's a part in this buffet that I'm so excited about let's keep going let's go inside you have hot pot at a buffet yeah the top part here is over there I mean I've been to all you eat you hop up her face and I been to all-you-can-eat buffets I never seen them together and this is just incredible quality of ingredients you know this is a marriage made in buffet hotpot heaven this is a true station for you this choco drew mystery all the seafood here and the lobster we have more than night the recipe to cook and we serve the lobster at the table i order from the table you guys cook it the way I want and bring the lobster to my table just see thank you so much my friend I'm gonna I'm gonna get my eat on so I'm gonna get started I formulated a plan I'm thinking the first thing I need to do is order some lobsters and hi so what kind of lobsters do you have again grow with cheese that's a Chinese style well I won't go with cheese and then with chilli so that's like Singapore chilli crab almost so how long would that be five minutes I got five minutes to go get my other stuff I can do this thank you so much let's go mussels this spring roll looks like it has Chinese sausage inside I love China inside and I definitely need one with shrimp inside and steam roll for sure okay I think that's all I can fit in this plate let's put this back and get into play Oh my lobsters here wow what great timing huh got my lobster got my plate oh that's barbecue real well let's just dig in cuz lobster waits for no man when you see hot lobster in front of ya you gotta pay us some attention immediately that tastes almost exactly like the chili crap I had in Singapore at chef war well it's a lobster it's sweet a little eggy not very spicy at all Oh ma'am my lobster is so fresh which is like the slops you just swim to my plate and I just want to make sure I get that meat all over that delicious chili eggy sauce this is insane - it makes sense right it tastes good on crab why not officer and I don't even know how to even begin with it I feel like I'm gonna first date right now I'm just so overwhelmed I'm intimidated by this buffet by how many things I want to try on this buffet let's just crack open a claw let's burn it now right now by the way you know what I was kind of wondering like what kind of sauce I should dip this in and yeah is what tastes good with some sauce maybe like a little spicy mayo or something but as is this is already delicious and on this home it just has too sweet briny flavor excuse me what what do you dip this in usually oh thank you thank you it's so nice here I never seen a buffet where the crab is literally alive right before they cook it is a live one of effect this is as fresh as you can ever get thank you so much so you put this over some chili some lime in some salt and pepper dip it in the sauce oh wow that's perfect for crab its citrusy peppery spicy and it doesn't take away from the sweetness of the crab meat itself oh thank you sure what she's lobsters are here I've talked about she's lobsters before because always used to have them at Chinese banquets and I never see them cooked really anywhere else before especially not at about face cuz usually you go to a buffet even if there is lobster it's usually steamed or boiled and maybe sometimes grilled and I'll tell you guys this is my favorite way to eat lobster I can't believe they'd do that here on an all-you-can-eat buffet I can have as much of this as I want I'm starting out with pork sorry crab let's just you for a second look at this guy's straight out of the oven I gotta pick this up I know it's hot but oh you can taste the smoke definitely taste the cheese mix with that beautifully sweet lobster meat Music you ever seen Lobster do that before she goes so good with lobster that's why I lobster mac and cheese work so well no it's good another one going oh yeah oh yeah oh yeah we don't need anything else there's just real apps for me wrapped all in this gooey cheese once you guys tried this way of preparing Lobster trust me you're gonna absolutely love it Music so perfect this is literally the third Lobster I'm finishing right now I'm just gonna tip it a little bit in the sauce for my crab because then it's gonna a little too cheesy for me haha but how much I love romantic comedies I didn't think that was possible but that citrus and chilli on the lobster means that I could probably eat like double the amount of lobster than usual okay I'm gonna hit pause on the seat but just because this is all sitting here I want to try this out first this little cocktail shrimp with a little lime and it looks like sriracha mayo in some dill oh one dwarf mmm spicy mayo I feel like it has a little ketchup in here yeah and there's a little Chandi yes it's a cute little cheese sandwich shaped like a little football there's some some sweet onions we're jamming here we're delicious you know I'd make it better add a little lobster me to here somebody loves lobster sandwich now it's shoes on cheese on lobster you know that's gonna be good I'm behind this baby for what looks like maybe some lettuce a little toaster hmm everything I had so far it's been superb superb I can't wait for this I think that's port near here shrimp beef noodles everything is so fresh all the ingredients still ridiculously fresh and well prepared all right I'm gonna wrap this up then we gonna go for round two at this moment this is the most valuable real estate you need but this this speaking duck dish that needs to get in here right now this is officers about the sauce fish sauce can never be wasted never I don't even care but the breads gonna fill up my stomach I don't it's that good I really hope that if you guys come to this buffet that they have this particular dish this might be one of the best things I've had out any buffet at any time anywhere I would pay money for this at a restaurant like no questions asked I don't know what this is but I mean it's here I'm gonna dip it a little bit again excuse me I'll be right back yeah I had to right away get another plate of this thing you do with some of the fruits this time I just can't get over how ridiculous this dish is unbelievably good I think also that there's bits of peppercorn here to get some of that nice numbing flavor there's just a greater stamp all right plate number four we're going after the main dishes here I can order a bit in these noodle soup okay so here this kinda like a like a Mongolian style barbecue supper with much better ingredients my chance is thank you this is a noodle soup gonna add some scallions a little bit of gel Thai chili pepper corn there's a tiny bit lime and you said a little bit of sriracha like tiny bit and then my stir-fried noodles gonna be done in about five minutes thank you here we go oh I can't wait for this to customize noodles one soup one stir-frying the soups got a couple pieces of corn here oh the beautiful wide rice noodles I have fun before this tastes a lot like the crab noodle soup I had on the middle port and I love how citrusy the Super Soaker ah it takes borderline like a Tom Yum soup and no wonder they call this Vietnamese rule golf these noodles are the same size as udon noodles but of course this is made with rice Music for production I know I'm eating a lot of dishes that fill up a lot of room in my stomach but I got no regrets next up this is my own creation I didn't put a lot of things in here there's some mushrooms some onions and then just beef and a little it looks like egg noodles these noodles are assuring my expectations were really low because I'm thinking because it just looks like boring old egg noodles Wow double Wow first of all you don't cook perfectly chewy perfect degree of doneness in the sauce it seems like some sort of salty sauce worth actually no one piece sort of like that Vietnamese chili sauce I had from before but whatever this is it is highly addictive highly objective I never advocate going from you know that a buffet I certainly don't advocate going for a second helping of noodles out of up bay but I'm gonna down this now I'm going for a second ball wow those noodles now I need to go get this I think when you do this you put it onto your tray it's a massive wants could I get a shabu yeah that'd be great and then do I get this grilled somewhere oh yeah thank you oh come back and get both you got it see you soon and while we wait let's see if there's something I missed pork neck would muster was not here before Oh comforting look at this look at that doesn't that just look pretty pork neck with mustard and this also wasn't here stir-fried seafood a little bit of fried rice this should tide me over until my hot pots ready pork right but it tastes like those pigs that fight against those really angry birds because this is top hey sometime here so with the hotpot what you do is you put whatever you want on your place so I got some beef some random veggies I think one of those is mine yeah thank you today you can get some more sauce here so what they basically did was it just took the ingredients and they boiled it and you just dip it in the sauce first of all your goodies massive prawns Chuck on a hill Oh bet oh yeah I love it when they use wooden charcoal because the smoky flavor is so enhanced and I have some fish sauce and chili oh my gosh some candy actually human just without sauce I got an octopus I'm not sure why - Kendra hmm that's really good whoa that might be burning the shrimp in the shabu-shabu not really what I expected I thought you feel I got like a pot best that's kind expect a little too much here okay this is not a shabu shabu plays hold of me me just cut a little thick and they give you some sauce to go with it Music it's not half bad because the meat is sliced kinda thick it is a little tougher than I like but the quality of meat is good the sauce is nice I mean for a buffet I'll tell you what I've had worse than actual hot pot restaurants all right here guys I gotta see what time it is yep this there's our time I don't know what Fuji cake is all I know is I want something this looks good Oh cappuccino drink looking thing oh yeah I need this this might be the last one they had dessert round always bittersweet oh hopefully a more sweet than bitter this is something I'm happy for green bean soup is something that Chinese love and its really awesome a drink this was hot outside this is a dessert drink we pushed order in here but we never add seafood and I had this bizarre at another restaurant here of Vietnam it tastes pretty good Music this one does as well it's slightly funky bizarre the seaweed flavor is more pronounced here but stuff I love love mumbling subsides mum peanut green bean we call a noodle or Indian Chinese but it's really mombi all right pleasant as day this is ridiculously good it tastes a little bit like Chinese yogurt I'm a much swear a much prettier Music it's so good alright let's get to this cheers to a great buffet guys every single one of these beautifully designed plates that came out of a babe has been spectacular and this is no exception this ha player I think is raspberry jam the cake here in the middle it's firm but it breaks down really easily and when it goes into your mouth and my smack in the middle it's a layer of fruity I think maybe strawberry mousse the whole thing if tarp as sweet this buttery is a great way to wrap up this meal fantastic way to wrap up this meal well if you can't tell I kind of like this buffet and add up all the buffets I've ever been to this one probably had the freshest seafood and this is the only place I've ever seen that and especially the size place of food for you and those dishes not only look amazing they take - even better and I'm pretty sure when I say this that this is the best super buffet I've been to so far in my life and guys there's another reason this place is awesome just walk it around it if you ask me how much this buffet cost I will usually say 80 90 and maybe even a hundred dollars but this place 53 US dollars so yes I highly highly highly highly recommend this place so if you're ever in Saigon where you're ever in Vietnam but you know what if you're in the Southeast Asia region you need to come and eat at this place also I'll just think of this morning check this out I think I've determined that Saigon is one of the best cities in the world to go on a vacation here's watch plane ticket aside if you can find a time when the plane ticket it's not that much hotels Arabi and he's like nice ones in this city goes for like twenty thirty forty dollars so you get a cheap flight you come here and you book a nice hotel you book a nice Airbnb that's what I'm gonna run you thirty forty dollars a night then you only really need to budget like five to ten hours a day for food I mean what is that cheap in the city and is ridiculously good and then like one night you splurge a little bit you come here best vacation ever and guys as always the information for this place is listed in my description box thank y'all so much for watching thank you so much for joining me on this awesome seafood buffet adventure and I'm till we get again I'll see you later",
          "siteName": "subtitlelist.com",
          "shortName": "BEST All You Can Eat SEAFOOD Buffet in Saigon VIETNAM",
          "indexInSource": 2,
          "iconSiteId": 52467,
          "showIcon": false,
          "showInternalLink": false,
          "showExternalLink": true,
          "showSiteNameOnWeb": true
        }
      ],
      "description": null,
      "generatedDescription": "The renowned seafood restaurant Lobster Bay is located in the heart of Saigon. The Cajun-spiced dishes here are some of the best in town, and the fresh seafood is simply delicious. The atmosphere is casually elegant, and the prices are very reasonable.",
      "categories": ["Restaurant"],
      "hasDetails": true,
      "minMinutesSpent": null,
      "maxMinutesSpent": null,
      "address": "484 Đ. Nguyễn Tri Phương, Phường 9, Quận 10, Hồ Chí Minh, Vietnam",
      "rating": 4.5,
      "numRatings": 201,
      "tripadvisorRating": null,
      "tripadvisorNumRatings": null,
      "website": "https://lobsterbay.vn/",
      "internationalPhoneNumber": "+84 1900 066690",
      "priceLevel": null,
      "imageKeys": [
        "SWf3KBLcTkxOiuAxtcv7Tm47rD70tPvG",
        "Z1QaSpMR45PmiedQCMGQayJIsv82jxwh",
        "x6kzMD50c2fnj4YJFGaXMDknn2FEgNiz"
      ],
      "images": [
        {
          "key": "SWf3KBLcTkxOiuAxtcv7Tm47rD70tPvG",
          "width": 1920,
          "height": 1080
        },
        {
          "key": "Z1QaSpMR45PmiedQCMGQayJIsv82jxwh",
          "width": 1440,
          "height": 1080
        },
        {
          "key": "x6kzMD50c2fnj4YJFGaXMDknn2FEgNiz",
          "width": 1920,
          "height": 1080
        }
      ],
      "reviews": [
        {
          "reviewId": "ChdDSUhNMG9nS0VJQ0FnSURoN0tPY3pRRRAB",
          "time": "2023-03-03T15:42:04.000Z",
          "reviewerName": "Martin Grist",
          "rating": 5,
          "rank": 1,
          "reviewText": "Absolutely delicious crab soup. Well worth seeking this place out."
        },
        {
          "reviewId": "ChdDSUhNMG9nS0VJQ0FnSUNwc2RYdzVBRRAB",
          "time": "2023-08-05T17:52:10.000Z",
          "reviewerName": "Apple Gold",
          "rating": 5,
          "rank": 2,
          "reviewText": "Good food , nice Staff and clean place"
        },
        {
          "reviewId": "ChZDSUhNMG9nS0VJQ0FnSUNlbmZpOFJREAE",
          "time": "2022-09-21T07:58:08.000Z",
          "reviewerName": "crashbar77",
          "rating": 1,
          "rank": 3,
          "reviewText": "Ate here 3 years ago it was wonderful.  Ate here again today and was the worst $75 dollar I have ever spent at a resturant in 45 years.  Overcooked and un-edible.  Do not spend a penny here."
        },
        {
          "reviewId": "ChdDSUhNMG9nS0VJQ0FnSURLdHFmRDhBRRAB",
          "time": "2021-05-11T05:47:23.000Z",
          "reviewerName": "Lan Nguyen",
          "rating": 5,
          "rank": 4,
          "reviewText": "The cajun sauce is similar to the style in Houston, making this one of the best places to eat cajun food.  It is hard to find fresh crawfish anywhere in Saigon so dont expect fresh crawfish.  Overall highly recommended if you are craving cajun seafood.  The sauce alone makes any seafood you choose tasty."
        },
        {
          "reviewId": "ChdDSUhNMG9nS0VJQ0FnSUQyOXJMdXN3RRAB",
          "time": "2022-05-14T15:42:58.000Z",
          "reviewerName": "Rex Steiner",
          "rating": 3,
          "rank": 5,
          "reviewText": "It's a bit expensive...average flavor. Nothing particularly special about the food or the venue that justifies the higher than average prices. I don't really recommend a visit."
        },
        {
          "reviewId": "ChdDSUhNMG9nS0VJQ0FnSURTNmVQQzJBRRAB",
          "time": "2020-12-31T13:01:36.000Z",
          "reviewerName": "Ally",
          "rating": 4,
          "rank": 6,
          "reviewText": "Good service, good food though litchi tea, I only tasted the tea, there was no smell or taste of litchi. But all in all it is a good place would go again another time"
        },
        {
          "reviewId": "ChZDSUhNMG9nS0VJQ0FnSURPaDczNkhnEAE",
          "time": "2022-07-15T14:14:59.000Z",
          "reviewerName": "Jim Totaro",
          "rating": 5,
          "rank": 7,
          "reviewText": "A bit pricey but very delicious"
        },
        {
          "reviewId": "ChdDSUhNMG9nS0VJQ0FnSUQycnBmOWtnRRAB",
          "time": "2022-05-15T10:56:22.000Z",
          "reviewerName": "Rayking",
          "rating": 5,
          "rank": 8,
          "reviewText": "Good restaurant and service"
        }
      ],
      "geo": null,
      "permanentlyClosed": true,
      "businessStatus": "CLOSED_PERMANENTLY",
      "ratingDistribution": {
        "Google": {
          "1": 7,
          "2": 4,
          "3": 14,
          "4": 39,
          "5": 137
        }
      },
      "utcOffset": 420,
      "openingPeriods": []
    },
    {
      "id": 4641261,
      "name": "Hotpot Story Pico Plaza Cộng Hòa",
      "placePageType": "visible",
      "placeId": "ChIJq9ma2zcpdTERBDciHGUtSew",
      "sources": [
        {
          "id": "527994",
          "type": "webPlacesList",
          "url": "https://www.subtitlelist.com/en/BEST-All-You-Can-Eat-SEAFOOD-Buffet-in-Saigon-VIETNAM-157647",
          "sourceSite": "Web",
          "snippet": "I'm gonna be the first in line here okay let's go stay here in anticipation Music guys I've been to a lot about face in my day you know I have and those are my favorite and just I'm a little speechless because I'm feeling kind of overwhelmed I gotta just show you because I took a quick walk around this buffet I'm getting chills you can't see right now but I got goose bumps going on my friend Viet here hey Viet how you doing so this is all seafood here appetizer we always stick the fest always Stefan Thanks fresh oyster from French yes cannabase it's finger food finger food matches appetizing Catherine Mercer from New Zealand he with tartar sauce so much variety it's not just simply like gonna get us to get some salad and thrown into a place smoked salmon from Scotland this is like a combination of just different foods around from around the world what is that steamed cake and she's rolling it in she like a fresh spring roll here salad bar cheese kind of we're gonna we're gonna bypass the Sally's a little bit because they're more exciting stuff ahead of us I promise you guys that this is crazy they have paging doctor the Peking duck and it's served like this yes you already with the chef he was hit over on preparation to cook for you and after that just speak up to your table and enjoy you brought to my table this looks like something I will get at a four or five-star restaurant look this there's no way this looks like something I get from a buffet like zero never seen it before you haven't seen the most exciting part yet there's a part in this buffet that I'm so excited about let's keep going let's go inside you have hot pot at a buffet yeah the top part here is over there I mean I've been to all you eat you hop up her face and I been to all-you-can-eat buffets I never seen them together and this is just incredible quality of ingredients you know this is a marriage made in buffet hotpot heaven this is a true station for you this choco drew mystery all the seafood here and the lobster we have more than night the recipe to cook and we serve the lobster at the table i order from the table you guys cook it the way I want and bring the lobster to my table just see thank you so much my friend I'm gonna I'm gonna get my eat on so I'm gonna get started I formulated a plan I'm thinking the first thing I need to do is order some lobsters and hi so what kind of lobsters do you have again grow with cheese that's a Chinese style well I won't go with cheese and then with chilli so that's like Singapore chilli crab almost so how long would that be five minutes I got five minutes to go get my other stuff I can do this thank you so much let's go mussels this spring roll looks like it has Chinese sausage inside I love China inside and I definitely need one with shrimp inside and steam roll for sure okay I think that's all I can fit in this plate let's put this back and get into play Oh my lobsters here wow what great timing huh got my lobster got my plate oh that's barbecue real well let's just dig in cuz lobster waits for no man when you see hot lobster in front of ya you gotta pay us some attention immediately that tastes almost exactly like the chili crap I had in Singapore at chef war well it's a lobster it's sweet a little eggy not very spicy at all Oh ma'am my lobster is so fresh which is like the slops you just swim to my plate and I just want to make sure I get that meat all over that delicious chili eggy sauce this is insane - it makes sense right it tastes good on crab why not officer and I don't even know how to even begin with it I feel like I'm gonna first date right now I'm just so overwhelmed I'm intimidated by this buffet by how many things I want to try on this buffet let's just crack open a claw let's burn it now right now by the way you know what I was kind of wondering like what kind of sauce I should dip this in and yeah is what tastes good with some sauce maybe like a little spicy mayo or something but as is this is already delicious and on this home it just has too sweet briny flavor excuse me what what do you dip this in usually oh thank you thank you it's so nice here I never seen a buffet where the crab is literally alive right before they cook it is a live one of effect this is as fresh as you can ever get thank you so much so you put this over some chili some lime in some salt and pepper dip it in the sauce oh wow that's perfect for crab its citrusy peppery spicy and it doesn't take away from the sweetness of the crab meat itself oh thank you sure what she's lobsters are here I've talked about she's lobsters before because always used to have them at Chinese banquets and I never see them cooked really anywhere else before especially not at about face cuz usually you go to a buffet even if there is lobster it's usually steamed or boiled and maybe sometimes grilled and I'll tell you guys this is my favorite way to eat lobster I can't believe they'd do that here on an all-you-can-eat buffet I can have as much of this as I want I'm starting out with pork sorry crab let's just you for a second look at this guy's straight out of the oven I gotta pick this up I know it's hot but oh you can taste the smoke definitely taste the cheese mix with that beautifully sweet lobster meat Music you ever seen Lobster do that before she goes so good with lobster that's why I lobster mac and cheese work so well no it's good another one going oh yeah oh yeah oh yeah we don't need anything else there's just real apps for me wrapped all in this gooey cheese once you guys tried this way of preparing Lobster trust me you're gonna absolutely love it Music so perfect this is literally the third Lobster I'm finishing right now I'm just gonna tip it a little bit in the sauce for my crab because then it's gonna a little too cheesy for me haha but how much I love romantic comedies I didn't think that was possible but that citrus and chilli on the lobster means that I could probably eat like double the amount of lobster than usual okay I'm gonna hit pause on the seat but just because this is all sitting here I want to try this out first this little cocktail shrimp with a little lime and it looks like sriracha mayo in some dill oh one dwarf mmm spicy mayo I feel like it has a little ketchup in here yeah and there's a little Chandi yes it's a cute little cheese sandwich shaped like a little football there's some some sweet onions we're jamming here we're delicious you know I'd make it better add a little lobster me to here somebody loves lobster sandwich now it's shoes on cheese on lobster you know that's gonna be good I'm behind this baby for what looks like maybe some lettuce a little toaster hmm everything I had so far it's been superb superb I can't wait for this I think that's port near here shrimp beef noodles everything is so fresh all the ingredients still ridiculously fresh and well prepared all right I'm gonna wrap this up then we gonna go for round two at this moment this is the most valuable real estate you need but this this speaking duck dish that needs to get in here right now this is officers about the sauce fish sauce can never be wasted never I don't even care but the breads gonna fill up my stomach I don't it's that good I really hope that if you guys come to this buffet that they have this particular dish this might be one of the best things I've had out any buffet at any time anywhere I would pay money for this at a restaurant like no questions asked I don't know what this is but I mean it's here I'm gonna dip it a little bit again excuse me I'll be right back yeah I had to right away get another plate of this thing you do with some of the fruits this time I just can't get over how ridiculous this dish is unbelievably good I think also that there's bits of peppercorn here to get some of that nice numbing flavor there's just a greater stamp all right plate number four we're going after the main dishes here I can order a bit in these noodle soup okay so here this kinda like a like a Mongolian style barbecue supper with much better ingredients my chance is thank you this is a noodle soup gonna add some scallions a little bit of gel Thai chili pepper corn there's a tiny bit lime and you said a little bit of sriracha like tiny bit and then my stir-fried noodles gonna be done in about five minutes thank you here we go oh I can't wait for this to customize noodles one soup one stir-frying the soups got a couple pieces of corn here oh the beautiful wide rice noodles I have fun before this tastes a lot like the crab noodle soup I had on the middle port and I love how citrusy the Super Soaker ah it takes borderline like a Tom Yum soup and no wonder they call this Vietnamese rule golf these noodles are the same size as udon noodles but of course this is made with rice Music for production I know I'm eating a lot of dishes that fill up a lot of room in my stomach but I got no regrets next up this is my own creation I didn't put a lot of things in here there's some mushrooms some onions and then just beef and a little it looks like egg noodles these noodles are assuring my expectations were really low because I'm thinking because it just looks like boring old egg noodles Wow double Wow first of all you don't cook perfectly chewy perfect degree of doneness in the sauce it seems like some sort of salty sauce worth actually no one piece sort of like that Vietnamese chili sauce I had from before but whatever this is it is highly addictive highly objective I never advocate going from you know that a buffet I certainly don't advocate going for a second helping of noodles out of up bay but I'm gonna down this now I'm going for a second ball wow those noodles now I need to go get this I think when you do this you put it onto your tray it's a massive wants could I get a shabu yeah that'd be great and then do I get this grilled somewhere oh yeah thank you oh come back and get both you got it see you soon and while we wait let's see if there's something I missed pork neck would muster was not here before Oh comforting look at this look at that doesn't that just look pretty pork neck with mustard and this also wasn't here stir-fried seafood a little bit of fried rice this should tide me over until my hot pots ready pork right but it tastes like those pigs that fight against those really angry birds because this is top hey sometime here so with the hotpot what you do is you put whatever you want on your place so I got some beef some random veggies I think one of those is mine yeah thank you today you can get some more sauce here so what they basically did was it just took the ingredients and they boiled it and you just dip it in the sauce first of all your goodies massive prawns Chuck on a hill Oh bet oh yeah I love it when they use wooden charcoal because the smoky flavor is so enhanced and I have some fish sauce and chili oh my gosh some candy actually human just without sauce I got an octopus I'm not sure why - Kendra hmm that's really good whoa that might be burning the shrimp in the shabu-shabu not really what I expected I thought you feel I got like a pot best that's kind expect a little too much here okay this is not a shabu shabu plays hold of me me just cut a little thick and they give you some sauce to go with it Music it's not half bad because the meat is sliced kinda thick it is a little tougher than I like but the quality of meat is good the sauce is nice I mean for a buffet I'll tell you what I've had worse than actual hot pot restaurants all right here guys I gotta see what time it is yep this there's our time I don't know what Fuji cake is all I know is I want something this looks good Oh cappuccino drink looking thing oh yeah I need this this might be the last one they had dessert round always bittersweet oh hopefully a more sweet than bitter this is something I'm happy for green bean soup is something that Chinese love and its really awesome a drink this was hot outside this is a dessert drink we pushed order in here but we never add seafood and I had this bizarre at another restaurant here of Vietnam it tastes pretty good Music this one does as well it's slightly funky bizarre the seaweed flavor is more pronounced here but stuff I love love mumbling subsides mum peanut green bean we call a noodle or Indian Chinese but it's really mombi all right pleasant as day this is ridiculously good it tastes a little bit like Chinese yogurt I'm a much swear a much prettier Music it's so good alright let's get to this cheers to a great buffet guys every single one of these beautifully designed plates that came out of a babe has been spectacular and this is no exception this ha player I think is raspberry jam the cake here in the middle it's firm but it breaks down really easily and when it goes into your mouth and my smack in the middle it's a layer of fruity I think maybe strawberry mousse the whole thing if tarp as sweet this buttery is a great way to wrap up this meal fantastic way to wrap up this meal well if you can't tell I kind of like this buffet and add up all the buffets I've ever been to this one probably had the freshest seafood and this is the only place I've ever seen that and especially the size place of food for you and those dishes not only look amazing they take - even better and I'm pretty sure when I say this that this is the best super buffet I've been to so far in my life and guys there's another reason this place is awesome just walk it around it if you ask me how much this buffet cost I will usually say 80 90 and maybe even a hundred dollars but this place 53 US dollars so yes I highly highly highly highly recommend this place so if you're ever in Saigon where you're ever in Vietnam but you know what if you're in the Southeast Asia region you need to come and eat at this place also I'll just think of this morning check this out I think I've determined that Saigon is one of the best cities in the world to go on a vacation here's watch plane ticket aside if you can find a time when the plane ticket it's not that much hotels Arabi and he's like nice ones in this city goes for like twenty thirty forty dollars so you get a cheap flight you come here and you book a nice hotel you book a nice Airbnb that's what I'm gonna run you thirty forty dollars a night then you only really need to budget like five to ten hours a day for food I mean what is that cheap in the city and is ridiculously good and then like one night you splurge a little bit you come here best vacation ever and guys as always the information for this place is listed in my description box thank y'all so much for watching thank you so much for joining me on this awesome seafood buffet adventure and I'm till we get again I'll see you later",
          "siteName": "subtitlelist.com",
          "shortName": "BEST All You Can Eat SEAFOOD Buffet in Saigon VIETNAM",
          "indexInSource": 4,
          "iconSiteId": 52467,
          "showIcon": false,
          "showInternalLink": false,
          "showExternalLink": true,
          "showSiteNameOnWeb": true
        }
      ],
      "description": null,
      "generatedDescription": null,
      "categories": ["Hot pot restaurant"],
      "hasDetails": true,
      "minMinutesSpent": null,
      "maxMinutesSpent": null,
      "address": "20 Đ. Cộng Hòa, Phường 12, Tân Bình, Hồ Chí Minh 70000, Vietnam",
      "rating": 2.9,
      "numRatings": 8,
      "tripadvisorRating": null,
      "tripadvisorNumRatings": null,
      "website": "http://hotpotstory.vn/",
      "internationalPhoneNumber": "+84 28 7301 1579",
      "priceLevel": 2,
      "imageKeys": [
        "2Bc1XBoGuBR22WWUB8tTNMyRl1RC1ISm",
        "g0bU4QpQmE9LDZH3kOXIsOKRlkmWiHGS",
        "rzN6HrNF2GvgNLVbqnqSn6eGe0q8JPIq",
        "qjK1k2nrABSx6JB8XSgqEzx90wvQyg6W"
      ],
      "images": [
        {
          "key": "2Bc1XBoGuBR22WWUB8tTNMyRl1RC1ISm",
          "width": 1920,
          "height": 1080
        },
        {
          "key": "g0bU4QpQmE9LDZH3kOXIsOKRlkmWiHGS",
          "width": 1440,
          "height": 1080
        },
        {
          "key": "rzN6HrNF2GvgNLVbqnqSn6eGe0q8JPIq",
          "width": 1920,
          "height": 1080
        },
        {
          "key": "qjK1k2nrABSx6JB8XSgqEzx90wvQyg6W",
          "width": 1920,
          "height": 1080
        }
      ],
      "reviews": [
        {
          "reviewId": "ChdDSUhNMG9nS0VJQ0FnSURSNW82MTJ3RRAB",
          "time": "2023-04-24T11:59:16.000Z",
          "reviewerName": "Nhật Trung NGUYỄN",
          "rating": 5,
          "rank": 5,
          "reviewText": "(Translated by Google) delicious, staff ok\n\n(Original)\nngon, nhân viên ok"
        },
        {
          "reviewId": "ChdDSUhNMG9nS0VJQ0FnSURSeVBudG9BRRAB",
          "time": "2023-04-16T15:30:54.000Z",
          "reviewerName": "Jeremy Chu",
          "rating": 1,
          "rank": 1,
          "reviewText": "(Translated by Google) Besides the good beef, the rest are terrible\n\n(Original)\nNgoài thịt bò ngon thì còn lại đều dở tệ"
        },
        {
          "reviewId": "ChdDSUhNMG9nS0VJQ0FnSURoNzVDOGlRRRAB",
          "time": "2023-03-21T03:50:52.000Z",
          "reviewerName": "Quoc Hung",
          "rating": 1,
          "rank": 2,
          "reviewText": "(Translated by Google) Ordered about 20 dishes but came out less than 10 plates :v when it was time to pay, the bill still showed 20 dishes that were the same as what I ordered :v the managers and staff of this place gutted the restaurant and divided it among themselves\n\n(Original)\nOrder tầm 20 món mà ra được chưa tới 10 đĩa :v đến lúc thanh toán thì bill vẫn ghi 20 món i chang mình order :v bọn quản lý nhân viên chỗ này rút ruột quán ăn chia với nhau rồi"
        },
        {
          "reviewId": "ChdDSUhNMG9nS0VJQ0FnSURlNWJlRWpnRRAB",
          "time": "2022-10-15T14:07:49.000Z",
          "reviewerName": "mai truong quynh",
          "rating": 1,
          "rank": 3,
          "reviewText": "(Translated by Google) too bad, the service is too bad, the restaurant is not crowded but the waiter ignores it, the menu has the wrong hot pot sauce, the hot pot has 3 compartments but is given 2 compartments, the food calls for 4 portions but is brought out 2 portions and when we return there is still no sign of it. , very poor experience, first and last time\n\n(Original)\nquá tệ, phục vụ quá tệ, quán k đông mà phục vụ bỏ mặc,  meun thì sai hình nước lẩu, lẩu 3 ngăn thì đưa 2 ngăn, đồ ăn kêu 4 phần mà đem ra 2 phần tới lúc về vẫn k thấy tăm hơi, trải nghiệm quá kém, lần đầu cũng như lần cuối"
        },
        {
          "reviewId": "ChdDSUhNMG9nS0VJQ0FnSUNocmNlTjBRRRAB",
          "time": "2023-02-19T14:49:13.000Z",
          "reviewerName": "Hoàng Minh",
          "rating": 1,
          "rank": 4,
          "reviewText": "(Translated by Google) Hello, serve?\n\n(Original)\nỦa alo phục vụ?"
        }
      ],
      "geo": null,
      "permanentlyClosed": true,
      "businessStatus": "CLOSED_PERMANENTLY",
      "ratingDistribution": {
        "Google": {
          "1": 4,
          "2": 0,
          "3": 0,
          "4": 1,
          "5": 3
        }
      },
      "utcOffset": 420,
      "openingPeriods": []
    },
    {
      "id": 5358719,
      "name": "Buttery Cake & Cafe",
      "placePageType": "visible",
      "placeId": "ChIJgRwlQ5MvdTERqQ_32WTjau8",
      "sources": [
        {
          "id": "527994",
          "type": "webPlacesList",
          "url": "https://www.subtitlelist.com/en/BEST-All-You-Can-Eat-SEAFOOD-Buffet-in-Saigon-VIETNAM-157647",
          "sourceSite": "Web",
          "snippet": "I'm gonna be the first in line here okay let's go stay here in anticipation Music guys I've been to a lot about face in my day you know I have and those are my favorite and just I'm a little speechless because I'm feeling kind of overwhelmed I gotta just show you because I took a quick walk around this buffet I'm getting chills you can't see right now but I got goose bumps going on my friend Viet here hey Viet how you doing so this is all seafood here appetizer we always stick the fest always Stefan Thanks fresh oyster from French yes cannabase it's finger food finger food matches appetizing Catherine Mercer from New Zealand he with tartar sauce so much variety it's not just simply like gonna get us to get some salad and thrown into a place smoked salmon from Scotland this is like a combination of just different foods around from around the world what is that steamed cake and she's rolling it in she like a fresh spring roll here salad bar cheese kind of we're gonna we're gonna bypass the Sally's a little bit because they're more exciting stuff ahead of us I promise you guys that this is crazy they have paging doctor the Peking duck and it's served like this yes you already with the chef he was hit over on preparation to cook for you and after that just speak up to your table and enjoy you brought to my table this looks like something I will get at a four or five-star restaurant look this there's no way this looks like something I get from a buffet like zero never seen it before you haven't seen the most exciting part yet there's a part in this buffet that I'm so excited about let's keep going let's go inside you have hot pot at a buffet yeah the top part here is over there I mean I've been to all you eat you hop up her face and I been to all-you-can-eat buffets I never seen them together and this is just incredible quality of ingredients you know this is a marriage made in buffet hotpot heaven this is a true station for you this choco drew mystery all the seafood here and the lobster we have more than night the recipe to cook and we serve the lobster at the table i order from the table you guys cook it the way I want and bring the lobster to my table just see thank you so much my friend I'm gonna I'm gonna get my eat on so I'm gonna get started I formulated a plan I'm thinking the first thing I need to do is order some lobsters and hi so what kind of lobsters do you have again grow with cheese that's a Chinese style well I won't go with cheese and then with chilli so that's like Singapore chilli crab almost so how long would that be five minutes I got five minutes to go get my other stuff I can do this thank you so much let's go mussels this spring roll looks like it has Chinese sausage inside I love China inside and I definitely need one with shrimp inside and steam roll for sure okay I think that's all I can fit in this plate let's put this back and get into play Oh my lobsters here wow what great timing huh got my lobster got my plate oh that's barbecue real well let's just dig in cuz lobster waits for no man when you see hot lobster in front of ya you gotta pay us some attention immediately that tastes almost exactly like the chili crap I had in Singapore at chef war well it's a lobster it's sweet a little eggy not very spicy at all Oh ma'am my lobster is so fresh which is like the slops you just swim to my plate and I just want to make sure I get that meat all over that delicious chili eggy sauce this is insane - it makes sense right it tastes good on crab why not officer and I don't even know how to even begin with it I feel like I'm gonna first date right now I'm just so overwhelmed I'm intimidated by this buffet by how many things I want to try on this buffet let's just crack open a claw let's burn it now right now by the way you know what I was kind of wondering like what kind of sauce I should dip this in and yeah is what tastes good with some sauce maybe like a little spicy mayo or something but as is this is already delicious and on this home it just has too sweet briny flavor excuse me what what do you dip this in usually oh thank you thank you it's so nice here I never seen a buffet where the crab is literally alive right before they cook it is a live one of effect this is as fresh as you can ever get thank you so much so you put this over some chili some lime in some salt and pepper dip it in the sauce oh wow that's perfect for crab its citrusy peppery spicy and it doesn't take away from the sweetness of the crab meat itself oh thank you sure what she's lobsters are here I've talked about she's lobsters before because always used to have them at Chinese banquets and I never see them cooked really anywhere else before especially not at about face cuz usually you go to a buffet even if there is lobster it's usually steamed or boiled and maybe sometimes grilled and I'll tell you guys this is my favorite way to eat lobster I can't believe they'd do that here on an all-you-can-eat buffet I can have as much of this as I want I'm starting out with pork sorry crab let's just you for a second look at this guy's straight out of the oven I gotta pick this up I know it's hot but oh you can taste the smoke definitely taste the cheese mix with that beautifully sweet lobster meat Music you ever seen Lobster do that before she goes so good with lobster that's why I lobster mac and cheese work so well no it's good another one going oh yeah oh yeah oh yeah we don't need anything else there's just real apps for me wrapped all in this gooey cheese once you guys tried this way of preparing Lobster trust me you're gonna absolutely love it Music so perfect this is literally the third Lobster I'm finishing right now I'm just gonna tip it a little bit in the sauce for my crab because then it's gonna a little too cheesy for me haha but how much I love romantic comedies I didn't think that was possible but that citrus and chilli on the lobster means that I could probably eat like double the amount of lobster than usual okay I'm gonna hit pause on the seat but just because this is all sitting here I want to try this out first this little cocktail shrimp with a little lime and it looks like sriracha mayo in some dill oh one dwarf mmm spicy mayo I feel like it has a little ketchup in here yeah and there's a little Chandi yes it's a cute little cheese sandwich shaped like a little football there's some some sweet onions we're jamming here we're delicious you know I'd make it better add a little lobster me to here somebody loves lobster sandwich now it's shoes on cheese on lobster you know that's gonna be good I'm behind this baby for what looks like maybe some lettuce a little toaster hmm everything I had so far it's been superb superb I can't wait for this I think that's port near here shrimp beef noodles everything is so fresh all the ingredients still ridiculously fresh and well prepared all right I'm gonna wrap this up then we gonna go for round two at this moment this is the most valuable real estate you need but this this speaking duck dish that needs to get in here right now this is officers about the sauce fish sauce can never be wasted never I don't even care but the breads gonna fill up my stomach I don't it's that good I really hope that if you guys come to this buffet that they have this particular dish this might be one of the best things I've had out any buffet at any time anywhere I would pay money for this at a restaurant like no questions asked I don't know what this is but I mean it's here I'm gonna dip it a little bit again excuse me I'll be right back yeah I had to right away get another plate of this thing you do with some of the fruits this time I just can't get over how ridiculous this dish is unbelievably good I think also that there's bits of peppercorn here to get some of that nice numbing flavor there's just a greater stamp all right plate number four we're going after the main dishes here I can order a bit in these noodle soup okay so here this kinda like a like a Mongolian style barbecue supper with much better ingredients my chance is thank you this is a noodle soup gonna add some scallions a little bit of gel Thai chili pepper corn there's a tiny bit lime and you said a little bit of sriracha like tiny bit and then my stir-fried noodles gonna be done in about five minutes thank you here we go oh I can't wait for this to customize noodles one soup one stir-frying the soups got a couple pieces of corn here oh the beautiful wide rice noodles I have fun before this tastes a lot like the crab noodle soup I had on the middle port and I love how citrusy the Super Soaker ah it takes borderline like a Tom Yum soup and no wonder they call this Vietnamese rule golf these noodles are the same size as udon noodles but of course this is made with rice Music for production I know I'm eating a lot of dishes that fill up a lot of room in my stomach but I got no regrets next up this is my own creation I didn't put a lot of things in here there's some mushrooms some onions and then just beef and a little it looks like egg noodles these noodles are assuring my expectations were really low because I'm thinking because it just looks like boring old egg noodles Wow double Wow first of all you don't cook perfectly chewy perfect degree of doneness in the sauce it seems like some sort of salty sauce worth actually no one piece sort of like that Vietnamese chili sauce I had from before but whatever this is it is highly addictive highly objective I never advocate going from you know that a buffet I certainly don't advocate going for a second helping of noodles out of up bay but I'm gonna down this now I'm going for a second ball wow those noodles now I need to go get this I think when you do this you put it onto your tray it's a massive wants could I get a shabu yeah that'd be great and then do I get this grilled somewhere oh yeah thank you oh come back and get both you got it see you soon and while we wait let's see if there's something I missed pork neck would muster was not here before Oh comforting look at this look at that doesn't that just look pretty pork neck with mustard and this also wasn't here stir-fried seafood a little bit of fried rice this should tide me over until my hot pots ready pork right but it tastes like those pigs that fight against those really angry birds because this is top hey sometime here so with the hotpot what you do is you put whatever you want on your place so I got some beef some random veggies I think one of those is mine yeah thank you today you can get some more sauce here so what they basically did was it just took the ingredients and they boiled it and you just dip it in the sauce first of all your goodies massive prawns Chuck on a hill Oh bet oh yeah I love it when they use wooden charcoal because the smoky flavor is so enhanced and I have some fish sauce and chili oh my gosh some candy actually human just without sauce I got an octopus I'm not sure why - Kendra hmm that's really good whoa that might be burning the shrimp in the shabu-shabu not really what I expected I thought you feel I got like a pot best that's kind expect a little too much here okay this is not a shabu shabu plays hold of me me just cut a little thick and they give you some sauce to go with it Music it's not half bad because the meat is sliced kinda thick it is a little tougher than I like but the quality of meat is good the sauce is nice I mean for a buffet I'll tell you what I've had worse than actual hot pot restaurants all right here guys I gotta see what time it is yep this there's our time I don't know what Fuji cake is all I know is I want something this looks good Oh cappuccino drink looking thing oh yeah I need this this might be the last one they had dessert round always bittersweet oh hopefully a more sweet than bitter this is something I'm happy for green bean soup is something that Chinese love and its really awesome a drink this was hot outside this is a dessert drink we pushed order in here but we never add seafood and I had this bizarre at another restaurant here of Vietnam it tastes pretty good Music this one does as well it's slightly funky bizarre the seaweed flavor is more pronounced here but stuff I love love mumbling subsides mum peanut green bean we call a noodle or Indian Chinese but it's really mombi all right pleasant as day this is ridiculously good it tastes a little bit like Chinese yogurt I'm a much swear a much prettier Music it's so good alright let's get to this cheers to a great buffet guys every single one of these beautifully designed plates that came out of a babe has been spectacular and this is no exception this ha player I think is raspberry jam the cake here in the middle it's firm but it breaks down really easily and when it goes into your mouth and my smack in the middle it's a layer of fruity I think maybe strawberry mousse the whole thing if tarp as sweet this buttery is a great way to wrap up this meal fantastic way to wrap up this meal well if you can't tell I kind of like this buffet and add up all the buffets I've ever been to this one probably had the freshest seafood and this is the only place I've ever seen that and especially the size place of food for you and those dishes not only look amazing they take - even better and I'm pretty sure when I say this that this is the best super buffet I've been to so far in my life and guys there's another reason this place is awesome just walk it around it if you ask me how much this buffet cost I will usually say 80 90 and maybe even a hundred dollars but this place 53 US dollars so yes I highly highly highly highly recommend this place so if you're ever in Saigon where you're ever in Vietnam but you know what if you're in the Southeast Asia region you need to come and eat at this place also I'll just think of this morning check this out I think I've determined that Saigon is one of the best cities in the world to go on a vacation here's watch plane ticket aside if you can find a time when the plane ticket it's not that much hotels Arabi and he's like nice ones in this city goes for like twenty thirty forty dollars so you get a cheap flight you come here and you book a nice hotel you book a nice Airbnb that's what I'm gonna run you thirty forty dollars a night then you only really need to budget like five to ten hours a day for food I mean what is that cheap in the city and is ridiculously good and then like one night you splurge a little bit you come here best vacation ever and guys as always the information for this place is listed in my description box thank y'all so much for watching thank you so much for joining me on this awesome seafood buffet adventure and I'm till we get again I'll see you later",
          "siteName": "subtitlelist.com",
          "shortName": "BEST All You Can Eat SEAFOOD Buffet in Saigon VIETNAM",
          "indexInSource": 5,
          "iconSiteId": 52467,
          "showIcon": false,
          "showInternalLink": false,
          "showExternalLink": true,
          "showSiteNameOnWeb": true
        }
      ],
      "description": null,
      "generatedDescription": null,
      "categories": [
        "Cafe",
        "Brunch restaurant",
        "Cake shop",
        "Catering food and drink supplier",
        "Chocolate cafe",
        "Cupcake shop",
        "Pastry shop",
        "Restaurant supply store"
      ],
      "hasDetails": true,
      "minMinutesSpent": null,
      "maxMinutesSpent": null,
      "address": "94 Mạc Thị Bưởi, Bến Nghé, Quận 1, Hồ Chí Minh 72806, Vietnam",
      "rating": 4.4,
      "numRatings": 250,
      "tripadvisorRating": null,
      "tripadvisorNumRatings": null,
      "website": "https://buttery.asia/",
      "internationalPhoneNumber": "+84 878 929 899",
      "priceLevel": null,
      "imageKeys": [
        "ONRyTSLGjuceMBRJAbFaf53ujnYBuIfq",
        "Fjd6OyzdC16DH5kVV5rDsKFzSyFEIsGJ",
        "yPiGHXHDQJrnHm59vc32zW0fH4dBS0us"
      ],
      "images": [
        {
          "key": "ONRyTSLGjuceMBRJAbFaf53ujnYBuIfq",
          "width": 1440,
          "height": 1080
        },
        {
          "key": "Fjd6OyzdC16DH5kVV5rDsKFzSyFEIsGJ",
          "width": 864,
          "height": 1080
        },
        {
          "key": "yPiGHXHDQJrnHm59vc32zW0fH4dBS0us",
          "width": 720,
          "height": 1080
        }
      ],
      "reviews": [
        {
          "reviewId": "ChdDSUhNMG9nS0VJQ0FnSUQzd09PSnV3RRAB",
          "time": "2024-11-11T02:53:10.000Z",
          "reviewerName": "Chris Thompson",
          "rating": 5,
          "rank": 1,
          "reviewText": "Great location in the heart of Saigon. Lovely Parisien style design and packed full of delicious pastries and cakes. I also enjoyed the coffee and the comfy surroundings. Nice friendly service also. Well worth checking out"
        },
        {
          "reviewId": "ChZDSUhNMG9nS0VJQ0FnTUN3ajhTU0VnEAE",
          "time": "2025-03-22T00:47:32.000Z",
          "reviewerName": "Fred Jaeger",
          "rating": 5,
          "rank": 1,
          "reviewText": "+++ best red velvet. Usually i like my dessert very sweet. This one wasn't sweet but it's been still the best red velvet i had\n+++ coconut was very creamy\n\n--- they had to clean the top window"
        },
        {
          "reviewId": "ChZDSUhNMG9nS0VJQ0FnSURudnFyYkN3EAE",
          "time": "2024-10-06T09:10:21.000Z",
          "reviewerName": "Roby Rosso",
          "rating": 4,
          "rank": 2,
          "reviewText": "Buttery Cake & Cafe\n\nWe have been coming to this pastry shop and cafe for breakfast for several mornings and I like it. If someone like us doesn't book breakfast at the hotel, this allows us to explore the bars, pastry shops or cafes in the area in the morning and not always stay in the hotel, then in Ho Chi Minh walking in the morning is a spectacle, the atmosphere, the people getting ready for their work, in the preparation of food of every quality, flavor and aroma, seeing the human river on scooters heading to work, carrying everything on their scooters 🛵 and parents accompanying their children even 5 on the scooter... how wonderful! 🤩 . Returning to the place, making a very brief description, the pastries are good and also the various types of coffee both hot and cold.\n\nFOOD AND DRINKS:\nThe desserts are really good and also aesthetically pleasing, the croissants 🥐 are of different qualities with various fillings and there are different sizes from large to mignon and are served hot, the pastries are also good. The coffee ☕️ of various specialties, Vietnamese, American or Italian both hot and cold is excellent, however my favorite is the Vietnamese coffee. In addition to coffee, the desserts also have various juices and even sandwiches but I have never tried them.\n\nPRICE:\nTo get an idea of ​​how much it costs, one morning we ordered a hot Vietnamese coffee with milk☕️, a cold coconut coffee, a large empty croissant 🥐 and two mignon croissants with cream filling and we spent about 3,500,000 dong (about 12 fr)\n\nEXTERIOR ENVIRONMENT:\nThe Buttery cake and cafe is located in a street in the center, near the famous Nguyen Hue Street in Ho Chi Minh, next to it there are many shops and other cafes, then the usual scooters 🛵 parked everywhere on the sidewalk and the guard who controls them. The facade is a glass that you can see the inside and the sign is simple but aesthetically nice.\n\nINTERIOR AMBIENCE:\nWhen you enter you are immediately greeted by the pastry shop window and then there is the counter, it is a long and narrow place on several floors. The predominant colors are white and light brown and the armchairs and sofas are comfortable, even the furniture is tasteful. Then there is a staircase that goes up to the upper floors that lights up when you go up and gives a nice light effect.\n\nATMOSPHERE:\nThe atmosphere is relaxing, the light of the lamps is not annoying, with background songs 🎶 also these relaxing, the only thing is that the different times we went they were always the same songs.\n\nSERVICE:\nThe staff is all young, professional, kind and fast in the service. Well done 👏\n\nTO IMPROVE:\nEverything is good, the only advice is to change the background music every now and then, because after a few days you hear the same songs 🎶, which are beautiful, but then become boring."
        },
        {
          "reviewId": "ChdDSUhNMG9nS0VJQ0FnTUN3MVozWXVRRRAB",
          "time": "2025-03-20T08:20:10.000Z",
          "reviewerName": "L Vivi's",
          "rating": 4,
          "rank": 2,
          "reviewText": "Pass by this store several times, and finally have time to sit down and have a cup of coffee. Beverage here is decorated good. But the bottle size is a bit too small, flavor was so so, not that impressed me. But the store environment is very pretty to take nice pictures."
        },
        {
          "reviewId": "ChdDSUhNMG9nS0VJQ0FnSUQ3NGZ2eTFRRRAB",
          "time": "2024-08-25T07:02:16.000Z",
          "reviewerName": "Mi Sachi",
          "rating": 3,
          "rank": 4,
          "reviewText": "Cake and cafe shop near Nguyen Hue walking stress, right in the center of District 1. The shop is beautifully decorated and clean. There are many types of cakes with beautiful eye-catching shapes. However, the cakes are only suitable for taking virtual photos. Because the cakes we ordered all tasted very normal, not that delicious. The price is way too expensive maybe because the shop is located in the center of the city."
        },
        {
          "reviewId": "ChZDSUhNMG9nS0VJQ0FnSURyNlpiZFNnEAE",
          "time": "2024-07-18T13:01:55.000Z",
          "reviewerName": "Lily",
          "rating": 3,
          "rank": 5,
          "reviewText": "I wouldn't get the onigri croissant again. It was quite dense and stale .  All the cream came out the other way after the first bite. To avoid this, I guess it is best to use knife and fork on it.\n\nI thought the chocolate clam was solid. It was beautiful in presentation as well.\n\nThe staff here seem friendly and helpful.  The place was bright and clean.\n\nThe price point is on the expensive side but not too outrageous for tourists."
        },
        {
          "reviewId": "ChZDSUhNMG9nS0VJQ0FnTURRM3QzNUNBEAE",
          "time": "2025-03-11T09:15:09.000Z",
          "reviewerName": "Clarissa Lee",
          "rating": 5,
          "rank": 5,
          "reviewText": "A beautiful cafe with the most amazing cakes, not overly sweet and has wonderful taste. Drinks are refreshing and innovative. Would fly back to Vietnam just to eat it again 😍"
        },
        {
          "reviewId": "ChZDSUhNMG9nS0VJQ0FnSURQNGZ5Qk1REAE",
          "time": "2024-12-03T04:10:22.000Z",
          "reviewerName": "Hieu Nguyen",
          "rating": 5,
          "rank": 6,
          "reviewText": "One of my favorite places for patisserie in town. The Christmas vibes at this cafe right now is so warm and festive with the Christmas holiday cakes."
        }
      ],
      "geo": null,
      "permanentlyClosed": false,
      "businessStatus": "OPERATIONAL",
      "ratingDistribution": {
        "Google": {
          "1": 21,
          "2": 2,
          "3": 13,
          "4": 42,
          "5": 176
        }
      },
      "utcOffset": 420,
      "openingPeriods": [
        {
          "open": {
            "day": 0,
            "time": "0830"
          },
          "close": {
            "day": 0,
            "time": "2300"
          }
        },
        {
          "open": {
            "day": 1,
            "time": "0830"
          },
          "close": {
            "day": 1,
            "time": "2300"
          }
        },
        {
          "open": {
            "day": 2,
            "time": "0830"
          },
          "close": {
            "day": 2,
            "time": "2300"
          }
        },
        {
          "open": {
            "day": 3,
            "time": "0830"
          },
          "close": {
            "day": 3,
            "time": "2300"
          }
        },
        {
          "open": {
            "day": 4,
            "time": "0830"
          },
          "close": {
            "day": 4,
            "time": "2300"
          }
        },
        {
          "open": {
            "day": 5,
            "time": "0830"
          },
          "close": {
            "day": 5,
            "time": "2300"
          }
        },
        {
          "open": {
            "day": 6,
            "time": "0830"
          },
          "close": {
            "day": 6,
            "time": "2300"
          }
        }
      ]
    }
  ],
  "date": null,
  "startDate": null,
  "endDate": null,
  "tripPlanKey": null,
  "distinction": null,
  "boardSections": [
    {
      "type": "normal",
      "id": 0,
      "heading": "",
      "text": {
        "ops": [
          {
            "insert": "\n"
          }
        ]
      },
      "placeMarkerColor": "#e23e57",
      "placeMarkerIcon": "map-marker",
      "blocks": [
        {
          "id": 0,
          "type": "place",
          "place": {
            "name": "The Log Restaurant",
            "placeId": "ChIJf1qTJ7UodTERbHYktGu2ras",
            "longitude": 106.702344,
            "latitude": 10.789937
          },
          "text": {
            "ops": [
              {
                "insert": "\n"
              }
            ]
          },
          "addedBy": {
            "type": "unknown"
          },
          "upvotedBy": [],
          "selectedImageKey": "drFGMNkGREhaKDffQIT8i3sQabOzDZ9b",
          "imageKeys": [
            "drFGMNkGREhaKDffQIT8i3sQabOzDZ9b",
            "HNyO7PU40JLzRYnNINwUYNaQwx7ZGfIW",
            "nqK4H8xqm6HwjaR17ccvkPuUWfm3UFKx",
            "eaZqKxG2Kn19L94WAMofvEz8iSl0tqgh",
            "xSjdXoyCH38GaXmKuY8P8fLXW0tla03W"
          ],
          "travelMode": null,
          "attachments": [],
          "imageSize": "large"
        },
        {
          "id": 1,
          "type": "place",
          "place": {
            "name": "Pachi Pachi Nướng Lẩu Nhật Bản",
            "placeId": "ChIJA4NJAjUvdTERTfGNCjVCVSI",
            "longitude": 106.696926,
            "latitude": 10.787369
          },
          "text": {
            "ops": [
              {
                "insert": "\n"
              }
            ]
          },
          "addedBy": {
            "type": "unknown"
          },
          "upvotedBy": [],
          "selectedImageKey": "SmqPy6s8mzEq22Z46IQk5NkmXIO0nXe8",
          "imageKeys": [
            "SmqPy6s8mzEq22Z46IQk5NkmXIO0nXe8",
            "88XFeZdigDzTv64wnPxSzks4I7mQD6tD",
            "9sWjcyO96Wi2kCZayCx8uiAIEKc35NA0"
          ],
          "travelMode": null,
          "attachments": [],
          "imageSize": "large"
        },
        {
          "id": 2,
          "type": "place",
          "place": {
            "name": "À Lôi BBQ - Buffet Nướng Sân Vườn Tân Phú",
            "placeId": "ChIJtY7mfgAvdTERyVYAQcVveP8",
            "longitude": 106.636013,
            "latitude": 10.78495
          },
          "text": {
            "ops": [
              {
                "insert": "\n"
              }
            ]
          },
          "addedBy": {
            "type": "unknown"
          },
          "upvotedBy": [],
          "selectedImageKey": "BMcnSJy19HtDSrYicoXfTwAfn5RBpL3g",
          "imageKeys": [
            "BMcnSJy19HtDSrYicoXfTwAfn5RBpL3g",
            "WmKcAWsGcuufavRKFDZMwVVMjCad6za8",
            "9NmiHv6n86N8l0FFBaEGTbIAzSLejrLU"
          ],
          "travelMode": null,
          "attachments": [],
          "imageSize": "large"
        },
        {
          "id": 3,
          "type": "place",
          "place": {
            "name": "Gió Nội Restaurant Level 9",
            "placeId": "ChIJH2Cnjj0vdTERhy1lbvIQdoM",
            "longitude": 106.692301,
            "latitude": 10.76809
          },
          "text": {
            "ops": [
              {
                "insert": "\n"
              }
            ]
          },
          "addedBy": {
            "type": "unknown"
          },
          "upvotedBy": [],
          "selectedImageKey": "ySQ0XsmV4nDUlBp2gxr1Iz3T6zDPMFGM",
          "imageKeys": [
            "ySQ0XsmV4nDUlBp2gxr1Iz3T6zDPMFGM",
            "ruwverX5dHSn6lZBpP34YzY3NQacamrY",
            "7r4xeTfgCPBSrrgVpP0Uu9VOUNmzYVQC",
            "UXf9tWtXVlZUyF3qXSZzIIw5SqvTuSz7"
          ],
          "travelMode": null,
          "attachments": [],
          "imageSize": "large"
        },
        {
          "id": 4,
          "type": "place",
          "place": {
            "name": "Mezz",
            "placeId": "ChIJ_cQd70kvdTERvsoysmk4bs0",
            "longitude": 106.702452,
            "latitude": 10.784076
          },
          "text": {
            "ops": [
              {
                "insert": "\n"
              }
            ]
          },
          "addedBy": {
            "type": "unknown"
          },
          "upvotedBy": [],
          "selectedImageKey": "rk3LnV10fSgXsoURQ88F8TAN6GZJ4yPz",
          "imageKeys": [
            "rk3LnV10fSgXsoURQ88F8TAN6GZJ4yPz",
            "rz0FcJZ2AVs5zrgZmE8LKVGyYMsQ336W",
            "NRquxc7QSOQuCkLwxprUGTt2PTe01HHe"
          ],
          "travelMode": null,
          "attachments": [],
          "imageSize": "large"
        },
        {
          "id": 5,
          "type": "place",
          "place": {
            "name": "Central Restaurant",
            "placeId": "ChIJ6xXIOwAvdTEReYFFG4G3wpI",
            "longitude": 106.700739,
            "latitude": 10.774738
          },
          "text": {
            "ops": [
              {
                "insert": "\n"
              }
            ]
          },
          "addedBy": {
            "type": "unknown"
          },
          "upvotedBy": [],
          "selectedImageKey": "4SnKr0cdpZybOGky73pgqB0S9kg80J93",
          "imageKeys": [
            "4SnKr0cdpZybOGky73pgqB0S9kg80J93",
            "vlFkmqGrhB6O0EB3FeP6wWJXnRZG1cci",
            "iNsddnVl1OJE6tTVsWli1gTp2wQScnAN"
          ],
          "travelMode": null,
          "attachments": [],
          "imageSize": "large"
        },
        {
          "id": 6,
          "type": "place",
          "place": {
            "name": "Delisa - Fresh Salad Bar HCM",
            "placeId": "ChIJ2dd1E4wvdTERRkLrv5Jj1zo",
            "longitude": 106.701212,
            "latitude": 10.769257
          },
          "text": {
            "ops": [
              {
                "insert": "\n"
              }
            ]
          },
          "addedBy": {
            "type": "unknown"
          },
          "upvotedBy": [],
          "selectedImageKey": "bWlFux2g4iHtaHoIlTq3yK82ZHbu6i2j",
          "imageKeys": [
            "bWlFux2g4iHtaHoIlTq3yK82ZHbu6i2j",
            "CPIviCL9wBcN3pzL7WCTaFLs40xtbWAx",
            "22MV9NukJ64Bk6G0JM0etob5xsZnnRkB"
          ],
          "travelMode": null,
          "attachments": [],
          "imageSize": "large"
        },
        {
          "id": 7,
          "type": "place",
          "place": {
            "name": "Hotel Nikko Saigon",
            "placeId": "ChIJF9cbwBsvdTERxQn29H80jjU",
            "longitude": 106.682954,
            "latitude": 10.764387
          },
          "text": {
            "ops": [
              {
                "insert": "Refined hotel with 2 restaurants, a lobby bar & an outdoor pool, plus a gym & a spa.\n"
              }
            ]
          },
          "addedBy": {
            "type": "unknown"
          },
          "upvotedBy": [],
          "selectedImageKey": "zCzgFGHMN9nEzYN5j6wvgXvSqtJnfX6c",
          "imageKeys": [
            "zCzgFGHMN9nEzYN5j6wvgXvSqtJnfX6c",
            "5qE1uYDDa6m1WMmXoNRy8Pyhr9Hsq6up",
            "rWMr1AMhYUoeAvirWFYsp1p47uoZEIjr"
          ],
          "travelMode": null,
          "attachments": [],
          "imageSize": "large"
        },
        {
          "id": 8,
          "type": "place",
          "place": {
            "name": "Buttery Cake & Cafe",
            "placeId": "ChIJgRwlQ5MvdTERqQ_32WTjau8",
            "longitude": 106.70398,
            "latitude": 10.774616
          },
          "text": {
            "ops": [
              {
                "insert": "\n"
              }
            ]
          },
          "addedBy": {
            "type": "unknown"
          },
          "upvotedBy": [],
          "selectedImageKey": "ONRyTSLGjuceMBRJAbFaf53ujnYBuIfq",
          "imageKeys": [
            "ONRyTSLGjuceMBRJAbFaf53ujnYBuIfq",
            "Fjd6OyzdC16DH5kVV5rDsKFzSyFEIsGJ",
            "yPiGHXHDQJrnHm59vc32zW0fH4dBS0us"
          ],
          "travelMode": null,
          "attachments": [],
          "imageSize": "large"
        },
        {
          "id": 9,
          "type": "place",
          "place": {
            "name": "Lobster Bay - Nguyễn Tri Phương",
            "placeId": "ChIJ1VoJFsAvdTERZGFJ_PhTqVA",
            "longitude": 106.66746,
            "latitude": 10.767242
          },
          "text": {
            "ops": [
              {
                "insert": "\n"
              }
            ]
          },
          "addedBy": {
            "type": "unknown"
          },
          "upvotedBy": [],
          "selectedImageKey": "SWf3KBLcTkxOiuAxtcv7Tm47rD70tPvG",
          "imageKeys": [
            "SWf3KBLcTkxOiuAxtcv7Tm47rD70tPvG",
            "Z1QaSpMR45PmiedQCMGQayJIsv82jxwh",
            "x6kzMD50c2fnj4YJFGaXMDknn2FEgNiz"
          ],
          "travelMode": null,
          "attachments": [],
          "imageSize": "large"
        },
        {
          "id": 10,
          "type": "place",
          "place": {
            "name": "Hotpot Story Pico Plaza Cộng Hòa",
            "placeId": "ChIJq9ma2zcpdTERBDciHGUtSew",
            "longitude": 106.653324,
            "latitude": 10.800884
          },
          "text": {
            "ops": [
              {
                "insert": "\n"
              }
            ]
          },
          "addedBy": {
            "type": "unknown"
          },
          "upvotedBy": [],
          "selectedImageKey": "2Bc1XBoGuBR22WWUB8tTNMyRl1RC1ISm",
          "imageKeys": [
            "2Bc1XBoGuBR22WWUB8tTNMyRl1RC1ISm",
            "g0bU4QpQmE9LDZH3kOXIsOKRlkmWiHGS",
            "rzN6HrNF2GvgNLVbqnqSn6eGe0q8JPIq",
            "qjK1k2nrABSx6JB8XSgqEzx90wvQyg6W"
          ],
          "travelMode": null,
          "attachments": [],
          "imageSize": "large"
        },
        {
          "id": 11,
          "type": "place",
          "place": {
            "name": "Red Chilli Seafood Buffet",
            "placeId": "ChIJLU8nGosvdTERKcfeNbaEFnY",
            "longitude": 106.719896,
            "latitude": 10.724443
          },
          "text": {
            "ops": [
              {
                "insert": "\n"
              }
            ]
          },
          "addedBy": {
            "type": "unknown"
          },
          "upvotedBy": [],
          "imageKeys": [],
          "travelMode": null,
          "attachments": [],
          "imageSize": "large"
        }
      ]
    }
  ],
  "headerTemplate": {
    "type": "geoCategory",
    "subType": "Seafood buffet",
    "updatedAt": "2025-06-27T00:02:45.000Z",
    "geo": {
      "id": 16,
      "name": "Ho Chi Minh City"
    },
    "blurbTemplate": "Are you looking for the best [autocompleteTerm] in [geoNameWithThe]? You’re not alone! Many of us love traveling on the Wanderlog team, so naturally we’re always on the hunt to find the most popular spots anytime we travel somewhere new. We’ve looked through different sources to find the best options, including favorites like [examplePlaceNames].",
    "topBlurb": "If you're a seafood lover, Ho Chi Minh City is a treasure trove waiting to be explored. From the bustling streets of District 1 to the serene rooftops overlooking the city, this vibrant metropolis offers a plethora of seafood buffet restaurants that cater to every palate. Imagine indulging in fresh oysters, succulent lobsters, and a variety of grilled dishes, all while soaking in the lively atmosphere of this dynamic city. Whether you're celebrating a special occasion or simply treating yourself to a delightful meal, the seafood buffets here promise an unforgettable dining experience.\n\nAs you navigate through the culinary landscape of Ho Chi Minh City, you'll discover a mix of well-established favorites and exciting new spots. Picture yourself at La Brasserie Restaurant, where you can savor luxurious seafood delicacies, or at The Log Restaurant, where the ambiance feels like a cozy treehouse retreat. With options ranging from traditional Vietnamese flavors to modern fusion cuisine, there's something for everyone. So, grab your appetite and get ready to dive into the best seafood buffets this city has to offer!",
    "placeName": "seafood buffet",
    "source": "autocompleteWebPlacesLists",
    "sourcesMerged": false
  },
  "author": null,
  "providerTitle": null,
  "relatedPagesData": {
    "drives": [
      {
        "type": "betweenGeos",
        "fromGeo": {
          "id": 16,
          "name": "Ho Chi Minh City",
          "englishName": "Ho Chi Minh City"
        },
        "toGeo": {
          "id": 4,
          "name": "Bangkok",
          "englishName": "Bangkok"
        },
        "freeImageKey": "NzYgP5R1QE8bUb3QIfWOe4RoZZA13zUY",
        "geoPairId": 194
      },
      {
        "type": "betweenGeos",
        "fromGeo": {
          "id": 16,
          "name": "Ho Chi Minh City",
          "englishName": "Ho Chi Minh City"
        },
        "toGeo": {
          "id": 11,
          "name": "Siem Reap",
          "englishName": "Siem Reap"
        },
        "freeImageKey": "gMuvSyhAUJ5Xy9gxqV29gtQbgvIOi76I",
        "geoPairId": 685
      },
      {
        "type": "betweenGeos",
        "fromGeo": {
          "id": 16,
          "name": "Ho Chi Minh City",
          "englishName": "Ho Chi Minh City"
        },
        "toGeo": {
          "id": 44,
          "name": "Phnom Penh",
          "englishName": "Phnom Penh"
        },
        "freeImageKey": "9WVJlSj96wlfgLibVR9COylWZmfn6vIm",
        "geoPairId": 916
      },
      {
        "type": "betweenGeos",
        "fromGeo": {
          "id": 16,
          "name": "Ho Chi Minh City",
          "englishName": "Ho Chi Minh City"
        },
        "toGeo": {
          "id": 7,
          "name": "Singapore",
          "englishName": "Singapore"
        },
        "freeImageKey": "2XfDHZA7UmGnP13Pxr9XqoxmrC8SBZ0O",
        "geoPairId": 385
      },
      {
        "type": "betweenGeos",
        "fromGeo": {
          "id": 16,
          "name": "Ho Chi Minh City",
          "englishName": "Ho Chi Minh City"
        },
        "toGeo": {
          "id": 15,
          "name": "Hong Kong",
          "englishName": "Hong Kong"
        },
        "freeImageKey": "hPR4xga5p53FRBJKZCZmt1YKXlJbmUeH",
        "geoPairId": 880
      },
      {
        "type": "betweenGeos",
        "fromGeo": {
          "id": 16,
          "name": "Ho Chi Minh City",
          "englishName": "Ho Chi Minh City"
        },
        "toGeo": {
          "id": 8,
          "name": "Hanoi",
          "englishName": "Hanoi"
        },
        "freeImageKey": "vCj4fm6pEMMNAdi5BQhIlOWF1xMpjq55",
        "geoPairId": 472
      },
      {
        "type": "betweenGeos",
        "fromGeo": {
          "id": 16,
          "name": "Ho Chi Minh City",
          "englishName": "Ho Chi Minh City"
        },
        "toGeo": {
          "id": 93,
          "name": "Nha Trang",
          "englishName": "Nha Trang"
        },
        "freeImageKey": "nC5ZRyxCwWTazjdcxOH79pMkk4AOij7q",
        "geoPairId": 926
      },
      {
        "type": "betweenGeos",
        "fromGeo": {
          "id": 16,
          "name": "Ho Chi Minh City",
          "englishName": "Ho Chi Minh City"
        },
        "toGeo": {
          "id": 80,
          "name": "Pattaya",
          "englishName": "Pattaya"
        },
        "freeImageKey": "64bS7BGFhCAXT1yvIdJKOHtyY3Kb7Ynz",
        "geoPairId": 924
      },
      {
        "type": "betweenGeos",
        "fromGeo": {
          "id": 16,
          "name": "Ho Chi Minh City",
          "englishName": "Ho Chi Minh City"
        },
        "toGeo": {
          "id": 33,
          "name": "Kuala Lumpur",
          "englishName": "Kuala Lumpur"
        },
        "freeImageKey": "N59DsrppN9BkfeNuRtjv8la1n4mJspor",
        "geoPairId": 914
      },
      {
        "type": "betweenGeos",
        "fromGeo": {
          "id": 16,
          "name": "Ho Chi Minh City",
          "englishName": "Ho Chi Minh City"
        },
        "toGeo": {
          "id": 21,
          "name": "Hoi An",
          "englishName": "Hoi An"
        },
        "freeImageKey": "92Ew55jhhTIdpTrmbRbCtxKjBXecTREP",
        "geoPairId": 913
      },
      {
        "type": "betweenGeos",
        "fromGeo": {
          "id": 16,
          "name": "Ho Chi Minh City",
          "englishName": "Ho Chi Minh City"
        },
        "toGeo": {
          "id": 277,
          "name": "Phan Thiet",
          "englishName": "Phan Thiet"
        },
        "freeImageKey": "eMLC5JvW6z7lQfgdFDJVuoljUzLn0h0q",
        "geoPairId": 939
      },
      {
        "type": "betweenGeos",
        "fromGeo": {
          "id": 16,
          "name": "Ho Chi Minh City",
          "englishName": "Ho Chi Minh City"
        },
        "toGeo": {
          "id": 174,
          "name": "Da Lat",
          "englishName": "Da Lat"
        },
        "freeImageKey": "TlKFjUP0MEHWcv1z8UQpyw2JWP06gaR0",
        "geoPairId": 931
      },
      {
        "type": "betweenGeos",
        "fromGeo": {
          "id": 16,
          "name": "Ho Chi Minh City",
          "englishName": "Ho Chi Minh City"
        },
        "toGeo": {
          "id": 53,
          "name": "Kathu",
          "englishName": "Kathu"
        },
        "freeImageKey": "u4SZZuq7NoENFy0L2XF7EFiemfTi0xZM",
        "geoPairId": 921
      },
      {
        "type": "betweenGeos",
        "fromGeo": {
          "id": 16,
          "name": "Ho Chi Minh City",
          "englishName": "Ho Chi Minh City"
        },
        "toGeo": {
          "id": 19,
          "name": "Chiang Mai",
          "englishName": "Chiang Mai"
        },
        "freeImageKey": "eoI04dDjC6PLWT1PQjFkfteKpM4dWIQ2",
        "geoPairId": 912
      },
      {
        "type": "betweenGeos",
        "fromGeo": {
          "id": 16,
          "name": "Ho Chi Minh City",
          "englishName": "Ho Chi Minh City"
        },
        "toGeo": {
          "id": 79,
          "name": "Krabi Town",
          "englishName": "Krabi Town"
        },
        "freeImageKey": "nZ7g8B4VZqE26G4qwK5tTUy823IRWUt6",
        "geoPairId": 923
      },
      {
        "type": "betweenGeos",
        "fromGeo": {
          "id": 16,
          "name": "Ho Chi Minh City",
          "englishName": "Ho Chi Minh City"
        },
        "toGeo": {
          "id": 92,
          "name": "Hue",
          "englishName": "Hue"
        },
        "freeImageKey": "IXcdWWrv4cH4uTeZM35fG2a3SRd5xUCN",
        "geoPairId": 925
      },
      {
        "type": "betweenGeos",
        "fromGeo": {
          "id": 16,
          "name": "Ho Chi Minh City",
          "englishName": "Ho Chi Minh City"
        },
        "toGeo": {
          "id": 184,
          "name": "Luang Prabang",
          "englishName": "Luang Prabang"
        },
        "freeImageKey": "M9tDHSsizbVFJp8SKDMPp2HPQKdrw6BM",
        "geoPairId": 934
      },
      {
        "type": "betweenGeos",
        "fromGeo": {
          "id": 16,
          "name": "Ho Chi Minh City",
          "englishName": "Ho Chi Minh City"
        },
        "toGeo": {
          "id": 128,
          "name": "Hua Hin",
          "englishName": "Hua Hin"
        },
        "freeImageKey": "Ik9ECwlFEcX90omuYhTIYeRzAwvRMhr2",
        "geoPairId": 929
      },
      {
        "type": "betweenGeos",
        "fromGeo": {
          "id": 16,
          "name": "Ho Chi Minh City",
          "englishName": "Ho Chi Minh City"
        },
        "toGeo": {
          "id": 52,
          "name": "Yangon (Rangoon)",
          "englishName": "Yangon (Rangoon)"
        },
        "freeImageKey": "jAeueHgf9P1psWjvQkfFJgwbuAGWI8oe",
        "geoPairId": 920
      },
      {
        "type": "betweenGeos",
        "fromGeo": {
          "id": 16,
          "name": "Ho Chi Minh City",
          "englishName": "Ho Chi Minh City"
        },
        "toGeo": {
          "id": 105,
          "name": "Macau",
          "englishName": "Macau"
        },
        "freeImageKey": "0Ikyab6z9iGrxfBKhVXcHNo45Ida00Mj",
        "geoPairId": 927
      },
      {
        "type": "betweenGeos",
        "fromGeo": {
          "id": 16,
          "name": "Ho Chi Minh City",
          "englishName": "Ho Chi Minh City"
        },
        "toGeo": {
          "id": 468,
          "name": "Ayutthaya",
          "englishName": "Ayutthaya"
        },
        "freeImageKey": "RL5lOhGFMfXBd42nUjDz5ylGWERCZDwX",
        "geoPairId": 943
      },
      {
        "type": "betweenGeos",
        "fromGeo": {
          "id": 16,
          "name": "Ho Chi Minh City",
          "englishName": "Ho Chi Minh City"
        },
        "toGeo": {
          "id": 137,
          "name": "George Town",
          "englishName": "George Town"
        },
        "freeImageKey": "6sWspNx65TzFHZCZO4ZKMizTeY8YZ69f",
        "geoPairId": 930
      },
      {
        "type": "betweenGeos",
        "fromGeo": {
          "id": 16,
          "name": "Ho Chi Minh City",
          "englishName": "Ho Chi Minh City"
        },
        "toGeo": {
          "id": 584,
          "name": "Kanchanaburi",
          "englishName": "Kanchanaburi"
        },
        "freeImageKey": "bVJjcG8DbZdvy9kRuB0n7RObzBU3pZwX",
        "geoPairId": 944
      },
      {
        "type": "betweenGeos",
        "fromGeo": {
          "id": 16,
          "name": "Ho Chi Minh City",
          "englishName": "Ho Chi Minh City"
        },
        "toGeo": {
          "id": 257,
          "name": "Chiang Rai",
          "englishName": "Chiang Rai"
        },
        "freeImageKey": "tIJaiAgHcoCihQMkBlUWlk9yHaO7KGUm",
        "geoPairId": 937
      },
      {
        "type": "betweenGeos",
        "fromGeo": {
          "id": 16,
          "name": "Ho Chi Minh City",
          "englishName": "Ho Chi Minh City"
        },
        "toGeo": {
          "id": 263,
          "name": "Sihanoukville",
          "englishName": "Sihanoukville"
        },
        "freeImageKey": "LcKlV0sVyQYnSZ6ArusRApS7QbE7PYii",
        "geoPairId": 163587
      },
      {
        "type": "betweenGeos",
        "fromGeo": {
          "id": 16,
          "name": "Ho Chi Minh City",
          "englishName": "Ho Chi Minh City"
        },
        "toGeo": {
          "id": 456,
          "name": "Vung Tau",
          "englishName": "Vung Tau"
        },
        "freeImageKey": "N4jMb1YE0CcBaX8OlgFfe3XAKE15qf3i",
        "geoPairId": 2379505
      },
      {
        "type": "betweenGeos",
        "fromGeo": {
          "id": 16,
          "name": "Ho Chi Minh City",
          "englishName": "Ho Chi Minh City"
        },
        "toGeo": {
          "id": 292,
          "name": "Vientiane",
          "englishName": "Vientiane"
        },
        "freeImageKey": "w93BSoXnVkHPFOSkDk0zFhRDzsn2TffZ",
        "geoPairId": 940
      },
      {
        "type": "betweenGeos",
        "fromGeo": {
          "id": 16,
          "name": "Ho Chi Minh City",
          "englishName": "Ho Chi Minh City"
        },
        "toGeo": {
          "id": 1447,
          "name": "Kep",
          "englishName": "Kep"
        },
        "freeImageKey": "JOe5f1Bl1GFAmyLlAwNI34BHCs93i0s8",
        "geoPairId": 2379541
      },
      {
        "type": "betweenGeos",
        "fromGeo": {
          "id": 16,
          "name": "Ho Chi Minh City",
          "englishName": "Ho Chi Minh City"
        },
        "toGeo": {
          "id": 187,
          "name": "Melaka",
          "englishName": "Melaka"
        },
        "freeImageKey": "Qv2D54posQMwfgPkwlj5T34PJ3arEw4p",
        "geoPairId": 935
      },
      {
        "type": "betweenGeos",
        "fromGeo": {
          "id": 16,
          "name": "Ho Chi Minh City",
          "englishName": "Ho Chi Minh City"
        },
        "toGeo": {
          "id": 180,
          "name": "Halong Bay",
          "englishName": "Halong Bay"
        },
        "freeImageKey": "qyfBru3mcQ8JxDrt9aVFlB8eAU2WTx18",
        "geoPairId": 933
      }
    ],
    "categories": [
      {
        "id": 737,
        "name": "Restaurants",
        "shortName": "Restaurants",
        "emoji": "fork-and-knife-with-plate",
        "keywordCategoryGroup": null,
        "mapLayerGroup": "restaurants",
        "geoCategoryName": "Where to eat: the  best restaurants in Ho Chi Minh City"
      },
      {
        "id": 104401,
        "name": "Attractions",
        "shortName": "Attractions",
        "emoji": "round-pushpin",
        "keywordCategoryGroup": null,
        "mapLayerGroup": "attractions",
        "geoCategoryName": "Top  things to do and attractions in Ho Chi Minh City"
      },
      {
        "id": 738,
        "name": "Cafes",
        "shortName": "Cafes",
        "emoji": "hot-beverage",
        "keywordCategoryGroup": null,
        "mapLayerGroup": "cafes",
        "geoCategoryName": "The  best coffee shops and best cafes in Ho Chi Minh City"
      },
      {
        "id": 160170,
        "name": "Photo spots",
        "shortName": "Photo spots",
        "emoji": "camera-with-flash",
        "keywordCategoryGroup": null,
        "mapLayerGroup": "attractions",
        "geoCategoryName": "The  best photo spots in Ho Chi Minh City"
      },
      {
        "id": 765,
        "name": "Cheap food",
        "shortName": "Cheap eats",
        "emoji": "cheapEats",
        "keywordCategoryGroup": null,
        "mapLayerGroup": "restaurants",
        "geoCategoryName": "The  best cheap eats in Ho Chi Minh City"
      },
      {
        "id": 734,
        "name": "Breakfast and brunch",
        "shortName": "Breakfast and brunch",
        "emoji": "cooking",
        "keywordCategoryGroup": null,
        "mapLayerGroup": "restaurants",
        "geoCategoryName": "The  best breakfast and brunch in Ho Chi Minh City"
      },
      {
        "id": 739,
        "name": "Bakeries",
        "shortName": "Bakeries",
        "emoji": "croissant",
        "keywordCategoryGroup": null,
        "mapLayerGroup": "cafes",
        "geoCategoryName": "The  best bakeries in Ho Chi Minh City"
      },
      {
        "id": 741,
        "name": "Breweries and beer",
        "shortName": "Breweries and beer",
        "emoji": "beer-mug",
        "keywordCategoryGroup": null,
        "mapLayerGroup": "bars",
        "geoCategoryName": "The  best Ho Chi Minh City breweries and craft beer"
      },
      {
        "id": 32920,
        "name": "Family restaurants",
        "shortName": "Family restaurants",
        "emoji": "chickenDrumStick",
        "keywordCategoryGroup": null,
        "mapLayerGroup": "restaurants",
        "geoCategoryName": "The  best family restaurants in Ho Chi Minh City"
      },
      {
        "id": 142180,
        "name": "Museums",
        "shortName": "Museums",
        "emoji": "classical-building",
        "keywordCategoryGroup": null,
        "mapLayerGroup": "attractions",
        "geoCategoryName": "The  best museums in Ho Chi Minh City"
      },
      {
        "id": 745,
        "name": "Bars",
        "shortName": "Bars",
        "emoji": "tropical-drink",
        "keywordCategoryGroup": null,
        "mapLayerGroup": "bars",
        "geoCategoryName": "The  best bars and drinks in Ho Chi Minh City"
      },
      {
        "id": 167366,
        "name": "Shopping",
        "shortName": "Shopping",
        "emoji": "shopping-bags",
        "keywordCategoryGroup": null,
        "mapLayerGroup": null,
        "geoCategoryName": "The  best shopping and stores in Ho Chi Minh City"
      },
      {
        "id": 138582,
        "name": "Kid-friendly attractions",
        "shortName": "Kid-friendly attractions",
        "emoji": "carousel-horse",
        "keywordCategoryGroup": null,
        "mapLayerGroup": "attractions",
        "geoCategoryName": "The  best things to do with kids in Ho Chi Minh City"
      },
      {
        "id": 152974,
        "name": "Nightlife",
        "shortName": "Nightlife",
        "emoji": "night-with-stars",
        "keywordCategoryGroup": null,
        "mapLayerGroup": "bars",
        "geoCategoryName": "The  best nightlife in Ho Chi Minh City"
      },
      {
        "id": 149376,
        "name": "Neighborhoods",
        "shortName": "Neighborhoods",
        "emoji": "houses",
        "keywordCategoryGroup": null,
        "mapLayerGroup": null,
        "geoCategoryName": "The  best neighborhoods to see in Ho Chi Minh City"
      },
      {
        "id": 751,
        "name": "Outdoor dining",
        "shortName": "Outdoor dining",
        "emoji": null,
        "keywordCategoryGroup": "otherEats",
        "mapLayerGroup": "restaurants",
        "geoCategoryName": "The  best outdoor dining in Ho Chi Minh City"
      },
      {
        "id": 181758,
        "name": "Zoos",
        "shortName": "Zoos",
        "emoji": "monkey",
        "keywordCategoryGroup": null,
        "mapLayerGroup": "attractions",
        "geoCategoryName": "The  best zoos in and around Ho Chi Minh City"
      },
      {
        "id": 97205,
        "name": "Architectural buildings",
        "shortName": "Architectural buildings",
        "emoji": "classical-building",
        "keywordCategoryGroup": null,
        "mapLayerGroup": "attractions",
        "geoCategoryName": "The  best architecture in Ho Chi Minh City"
      },
      {
        "id": 100803,
        "name": "Art museums",
        "shortName": "Art museums",
        "emoji": "framed-picture",
        "keywordCategoryGroup": null,
        "mapLayerGroup": "attractions",
        "geoCategoryName": "The  best art museums in Ho Chi Minh City"
      },
      {
        "id": 740,
        "name": "Seafood restaurants",
        "shortName": "Seafood restaurants",
        "emoji": "shrimp",
        "keywordCategoryGroup": null,
        "mapLayerGroup": "restaurants",
        "geoCategoryName": "The  best seafood restaurants in Ho Chi Minh City"
      },
      {
        "id": 760,
        "name": "Sweets",
        "shortName": "Sweets",
        "emoji": "candy",
        "keywordCategoryGroup": null,
        "mapLayerGroup": "desserts",
        "geoCategoryName": "The  best sweets spots in Ho Chi Minh City"
      },
      {
        "id": 762,
        "name": "Restaurants with a view",
        "shortName": "Restaurants with a view",
        "emoji": null,
        "keywordCategoryGroup": "otherEats",
        "mapLayerGroup": "restaurants",
        "geoCategoryName": "The  best restaurants with a view in Ho Chi Minh City"
      },
      {
        "id": 140381,
        "name": "Malls",
        "shortName": "Malls",
        "emoji": "department-store",
        "keywordCategoryGroup": null,
        "mapLayerGroup": null,
        "geoCategoryName": "The  best malls in Ho Chi Minh City"
      },
      {
        "id": 742,
        "name": "Sushi",
        "shortName": "Sushi",
        "emoji": "sushi",
        "keywordCategoryGroup": null,
        "mapLayerGroup": "restaurants",
        "geoCategoryName": "The  best sushi restaurants and sushi bars in Ho Chi Minh City"
      },
      {
        "id": 763,
        "name": "Romantic restaurants",
        "shortName": "Romantic restaurants",
        "emoji": null,
        "keywordCategoryGroup": "otherEats",
        "mapLayerGroup": "restaurants",
        "geoCategoryName": "The  best romantic restaurants in Ho Chi Minh City"
      },
      {
        "id": 1797268,
        "name": "Markets",
        "shortName": "Markets",
        "emoji": "shopping-bags",
        "keywordCategoryGroup": null,
        "mapLayerGroup": null,
        "geoCategoryName": "The  best markets in Ho Chi Minh City"
      },
      {
        "id": 743,
        "name": "Dinner",
        "shortName": "Dinner",
        "emoji": null,
        "keywordCategoryGroup": "otherEats",
        "mapLayerGroup": "restaurants",
        "geoCategoryName": "The  best restaurants to have dinner in Ho Chi Minh City"
      },
      {
        "id": 764,
        "name": "Pastries",
        "shortName": "Pastries",
        "emoji": "shortcake",
        "keywordCategoryGroup": null,
        "mapLayerGroup": "desserts",
        "geoCategoryName": "The  best pastries and patisseries in Ho Chi Minh City"
      },
      {
        "id": 776,
        "name": "Diners",
        "shortName": "Diners",
        "emoji": null,
        "keywordCategoryGroup": "otherEats",
        "mapLayerGroup": "restaurants",
        "geoCategoryName": "The  best diners to try in Ho Chi Minh City"
      },
      {
        "id": 1798945,
        "name": "Pasta",
        "shortName": "Pasta",
        "emoji": "spaghetti",
        "keywordCategoryGroup": null,
        "mapLayerGroup": "restaurants",
        "geoCategoryName": "The  best places for pasta in Ho Chi Minh City"
      },
      {
        "id": 744,
        "name": "Ice cream",
        "shortName": "Ice cream",
        "emoji": "soft-ice-cream",
        "keywordCategoryGroup": null,
        "mapLayerGroup": "desserts",
        "geoCategoryName": "The  best ice cream shops in Ho Chi Minh City"
      },
      {
        "id": 151175,
        "name": "Nightclubs",
        "shortName": "Nightclubs",
        "emoji": "woman-dancing",
        "keywordCategoryGroup": null,
        "mapLayerGroup": "bars",
        "geoCategoryName": "The  best clubs and nightclubs in Ho Chi Minh City"
      },
      {
        "id": 778,
        "name": "Fast food",
        "shortName": "Fast food",
        "emoji": "french-fries",
        "keywordCategoryGroup": null,
        "mapLayerGroup": "restaurants",
        "geoCategoryName": "The  best fast food restaurants in Ho Chi Minh City"
      },
      {
        "id": 779,
        "name": "Trendy restaurants",
        "shortName": "Trendy restaurants",
        "emoji": null,
        "keywordCategoryGroup": "otherEats",
        "mapLayerGroup": "restaurants",
        "geoCategoryName": "Trendy restaurants in Ho Chi Minh City"
      },
      {
        "id": 1805148,
        "name": "Rooftops",
        "shortName": "Rooftops",
        "emoji": "house",
        "keywordCategoryGroup": null,
        "mapLayerGroup": "bars",
        "geoCategoryName": "The  best rooftop spots in Ho Chi Minh City"
      },
      {
        "id": 766,
        "name": "Chinese restaurants",
        "shortName": "Chinese restaurants",
        "emoji": "takeout-box",
        "keywordCategoryGroup": null,
        "mapLayerGroup": "restaurants",
        "geoCategoryName": "The  best Chinese food in Ho Chi Minh City"
      },
      {
        "id": 158371,
        "name": "Parks and gardens",
        "shortName": "Parks and gardens",
        "emoji": "deciduous-tree",
        "keywordCategoryGroup": null,
        "mapLayerGroup": "attractions",
        "geoCategoryName": "The  best parks and gardens in Ho Chi Minh City"
      },
      {
        "id": 780,
        "name": "Vegetarian restaurants",
        "shortName": "Vegetarian restaurants",
        "emoji": "green-salad",
        "keywordCategoryGroup": null,
        "mapLayerGroup": "restaurants",
        "geoCategoryName": "The  best vegetarian restaurants in Ho Chi Minh City"
      },
      {
        "id": 1806914,
        "name": "Croissant",
        "shortName": "Croissant",
        "emoji": "croissant",
        "keywordCategoryGroup": null,
        "mapLayerGroup": "cafes",
        "geoCategoryName": "The  best spots for croissants in Ho Chi Minh City"
      },
      {
        "id": 746,
        "name": "Fine dining",
        "shortName": "Fine dining",
        "emoji": null,
        "keywordCategoryGroup": "otherEats",
        "mapLayerGroup": "restaurants",
        "geoCategoryName": "Nice restaurants and fine dining in Ho Chi Minh City"
      },
      {
        "id": 768,
        "name": "French restaurants",
        "shortName": "French restaurants",
        "emoji": "shallow-pan-of-food",
        "keywordCategoryGroup": null,
        "mapLayerGroup": "restaurants",
        "geoCategoryName": "The  best French restaurants and bistros in Ho Chi Minh City"
      },
      {
        "id": 747,
        "name": "Places to eat",
        "shortName": "Places to eat",
        "emoji": "drooling-face",
        "keywordCategoryGroup": null,
        "mapLayerGroup": "restaurants",
        "geoCategoryName": "The  best places to eat in Ho Chi Minh City"
      },
      {
        "id": 769,
        "name": "Gelato",
        "shortName": "Gelato",
        "emoji": "ice-cream",
        "keywordCategoryGroup": null,
        "mapLayerGroup": "desserts",
        "geoCategoryName": "places to have the best gelato in Ho Chi Minh City"
      },
      {
        "id": 781,
        "name": "Popular restaurants",
        "shortName": "Popular restaurants",
        "emoji": null,
        "keywordCategoryGroup": "otherEats",
        "mapLayerGroup": "restaurants",
        "geoCategoryName": "The  most popular restaurants in Ho Chi Minh City"
      },
      {
        "id": 1816909,
        "name": "Fried chicken",
        "shortName": "Fried chicken",
        "emoji": "poultry-leg",
        "keywordCategoryGroup": null,
        "mapLayerGroup": "restaurants",
        "geoCategoryName": "The  best spots for fried chicken in Ho Chi Minh City"
      },
      {
        "id": 748,
        "name": "Desserts",
        "shortName": "Desserts",
        "emoji": "cupcake",
        "keywordCategoryGroup": null,
        "mapLayerGroup": "desserts",
        "geoCategoryName": "The  best desserts and snacks in Ho Chi Minh City"
      },
      {
        "id": 771,
        "name": "Vegan restaurants",
        "shortName": "Vegan restaurants",
        "emoji": "broccoli",
        "keywordCategoryGroup": null,
        "mapLayerGroup": "restaurants",
        "geoCategoryName": "The  best vegan restaurants in Ho Chi Minh City"
      },
      {
        "id": 161969,
        "name": "Photography museums",
        "shortName": "Photography museums",
        "emoji": "film-frames",
        "keywordCategoryGroup": null,
        "mapLayerGroup": "attractions",
        "geoCategoryName": "The  best photography galleries and museums in Ho Chi Minh City"
      },
      {
        "id": 782,
        "name": "Buffets",
        "shortName": "Buffets",
        "emoji": "drooling-face",
        "keywordCategoryGroup": null,
        "mapLayerGroup": "restaurants",
        "geoCategoryName": "places to eat the best buffet in Ho Chi Minh City"
      },
      {
        "id": 1818389,
        "name": "Casual restaurants",
        "shortName": "Casual restaurants",
        "emoji": "face-savoring-food",
        "keywordCategoryGroup": null,
        "mapLayerGroup": "restaurants",
        "geoCategoryName": "The  best casual restaurants in Ho Chi Minh City"
      },
      {
        "id": 749,
        "name": "Lunch",
        "shortName": "Lunch",
        "emoji": null,
        "keywordCategoryGroup": "otherEats",
        "mapLayerGroup": "restaurants",
        "geoCategoryName": "The  best spots for lunch in Ho Chi Minh City"
      },
      {
        "id": 772,
        "name": "Asian food",
        "shortName": "Asian food",
        "emoji": "steaming-bowl",
        "keywordCategoryGroup": null,
        "mapLayerGroup": "restaurants",
        "geoCategoryName": "The  best Asian food in Ho Chi Minh City"
      },
      {
        "id": 783,
        "name": "American restaurants",
        "shortName": "American restaurants",
        "emoji": "hamburger",
        "keywordCategoryGroup": null,
        "mapLayerGroup": "restaurants",
        "geoCategoryName": "The  best American restaurants in Ho Chi Minh City"
      },
      {
        "id": 1821751,
        "name": "Places to go out",
        "shortName": "Places to go out",
        "emoji": "night-with-stars",
        "keywordCategoryGroup": null,
        "mapLayerGroup": "bars",
        "geoCategoryName": "The  best places to go out in Ho Chi Minh City"
      },
      {
        "id": 773,
        "name": "Rooftop bars",
        "shortName": "Rooftop bars",
        "emoji": "cocktail-glass",
        "keywordCategoryGroup": null,
        "mapLayerGroup": "bars",
        "geoCategoryName": "The  best rooftop bars in Ho Chi Minh City"
      },
      {
        "id": 170964,
        "name": "Spas",
        "shortName": "Spas",
        "emoji": "woman-getting-massage-light-skin-tone",
        "keywordCategoryGroup": null,
        "mapLayerGroup": null,
        "geoCategoryName": "The  best spas in Ho Chi Minh City"
      },
      {
        "id": 785,
        "name": "Pancakes",
        "shortName": "Pancakes",
        "emoji": "pancakes",
        "keywordCategoryGroup": null,
        "mapLayerGroup": "restaurants",
        "geoCategoryName": "The  best pancakes in Ho Chi Minh City"
      },
      {
        "id": 1828312,
        "name": "Place to exchange money",
        "shortName": "Place to exchange money",
        "emoji": "currency-exchange",
        "keywordCategoryGroup": null,
        "mapLayerGroup": null,
        "geoCategoryName": "The  best places to exchange money in Ho Chi Minh City"
      },
      {
        "id": 837021,
        "name": "Historic buildings",
        "shortName": "Historic buildings",
        "emoji": null,
        "keywordCategoryGroup": null,
        "mapLayerGroup": "attractions",
        "geoCategoryName": "The  most historic buildings and sites in Ho Chi Minh City"
      },
      {
        "id": 752,
        "name": "Donuts",
        "shortName": "Donuts",
        "emoji": "doughnut",
        "keywordCategoryGroup": null,
        "mapLayerGroup": "desserts",
        "geoCategoryName": "The  best donut places in Ho Chi Minh City"
      },
      {
        "id": 774,
        "name": "French bakeries",
        "shortName": "French bakeries",
        "emoji": "baguette-bread",
        "keywordCategoryGroup": null,
        "mapLayerGroup": "cafes",
        "geoCategoryName": "The  best French bakeries in Ho Chi Minh City"
      },
      {
        "id": 172763,
        "name": "Street markets",
        "shortName": "Street markets",
        "emoji": "oden",
        "keywordCategoryGroup": null,
        "mapLayerGroup": "attractions",
        "geoCategoryName": "The  best street markets in Ho Chi Minh City"
      },
      {
        "id": 788,
        "name": "Street food",
        "shortName": "Street food",
        "emoji": "hot-dog",
        "keywordCategoryGroup": null,
        "mapLayerGroup": "restaurants",
        "geoCategoryName": "The  best street food in Ho Chi Minh City"
      },
      {
        "id": 752468,
        "name": "Scenic lookouts",
        "shortName": null,
        "emoji": "sunrise-over-mountains",
        "keywordCategoryGroup": null,
        "mapLayerGroup": "attractions",
        "geoCategoryName": "The  best views, scenic lookouts, and viewpoints in Ho Chi Minh City"
      },
      {
        "id": 1830086,
        "name": "Soup",
        "shortName": "Soup",
        "emoji": "pot-of-food",
        "keywordCategoryGroup": null,
        "mapLayerGroup": "restaurants",
        "geoCategoryName": "The  best spots for soup in Ho Chi Minh City"
      },
      {
        "id": 754267,
        "name": "Shopping streets",
        "shortName": "Shopping streets",
        "emoji": null,
        "keywordCategoryGroup": null,
        "mapLayerGroup": "attractions",
        "geoCategoryName": "The  best shopping streets and areas in Ho Chi Minh City"
      },
      {
        "id": 1831777,
        "name": "Chicken wings",
        "shortName": "Chicken wings",
        "emoji": "chicken",
        "keywordCategoryGroup": null,
        "mapLayerGroup": "restaurants",
        "geoCategoryName": "The  best spots for chicken wings in Ho Chi Minh City"
      },
      {
        "id": 844217,
        "name": "Seasonal attractions",
        "shortName": "Seasonal attractions",
        "emoji": null,
        "keywordCategoryGroup": null,
        "mapLayerGroup": "attractions",
        "geoCategoryName": "The  best seasonal attractions and holiday events in Ho Chi Minh City"
      },
      {
        "id": 753,
        "name": "New restaurants",
        "shortName": "New restaurants",
        "emoji": null,
        "keywordCategoryGroup": "otherEats",
        "mapLayerGroup": "restaurants",
        "geoCategoryName": "The  best new restaurants to visit in Ho Chi Minh City"
      },
      {
        "id": 775,
        "name": "Fun restaurants",
        "shortName": "Fun restaurants",
        "emoji": null,
        "keywordCategoryGroup": "otherEats",
        "mapLayerGroup": "restaurants",
        "geoCategoryName": "Cute and themed restaurants in Ho Chi Minh City"
      },
      {
        "id": 757865,
        "name": "Pet-friendly places",
        "shortName": "Pet-Friendly",
        "emoji": null,
        "keywordCategoryGroup": null,
        "mapLayerGroup": "restaurants",
        "geoCategoryName": "The  best pet-friendly places and activities in Ho Chi Minh City"
      },
      {
        "id": 1836980,
        "name": "Pub",
        "shortName": "Pub",
        "emoji": "beer-mug",
        "keywordCategoryGroup": null,
        "mapLayerGroup": "bars",
        "geoCategoryName": "The  best pubs in Ho Chi Minh City"
      },
      {
        "id": 847815,
        "name": "Fun attractions",
        "shortName": "Fun things to do",
        "emoji": "circus-tent",
        "keywordCategoryGroup": null,
        "mapLayerGroup": "attractions",
        "geoCategoryName": "Fun things to do in Ho Chi Minh City:  fun attractions and activities"
      },
      {
        "id": 99004,
        "name": "Art galleries",
        "shortName": "Art galleries",
        "emoji": "artist-palette",
        "keywordCategoryGroup": null,
        "mapLayerGroup": "attractions",
        "geoCategoryName": "The  best art galleries in Ho Chi Minh City"
      },
      {
        "id": 761463,
        "name": "Indian restaurants",
        "shortName": "Indian",
        "emoji": null,
        "keywordCategoryGroup": null,
        "mapLayerGroup": "restaurants",
        "geoCategoryName": "The  best Indian foods and restaurants in Ho Chi Minh City"
      },
      {
        "id": 1838665,
        "name": "Salad",
        "shortName": "Salad",
        "emoji": "green-salad",
        "keywordCategoryGroup": null,
        "mapLayerGroup": "restaurants",
        "geoCategoryName": "The  best spots for salad in Ho Chi Minh City"
      },
      {
        "id": 853212,
        "name": "Resorts",
        "shortName": "Resorts",
        "emoji": null,
        "keywordCategoryGroup": null,
        "mapLayerGroup": "restaurants",
        "geoCategoryName": "The  best resorts and all-inclusive vacations in Ho Chi Minh City"
      },
      {
        "id": 763262,
        "name": "Middle Eastern restaurants",
        "shortName": "Middle Eastern",
        "emoji": null,
        "keywordCategoryGroup": null,
        "mapLayerGroup": "restaurants",
        "geoCategoryName": "The  best Middle Eastern foods and restaurants in Ho Chi Minh City"
      },
      {
        "id": 1843918,
        "name": "Chicken",
        "shortName": "Chicken",
        "emoji": "chicken",
        "keywordCategoryGroup": null,
        "mapLayerGroup": "restaurants",
        "geoCategoryName": "The  best spots for chicken in Ho Chi Minh City"
      },
      {
        "id": 860408,
        "name": "Public squares",
        "shortName": "Squares",
        "emoji": null,
        "keywordCategoryGroup": null,
        "mapLayerGroup": "attractions",
        "geoCategoryName": "The  best public squares in Ho Chi Minh City"
      },
      {
        "id": 102602,
        "name": "Arts and culture",
        "shortName": "Arts and culture",
        "emoji": "performing-arts",
        "keywordCategoryGroup": null,
        "mapLayerGroup": "attractions",
        "geoCategoryName": "The  best places to visit for arts and culture in Ho Chi Minh City"
      },
      {
        "id": 765061,
        "name": "Thai restaurants",
        "shortName": "Thai",
        "emoji": null,
        "keywordCategoryGroup": null,
        "mapLayerGroup": "restaurants",
        "geoCategoryName": "The  best Thai foods and restaurants in Ho Chi Minh City"
      },
      {
        "id": 1845656,
        "name": "Bed and breakfast",
        "shortName": "Bed and breakfast",
        "emoji": "bed",
        "keywordCategoryGroup": null,
        "mapLayerGroup": null,
        "geoCategoryName": "The  best bed and breakfasts in Ho Chi Minh City"
      },
      {
        "id": 869403,
        "name": "Night markets",
        "shortName": "Night markets",
        "emoji": null,
        "keywordCategoryGroup": null,
        "mapLayerGroup": "attractions",
        "geoCategoryName": "The  best night markets in Ho Chi Minh City"
      },
      {
        "id": 774056,
        "name": "Barbecue restaurants",
        "shortName": "BBQ",
        "emoji": null,
        "keywordCategoryGroup": null,
        "mapLayerGroup": "restaurants",
        "geoCategoryName": "The  best BBQ restaurants in Ho Chi Minh City"
      },
      {
        "id": 1849109,
        "name": "Boutiques",
        "shortName": "Boutiques",
        "emoji": "shopping-bags",
        "keywordCategoryGroup": null,
        "mapLayerGroup": null,
        "geoCategoryName": "The  best boutiques in Ho Chi Minh City"
      },
      {
        "id": 871202,
        "name": "Food halls",
        "shortName": "Food halls",
        "emoji": null,
        "keywordCategoryGroup": null,
        "mapLayerGroup": "restaurants",
        "geoCategoryName": "The  best food halls, market halls, and food courts in Ho Chi Minh City"
      },
      {
        "id": 111597,
        "name": "Buildings",
        "shortName": "Buildings",
        "emoji": "office-building",
        "keywordCategoryGroup": null,
        "mapLayerGroup": "attractions",
        "geoCategoryName": "Ho Chi Minh City skyline: the  most iconic buildings and best views in Ho Chi Minh City"
      },
      {
        "id": 775855,
        "name": "Mexican restaurants",
        "shortName": "Mexican",
        "emoji": null,
        "keywordCategoryGroup": null,
        "mapLayerGroup": "restaurants",
        "geoCategoryName": "The  best Mexican foods and restaurants in Ho Chi Minh City"
      },
      {
        "id": 1852609,
        "name": "Spa hotels",
        "shortName": "Spa hotels",
        "emoji": "hotel",
        "keywordCategoryGroup": null,
        "mapLayerGroup": null,
        "geoCategoryName": "The  best spa hotels in Ho Chi Minh City"
      },
      {
        "id": 1503126,
        "name": "Steak",
        "shortName": "Steak",
        "emoji": "cut-of-meat",
        "keywordCategoryGroup": null,
        "mapLayerGroup": "restaurants",
        "geoCategoryName": "The  best places for steak in Ho Chi Minh City"
      },
      {
        "id": 120592,
        "name": "Churches",
        "shortName": "Churches",
        "emoji": "church",
        "keywordCategoryGroup": null,
        "mapLayerGroup": "attractions",
        "geoCategoryName": "The  best churches in Ho Chi Minh City"
      },
      {
        "id": 779453,
        "name": "Turkish restaurants",
        "shortName": "Turkish",
        "emoji": null,
        "keywordCategoryGroup": null,
        "mapLayerGroup": "restaurants",
        "geoCategoryName": "The  best Turkish foods and restaurants in Ho Chi Minh City"
      },
      {
        "id": 1854404,
        "name": "Cooking classes",
        "shortName": "Cooking classes",
        "emoji": "cooking",
        "keywordCategoryGroup": null,
        "mapLayerGroup": null,
        "geoCategoryName": "The  best cooking classes in Ho Chi Minh City"
      },
      {
        "id": 1507796,
        "name": "Ramen",
        "shortName": "Ramen",
        "emoji": "steaming-bowl",
        "keywordCategoryGroup": null,
        "mapLayerGroup": "restaurants",
        "geoCategoryName": "The  best spots for ramen in Ho Chi Minh City"
      },
      {
        "id": 1518153,
        "name": "Dim sum",
        "shortName": "Dim sum",
        "emoji": "dumpling",
        "keywordCategoryGroup": null,
        "mapLayerGroup": "restaurants",
        "geoCategoryName": "The  best spots for dim sum in Ho Chi Minh City"
      },
      {
        "id": 122391,
        "name": "Clothing stores",
        "shortName": "Clothing stores",
        "emoji": "womans-clothes",
        "keywordCategoryGroup": null,
        "mapLayerGroup": null,
        "geoCategoryName": "The  coolest clothing stores and boutiques in Ho Chi Minh City"
      },
      {
        "id": 783051,
        "name": "Fusion restaurants",
        "shortName": "Fusion foods",
        "emoji": null,
        "keywordCategoryGroup": null,
        "mapLayerGroup": "restaurants",
        "geoCategoryName": "The  best fusion and Asian fusion restaurants in Ho Chi Minh City"
      },
      {
        "id": 1856201,
        "name": "Crepes",
        "shortName": "Crepes",
        "emoji": "pancakes",
        "keywordCategoryGroup": null,
        "mapLayerGroup": "restaurants",
        "geoCategoryName": "The  best spots for crepes in Ho Chi Minh City"
      },
      {
        "id": 784850,
        "name": "Wine bars",
        "shortName": "Wine bars",
        "emoji": null,
        "keywordCategoryGroup": null,
        "mapLayerGroup": "bars",
        "geoCategoryName": "The  best wine bars and tasting rooms in Ho Chi Minh City"
      },
      {
        "id": 1518274,
        "name": "Massage",
        "shortName": "Massage",
        "emoji": "person-getting-massage",
        "keywordCategoryGroup": null,
        "mapLayerGroup": null,
        "geoCategoryName": "The  best places for massage in Ho Chi Minh City"
      },
      {
        "id": 792046,
        "name": "Vietnamese restaurants",
        "shortName": "Vietnamese",
        "emoji": null,
        "keywordCategoryGroup": null,
        "mapLayerGroup": "restaurants",
        "geoCategoryName": "The  best Vietnamese foods and restaurants in Ho Chi Minh City"
      },
      {
        "id": 1533040,
        "name": "Pho",
        "shortName": "Pho",
        "emoji": "steaming-bowl",
        "keywordCategoryGroup": null,
        "mapLayerGroup": "restaurants",
        "geoCategoryName": "The  best spots for pho in Ho Chi Minh City"
      },
      {
        "id": 799242,
        "name": "Latin American restaurants",
        "shortName": "Latin American",
        "emoji": null,
        "keywordCategoryGroup": null,
        "mapLayerGroup": "restaurants",
        "geoCategoryName": "The  best Latin and South American foods and restaurants in Ho Chi Minh City"
      },
      {
        "id": 1780350,
        "name": "Lounges",
        "shortName": "Lounges",
        "emoji": "cocktail-glass",
        "keywordCategoryGroup": null,
        "mapLayerGroup": "bars",
        "geoCategoryName": "The  best lounges in Ho Chi Minh City"
      },
      {
        "id": 804639,
        "name": "Spanish restaurants",
        "shortName": "Spanish",
        "emoji": null,
        "keywordCategoryGroup": null,
        "mapLayerGroup": "restaurants",
        "geoCategoryName": "The  best Spanish foods and restaurants in Ho Chi Minh City"
      },
      {
        "id": 1781981,
        "name": "Tacos",
        "shortName": "Tacos",
        "emoji": "taco",
        "keywordCategoryGroup": null,
        "mapLayerGroup": "restaurants",
        "geoCategoryName": "The  best spots for tacos in Ho Chi Minh City"
      },
      {
        "id": 813634,
        "name": "Live music venues",
        "shortName": "Live music",
        "emoji": null,
        "keywordCategoryGroup": null,
        "mapLayerGroup": "bars",
        "geoCategoryName": "The  best live music venues and concert halls in Ho Chi Minh City"
      },
      {
        "id": 1786056,
        "name": "Hostel",
        "shortName": "Hostel",
        "emoji": "person-in-bed",
        "keywordCategoryGroup": null,
        "mapLayerGroup": null,
        "geoCategoryName": "The  best hostels in Ho Chi Minh City"
      },
      {
        "id": 817232,
        "name": "Bars with live music",
        "shortName": "Music bars",
        "emoji": null,
        "keywordCategoryGroup": null,
        "mapLayerGroup": "bars",
        "geoCategoryName": "The  best bars with live music in Ho Chi Minh City"
      },
      {
        "id": 1789264,
        "name": "Noodles",
        "shortName": "Noodles",
        "emoji": "steaming-bowl",
        "keywordCategoryGroup": null,
        "mapLayerGroup": "restaurants",
        "geoCategoryName": "The  best noodle spots in Ho Chi Minh City"
      },
      {
        "id": 1859616,
        "name": "Pizzas",
        "shortName": "Pizzas",
        "emoji": "pizza",
        "keywordCategoryGroup": null,
        "mapLayerGroup": "restaurants",
        "geoCategoryName": "The  best pizza spots in Ho Chi Minh City"
      },
      {
        "id": 824428,
        "name": "Food trucks",
        "shortName": "Food trucks",
        "emoji": null,
        "keywordCategoryGroup": null,
        "mapLayerGroup": "restaurants",
        "geoCategoryName": "The  best food trucks in Ho Chi Minh City"
      },
      {
        "id": 1792690,
        "name": "Fish and chips",
        "shortName": "Fish and chips",
        "emoji": "fish",
        "keywordCategoryGroup": null,
        "mapLayerGroup": "restaurants",
        "geoCategoryName": "The  best spots for fish and chips in Ho Chi Minh City"
      },
      {
        "id": 754,
        "name": "Japanese restaurants",
        "shortName": "Japanese restaurants",
        "emoji": "bento-box",
        "keywordCategoryGroup": null,
        "mapLayerGroup": "restaurants",
        "geoCategoryName": "The  best Japanese food and restaurants in Ho Chi Minh City"
      },
      {
        "id": 127788,
        "name": "Farms",
        "shortName": "Farms",
        "emoji": "cow",
        "keywordCategoryGroup": null,
        "mapLayerGroup": null,
        "geoCategoryName": "The  best farms near Ho Chi Minh City area"
      },
      {
        "id": 129587,
        "name": "Free attractions",
        "shortName": "Free attractions",
        "emoji": "fountain",
        "keywordCategoryGroup": null,
        "mapLayerGroup": "attractions",
        "geoCategoryName": "The  best free attractions in Ho Chi Minh City"
      },
      {
        "id": 1861416,
        "name": "Coffee roasters",
        "shortName": "Coffee roasters",
        "emoji": "hot-beverage",
        "keywordCategoryGroup": null,
        "mapLayerGroup": null,
        "geoCategoryName": "The  best coffee roasters in Ho Chi Minh City"
      },
      {
        "id": 736,
        "name": "Italian restaurants",
        "shortName": "Italian restaurants",
        "emoji": "spaghetti",
        "keywordCategoryGroup": null,
        "mapLayerGroup": "restaurants",
        "geoCategoryName": "The  best Italian restaurants in Ho Chi Minh City"
      },
      {
        "id": 833423,
        "name": "Paddle sports",
        "shortName": "Paddling",
        "emoji": null,
        "keywordCategoryGroup": null,
        "mapLayerGroup": null,
        "geoCategoryName": "The  best paddle sports, kayak rentals, and SUP in Ho Chi Minh City"
      },
      {
        "id": 1795882,
        "name": "Walks",
        "shortName": "Walks",
        "emoji": "person-walking",
        "keywordCategoryGroup": null,
        "mapLayerGroup": "attractions",
        "geoCategoryName": "The  best walking spots in Ho Chi Minh City"
      },
      {
        "id": 756,
        "name": "Bread",
        "shortName": "Bread",
        "emoji": "bread",
        "keywordCategoryGroup": null,
        "mapLayerGroup": "cafes",
        "geoCategoryName": "The  best bread shops in Ho Chi Minh City"
      },
      {
        "id": 131386,
        "name": "Free museums",
        "shortName": "Free museums",
        "emoji": "classical-building",
        "keywordCategoryGroup": null,
        "mapLayerGroup": "attractions",
        "geoCategoryName": "The  best free museums in Ho Chi Minh City"
      },
      {
        "id": 1863217,
        "name": "Places to propose",
        "shortName": "Places to propose",
        "emoji": "ring",
        "keywordCategoryGroup": null,
        "mapLayerGroup": null,
        "geoCategoryName": "The  best places to propose in Ho Chi Minh City"
      },
      {
        "id": 757,
        "name": "Cakes",
        "shortName": "Cakes",
        "emoji": "birthday-cake",
        "keywordCategoryGroup": null,
        "mapLayerGroup": "desserts",
        "geoCategoryName": "The  best cake shops and cake bakeries in Ho Chi Minh City"
      },
      {
        "id": 758,
        "name": "Famous restaurants",
        "shortName": "Famous restaurants",
        "emoji": null,
        "keywordCategoryGroup": "otherEats",
        "mapLayerGroup": "restaurants",
        "geoCategoryName": "The  most famous restaurants in Ho Chi Minh City"
      },
      {
        "id": 133185,
        "name": "History museums",
        "shortName": "History museums",
        "emoji": "mantelpiece-clock",
        "keywordCategoryGroup": null,
        "mapLayerGroup": "attractions",
        "geoCategoryName": "The  best history museums in Ho Chi Minh City"
      },
      {
        "id": 759,
        "name": "Bubble tea or boba",
        "shortName": "Bubble tea or boba",
        "emoji": "boba-tea",
        "keywordCategoryGroup": null,
        "mapLayerGroup": "desserts",
        "geoCategoryName": "The  best bubble tea (boba) in Ho Chi Minh City"
      },
      {
        "id": 136783,
        "name": "Hotels",
        "shortName": "Hotels",
        "emoji": "hotel",
        "keywordCategoryGroup": null,
        "mapLayerGroup": null,
        "geoCategoryName": "The  best hotels in Ho Chi Minh City"
      }
    ],
    "searchedCategories": [
      {
        "id": 1544685,
        "name": "5 star hotels",
        "geoCategoryName": "The  best 5 star hotels in Ho Chi Minh City",
        "freeImageKey": "j1Vq2g5mC1DX9JZMRTEh176y5bljHqob"
      },
      {
        "id": 1536924,
        "name": "Seafood buffet",
        "geoCategoryName": "The  best seafood buffet restaurants in Ho Chi Minh City",
        "freeImageKey": "FLj5bUMUFJwmykAR2BGtibc3gxPs9zdn"
      },
      {
        "id": 1540072,
        "name": "International hospital",
        "geoCategoryName": "The  best international hospitals in Ho Chi Minh City",
        "freeImageKey": "gveUN4Z6SsO3JYrl5I5bKdPpeTLRANZa"
      },
      {
        "id": 1545449,
        "name": "Serviced apartment",
        "geoCategoryName": "The  best serviced apartments in Ho Chi Minh City",
        "freeImageKey": "fjgRqEKk6SFTGXrKqffoFWGRVW6iE1XT"
      },
      {
        "id": 1519157,
        "name": "Condo",
        "geoCategoryName": "The  best condo rentals in Ho Chi Minh City",
        "freeImageKey": "Wl6dEZiANZ7OpYLvNQoWXnimi3tGm73p"
      },
      {
        "id": 1533486,
        "name": "Western restaurant",
        "geoCategoryName": "The  best western restaurants in Ho Chi Minh City",
        "freeImageKey": "AlySEq0UwucI7G8WE8oP1zVw0jKpsFPW"
      },
      {
        "id": 1539428,
        "name": "Banh xeo",
        "geoCategoryName": "The  best places for banh xeo in Ho Chi Minh City",
        "freeImageKey": "VkY2rMlvdMMIWsbKAyf3B6fQSpGO7aWH"
      }
    ],
    "itineraries": [
      {
        "id": 56,
        "days": 1
      },
      {
        "id": 57,
        "days": 2
      },
      {
        "id": 58,
        "days": 3
      },
      {
        "id": 59,
        "days": 4
      },
      {
        "id": 60,
        "days": 5
      }
    ],
    "nearbyAttractions": [
      {
        "id": 104391,
        "geoCategoryName": "Top  things to do and attractions in Bangkok"
      },
      {
        "id": 104397,
        "geoCategoryName": "Top  things to do and attractions in Siem Reap"
      },
      {
        "id": 104406,
        "geoCategoryName": "Top  things to do and attractions in Hoi An"
      },
      {
        "id": 104417,
        "geoCategoryName": "Top  things to do and attractions in Kuala Lumpur"
      },
      {
        "id": 104427,
        "geoCategoryName": "Top  things to do and attractions in Phnom Penh"
      },
      {
        "id": 104431,
        "geoCategoryName": "Top  things to do and attractions in Da Nang"
      },
      {
        "id": 104458,
        "geoCategoryName": "Top  things to do and attractions in Pattaya"
      },
      {
        "id": 104466,
        "geoCategoryName": "Top  things to do and attractions in Hue"
      },
      {
        "id": 104467,
        "geoCategoryName": "Top  things to do and attractions in Nha Trang"
      },
      {
        "id": 104512,
        "geoCategoryName": "Top  things to do and attractions in Da Lat"
      },
      {
        "id": 104541,
        "geoCategoryName": "Top  things to do and attractions in Sihanoukville"
      },
      {
        "id": 104545,
        "geoCategoryName": "Top  things to do and attractions in Phan Thiet"
      },
      {
        "id": 1586484,
        "geoCategoryName": "Top  things to do and attractions in Battambang"
      },
      {
        "id": 1586584,
        "geoCategoryName": "Top  things to do and attractions in Kampot"
      },
      {
        "id": 1586589,
        "geoCategoryName": "Top  things to do and attractions in Vung Tau"
      },
      {
        "id": 1586608,
        "geoCategoryName": "Top  things to do and attractions in Can Tho"
      },
      {
        "id": 1586781,
        "geoCategoryName": "Top  things to do and attractions in Duong Dong"
      },
      {
        "id": 1587026,
        "geoCategoryName": "Top  things to do and attractions in Kep"
      },
      {
        "id": 1587054,
        "geoCategoryName": "Top  things to do and attractions in Quy Nhon"
      },
      {
        "id": 1587150,
        "geoCategoryName": "Top  things to do and attractions in Buon Ma Thuot"
      },
      {
        "id": 1587228,
        "geoCategoryName": "Top  things to do and attractions in Kratie"
      },
      {
        "id": 1587272,
        "geoCategoryName": "Top  things to do and attractions in Kampong Cham"
      },
      {
        "id": 106137,
        "geoCategoryName": "Top  things to do and attractions in Mui Ne"
      }
    ],
    "nearbyRestaurants": [
      {
        "id": 414,
        "geoCategoryName": "Where to eat: the  best restaurants in Bangkok"
      },
      {
        "id": 520,
        "geoCategoryName": "Where to eat: the  best restaurants in Siem Reap"
      },
      {
        "id": 73978,
        "geoCategoryName": "Where to eat: the  best restaurants in Hoi An"
      },
      {
        "id": 73989,
        "geoCategoryName": "Where to eat: the  best restaurants in Kuala Lumpur"
      },
      {
        "id": 73999,
        "geoCategoryName": "Where to eat: the  best restaurants in Phnom Penh"
      },
      {
        "id": 74003,
        "geoCategoryName": "Where to eat: the  best restaurants in Da Nang"
      },
      {
        "id": 74030,
        "geoCategoryName": "Where to eat: the  best restaurants in Pattaya"
      },
      {
        "id": 74038,
        "geoCategoryName": "Where to eat: the  best restaurants in Hue"
      },
      {
        "id": 74039,
        "geoCategoryName": "Where to eat: the  best restaurants in Nha Trang"
      },
      {
        "id": 74084,
        "geoCategoryName": "Where to eat: the  best restaurants in Da Lat"
      },
      {
        "id": 74113,
        "geoCategoryName": "Where to eat: the  best restaurants in Sihanoukville"
      },
      {
        "id": 74117,
        "geoCategoryName": "Where to eat: the  best restaurants in Phan Thiet"
      },
      {
        "id": 197755,
        "geoCategoryName": "Where to eat: the  best restaurants in Battambang"
      },
      {
        "id": 197862,
        "geoCategoryName": "Where to eat: the  best restaurants in Kampot"
      },
      {
        "id": 197867,
        "geoCategoryName": "Where to eat: the  best restaurants in Vung Tau"
      },
      {
        "id": 197889,
        "geoCategoryName": "Where to eat: the  best restaurants in Can Tho"
      },
      {
        "id": 198067,
        "geoCategoryName": "Where to eat: the  best restaurants in Duong Dong"
      },
      {
        "id": 198319,
        "geoCategoryName": "Where to eat: the  best restaurants in Kep"
      },
      {
        "id": 198347,
        "geoCategoryName": "Where to eat: the  best restaurants in Chau Doc"
      },
      {
        "id": 198349,
        "geoCategoryName": "Where to eat: the  best restaurants in Quy Nhon"
      },
      {
        "id": 198453,
        "geoCategoryName": "Where to eat: the  best restaurants in Buon Ma Thuot"
      },
      {
        "id": 198586,
        "geoCategoryName": "Where to eat: the  best restaurants in Kampong Cham"
      },
      {
        "id": 198590,
        "geoCategoryName": "Where to eat: the  best restaurants in Long Xuyen"
      },
      {
        "id": 198643,
        "geoCategoryName": "Where to eat: the  best restaurants in An Thoi"
      },
      {
        "id": 198644,
        "geoCategoryName": "Where to eat: the  best restaurants in Tay Ninh"
      },
      {
        "id": 198707,
        "geoCategoryName": "Where to eat: the  best restaurants in Ham Ninh"
      },
      {
        "id": 75709,
        "geoCategoryName": "Where to eat: the  best restaurants in Mui Ne"
      }
    ],
    "nearbySameCategory": [],
    "nearbyTopRankedSameCategory": null,
    "nearbyGeos": [
      {
        "name": "Vung Tau",
        "englishName": "Vung Tau",
        "id": 456
      },
      {
        "name": "Tay Ninh",
        "englishName": "Tay Ninh",
        "id": 4000
      },
      {
        "name": "Cai Be",
        "englishName": "Cai Be",
        "id": 3908
      },
      {
        "name": "Can Tho",
        "englishName": "Can Tho",
        "id": 486
      },
      {
        "name": "Long Xuyen",
        "englishName": "Long Xuyen",
        "id": 3209
      },
      {
        "name": "Phan Thiet",
        "englishName": "Phan Thiet",
        "id": 277
      },
      {
        "name": "Chau Doc",
        "englishName": "Chau Doc",
        "id": 1547
      },
      {
        "name": "Mui Ne",
        "englishName": "Mui Ne",
        "id": 146264
      },
      {
        "name": "Kampong Cham",
        "englishName": "Kampong Cham",
        "id": 3178
      },
      {
        "name": "Kratie",
        "englishName": "Kratie",
        "id": 2749
      },
      {
        "name": "Phnom Penh",
        "englishName": "Phnom Penh",
        "id": 44
      },
      {
        "name": "Da Lat",
        "englishName": "Da Lat",
        "id": 174
      },
      {
        "name": "Kep",
        "englishName": "Kep",
        "id": 1447
      },
      {
        "name": "Buon Ma Thuot",
        "englishName": "Buon Ma Thuot",
        "id": 2050
      },
      {
        "name": "Kampot",
        "englishName": "Kampot",
        "id": 451
      },
      {
        "name": "Ham Ninh",
        "englishName": "Ham Ninh",
        "id": 5684
      },
      {
        "name": "An Thoi",
        "englishName": "An Thoi",
        "id": 3995
      },
      {
        "name": "Duong Dong",
        "englishName": "Duong Dong",
        "id": 773
      },
      {
        "name": "Nha Trang",
        "englishName": "Nha Trang",
        "id": 93
      },
      {
        "name": "Sihanoukville",
        "englishName": "Sihanoukville",
        "id": 263
      },
      {
        "name": "Siem Reap",
        "englishName": "Siem Reap",
        "id": 11
      },
      {
        "name": "Quy Nhon",
        "englishName": "Quy Nhon",
        "id": 1556
      },
      {
        "name": "Battambang",
        "englishName": "Battambang",
        "id": 300
      },
      {
        "name": "Champasak Town",
        "englishName": "Champasak Town",
        "id": 3379
      },
      {
        "name": "Pakse",
        "englishName": "Pakse",
        "id": 1790
      },
      {
        "name": "Chanthaburi",
        "englishName": "Chanthaburi",
        "id": 1313
      },
      {
        "name": "Ubon Ratchathani",
        "englishName": "Ubon Ratchathani",
        "id": 1369
      },
      {
        "name": "Duy Xuyen District",
        "englishName": "Duy Xuyen",
        "id": 8944
      },
      {
        "name": "Hoi An",
        "englishName": "Hoi An",
        "id": 21
      },
      {
        "name": "Buriram",
        "englishName": "Buriram",
        "id": 1957
      }
    ],
    "canShowWeatherLinks": true,
    "geoNames": {
      "en": "Ho Chi Minh City",
      "fr": "Hô-Chi-Minh-Ville",
      "ja": "ホーチミン",
      "zh": "胡志明市",
      "ko": "호치민시",
      "es": "Ho Chi Minh City",
      "pt": "Cidade de Ho Chi Minh",
      "it": "Ho Chi Minh (città)"
    },
    "geoCategoryLocalizedNames": {
      "en": "The  best seafood buffet restaurants in Ho Chi Minh City",
      "fr": "Les  meilleurs restaurants de buffet de fruits de mer à Hô-Chi-Minh-Ville",
      "ja": "ホーチミンのの最高のシーフードビュッフェレストラン",
      "zh": "胡志明市中个最佳海鲜自助餐厅",
      "ko": "호치민시의  최고의 해산물 뷔페 레스토랑",
      "es": "Los  mejores restaurantes de buffet de mariscos en Ho Chi Minh City",
      "pt": "Os  melhores restaurantes de buffet de frutos do mar em Cidade de Ho Chi Minh",
      "it": "I  migliori ristoranti di buffet di frutti di mare a Ho Chi Minh (città)"
    }
  },
  "canonicalUrl": "https://wanderlog.com/list/geoCategory/1536924/best-seafood-buffet-restaurants-in-ho-chi-minh-city",
  "indexable": true,
  "sourceSite": "Wanderlog"
}
